// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_coll_buffer_info {
 *     void *buffer;
 *     ucc_count_t count;
 *     ucc_datatype_t datatype;
 *     ucc_memory_type_t mem_type;
 * }
 * }
 */
public class ucc_coll_buffer_info {

    ucc_coll_buffer_info() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_POINTER.withName("buffer"),
        Ucc.C_LONG.withName("count"),
        Ucc.C_LONG.withName("datatype"),
        Ucc.C_INT.withName("mem_type"),
        MemoryLayout.paddingLayout(4)
    ).withName("ucc_coll_buffer_info");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout buffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("buffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *buffer
     * }
     */
    public static final AddressLayout buffer$layout() {
        return buffer$LAYOUT;
    }

    private static final long buffer$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *buffer
     * }
     */
    public static final long buffer$offset() {
        return buffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *buffer
     * }
     */
    public static MemorySegment buffer(MemorySegment struct) {
        return struct.get(buffer$LAYOUT, buffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *buffer
     * }
     */
    public static void buffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(buffer$LAYOUT, buffer$OFFSET, fieldValue);
    }

    private static final OfLong count$LAYOUT = (OfLong)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_count_t count
     * }
     */
    public static final OfLong count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_count_t count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_count_t count
     * }
     */
    public static long count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_count_t count
     * }
     */
    public static void count(MemorySegment struct, long fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfLong datatype$LAYOUT = (OfLong)$LAYOUT.select(groupElement("datatype"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_datatype_t datatype
     * }
     */
    public static final OfLong datatype$layout() {
        return datatype$LAYOUT;
    }

    private static final long datatype$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_datatype_t datatype
     * }
     */
    public static final long datatype$offset() {
        return datatype$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_datatype_t datatype
     * }
     */
    public static long datatype(MemorySegment struct) {
        return struct.get(datatype$LAYOUT, datatype$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_datatype_t datatype
     * }
     */
    public static void datatype(MemorySegment struct, long fieldValue) {
        struct.set(datatype$LAYOUT, datatype$OFFSET, fieldValue);
    }

    private static final OfInt mem_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("mem_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_memory_type_t mem_type
     * }
     */
    public static final OfInt mem_type$layout() {
        return mem_type$LAYOUT;
    }

    private static final long mem_type$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_memory_type_t mem_type
     * }
     */
    public static final long mem_type$offset() {
        return mem_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_memory_type_t mem_type
     * }
     */
    public static int mem_type(MemorySegment struct) {
        return struct.get(mem_type$LAYOUT, mem_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_memory_type_t mem_type
     * }
     */
    public static void mem_type(MemorySegment struct, int fieldValue) {
        struct.set(mem_type$LAYOUT, mem_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

