// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_context_params {
 *     uint64_t mask;
 *     ucc_context_type_t type;
 *     ucc_coll_sync_type_t sync_type;
 *     ucc_context_oob_coll_t oob;
 *     uint64_t ctx_id;
 *     ucc_mem_map_params_t mem_params;
 * }
 * }
 */
public class ucc_context_params {

    ucc_context_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_LONG.withName("mask"),
        Ucc.C_INT.withName("type"),
        Ucc.C_INT.withName("sync_type"),
        ucc_oob_coll.layout().withName("oob"),
        Ucc.C_LONG.withName("ctx_id"),
        ucc_mem_map_params.layout().withName("mem_params")
    ).withName("ucc_context_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final OfLong mask$layout() {
        return mask$LAYOUT;
    }

    private static final long mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final long mask$offset() {
        return mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static long mask(MemorySegment struct) {
        return struct.get(mask$LAYOUT, mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static void mask(MemorySegment struct, long fieldValue) {
        struct.set(mask$LAYOUT, mask$OFFSET, fieldValue);
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfInt sync_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sync_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final OfInt sync_type$layout() {
        return sync_type$LAYOUT;
    }

    private static final long sync_type$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final long sync_type$offset() {
        return sync_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static int sync_type(MemorySegment struct) {
        return struct.get(sync_type$LAYOUT, sync_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static void sync_type(MemorySegment struct, int fieldValue) {
        struct.set(sync_type$LAYOUT, sync_type$OFFSET, fieldValue);
    }

    private static final GroupLayout oob$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("oob"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_context_oob_coll_t oob
     * }
     */
    public static final GroupLayout oob$layout() {
        return oob$LAYOUT;
    }

    private static final long oob$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_context_oob_coll_t oob
     * }
     */
    public static final long oob$offset() {
        return oob$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_context_oob_coll_t oob
     * }
     */
    public static MemorySegment oob(MemorySegment struct) {
        return struct.asSlice(oob$OFFSET, oob$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_context_oob_coll_t oob
     * }
     */
    public static void oob(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, oob$OFFSET, oob$LAYOUT.byteSize());
    }

    private static final OfLong ctx_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ctx_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t ctx_id
     * }
     */
    public static final OfLong ctx_id$layout() {
        return ctx_id$LAYOUT;
    }

    private static final long ctx_id$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t ctx_id
     * }
     */
    public static final long ctx_id$offset() {
        return ctx_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t ctx_id
     * }
     */
    public static long ctx_id(MemorySegment struct) {
        return struct.get(ctx_id$LAYOUT, ctx_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t ctx_id
     * }
     */
    public static void ctx_id(MemorySegment struct, long fieldValue) {
        struct.set(ctx_id$LAYOUT, ctx_id$OFFSET, fieldValue);
    }

    private static final GroupLayout mem_params$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mem_params"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static final GroupLayout mem_params$layout() {
        return mem_params$LAYOUT;
    }

    private static final long mem_params$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static final long mem_params$offset() {
        return mem_params$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static MemorySegment mem_params(MemorySegment struct) {
        return struct.asSlice(mem_params$OFFSET, mem_params$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static void mem_params(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mem_params$OFFSET, mem_params$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

