// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_team_attr {
 *     uint64_t mask;
 *     ucc_post_ordering_t ordering;
 *     uint64_t outstanding_colls;
 *     uint64_t ep;
 *     ucc_ep_range_type_t ep_range;
 *     ucc_coll_sync_type_t sync_type;
 *     ucc_mem_map_params_t mem_params;
 *     uint32_t size;
 *     uint64_t *eps;
 * }
 * }
 */
public class ucc_team_attr {

    ucc_team_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_LONG.withName("mask"),
        Ucc.C_INT.withName("ordering"),
        MemoryLayout.paddingLayout(4),
        Ucc.C_LONG.withName("outstanding_colls"),
        Ucc.C_LONG.withName("ep"),
        Ucc.C_INT.withName("ep_range"),
        Ucc.C_INT.withName("sync_type"),
        ucc_mem_map_params.layout().withName("mem_params"),
        Ucc.C_INT.withName("size"),
        MemoryLayout.paddingLayout(4),
        Ucc.C_POINTER.withName("eps")
    ).withName("ucc_team_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final OfLong mask$layout() {
        return mask$LAYOUT;
    }

    private static final long mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final long mask$offset() {
        return mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static long mask(MemorySegment struct) {
        return struct.get(mask$LAYOUT, mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static void mask(MemorySegment struct, long fieldValue) {
        struct.set(mask$LAYOUT, mask$OFFSET, fieldValue);
    }

    private static final OfInt ordering$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ordering"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_post_ordering_t ordering
     * }
     */
    public static final OfInt ordering$layout() {
        return ordering$LAYOUT;
    }

    private static final long ordering$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_post_ordering_t ordering
     * }
     */
    public static final long ordering$offset() {
        return ordering$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_post_ordering_t ordering
     * }
     */
    public static int ordering(MemorySegment struct) {
        return struct.get(ordering$LAYOUT, ordering$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_post_ordering_t ordering
     * }
     */
    public static void ordering(MemorySegment struct, int fieldValue) {
        struct.set(ordering$LAYOUT, ordering$OFFSET, fieldValue);
    }

    private static final OfLong outstanding_colls$LAYOUT = (OfLong)$LAYOUT.select(groupElement("outstanding_colls"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t outstanding_colls
     * }
     */
    public static final OfLong outstanding_colls$layout() {
        return outstanding_colls$LAYOUT;
    }

    private static final long outstanding_colls$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t outstanding_colls
     * }
     */
    public static final long outstanding_colls$offset() {
        return outstanding_colls$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t outstanding_colls
     * }
     */
    public static long outstanding_colls(MemorySegment struct) {
        return struct.get(outstanding_colls$LAYOUT, outstanding_colls$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t outstanding_colls
     * }
     */
    public static void outstanding_colls(MemorySegment struct, long fieldValue) {
        struct.set(outstanding_colls$LAYOUT, outstanding_colls$OFFSET, fieldValue);
    }

    private static final OfLong ep$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ep"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t ep
     * }
     */
    public static final OfLong ep$layout() {
        return ep$LAYOUT;
    }

    private static final long ep$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t ep
     * }
     */
    public static final long ep$offset() {
        return ep$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t ep
     * }
     */
    public static long ep(MemorySegment struct) {
        return struct.get(ep$LAYOUT, ep$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t ep
     * }
     */
    public static void ep(MemorySegment struct, long fieldValue) {
        struct.set(ep$LAYOUT, ep$OFFSET, fieldValue);
    }

    private static final OfInt ep_range$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ep_range"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_ep_range_type_t ep_range
     * }
     */
    public static final OfInt ep_range$layout() {
        return ep_range$LAYOUT;
    }

    private static final long ep_range$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_ep_range_type_t ep_range
     * }
     */
    public static final long ep_range$offset() {
        return ep_range$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_ep_range_type_t ep_range
     * }
     */
    public static int ep_range(MemorySegment struct) {
        return struct.get(ep_range$LAYOUT, ep_range$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_ep_range_type_t ep_range
     * }
     */
    public static void ep_range(MemorySegment struct, int fieldValue) {
        struct.set(ep_range$LAYOUT, ep_range$OFFSET, fieldValue);
    }

    private static final OfInt sync_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sync_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final OfInt sync_type$layout() {
        return sync_type$LAYOUT;
    }

    private static final long sync_type$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final long sync_type$offset() {
        return sync_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static int sync_type(MemorySegment struct) {
        return struct.get(sync_type$LAYOUT, sync_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static void sync_type(MemorySegment struct, int fieldValue) {
        struct.set(sync_type$LAYOUT, sync_type$OFFSET, fieldValue);
    }

    private static final GroupLayout mem_params$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mem_params"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static final GroupLayout mem_params$layout() {
        return mem_params$LAYOUT;
    }

    private static final long mem_params$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static final long mem_params$offset() {
        return mem_params$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static MemorySegment mem_params(MemorySegment struct) {
        return struct.asSlice(mem_params$OFFSET, mem_params$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_mem_map_params_t mem_params
     * }
     */
    public static void mem_params(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mem_params$OFFSET, mem_params$LAYOUT.byteSize());
    }

    private static final OfInt size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t size
     * }
     */
    public static final OfInt size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t size
     * }
     */
    public static int size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t size
     * }
     */
    public static void size(MemorySegment struct, int fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final AddressLayout eps$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("eps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t *eps
     * }
     */
    public static final AddressLayout eps$layout() {
        return eps$LAYOUT;
    }

    private static final long eps$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t *eps
     * }
     */
    public static final long eps$offset() {
        return eps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t *eps
     * }
     */
    public static MemorySegment eps(MemorySegment struct) {
        return struct.get(eps$LAYOUT, eps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t *eps
     * }
     */
    public static void eps(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(eps$LAYOUT, eps$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

