// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_event {
 *     ucc_event_type_t ev_type;
 *     void *ev_context;
 *     size_t ev_context_size;
 *     ucc_coll_req_h req;
 * }
 * }
 */
public class ucc_event {

    ucc_event() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_INT.withName("ev_type"),
        MemoryLayout.paddingLayout(4),
        Ucc.C_POINTER.withName("ev_context"),
        Ucc.C_LONG.withName("ev_context_size"),
        Ucc.C_POINTER.withName("req")
    ).withName("ucc_event");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt ev_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ev_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_event_type_t ev_type
     * }
     */
    public static final OfInt ev_type$layout() {
        return ev_type$LAYOUT;
    }

    private static final long ev_type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_event_type_t ev_type
     * }
     */
    public static final long ev_type$offset() {
        return ev_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_event_type_t ev_type
     * }
     */
    public static int ev_type(MemorySegment struct) {
        return struct.get(ev_type$LAYOUT, ev_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_event_type_t ev_type
     * }
     */
    public static void ev_type(MemorySegment struct, int fieldValue) {
        struct.set(ev_type$LAYOUT, ev_type$OFFSET, fieldValue);
    }

    private static final AddressLayout ev_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ev_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *ev_context
     * }
     */
    public static final AddressLayout ev_context$layout() {
        return ev_context$LAYOUT;
    }

    private static final long ev_context$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *ev_context
     * }
     */
    public static final long ev_context$offset() {
        return ev_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *ev_context
     * }
     */
    public static MemorySegment ev_context(MemorySegment struct) {
        return struct.get(ev_context$LAYOUT, ev_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *ev_context
     * }
     */
    public static void ev_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ev_context$LAYOUT, ev_context$OFFSET, fieldValue);
    }

    private static final OfLong ev_context_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ev_context_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t ev_context_size
     * }
     */
    public static final OfLong ev_context_size$layout() {
        return ev_context_size$LAYOUT;
    }

    private static final long ev_context_size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t ev_context_size
     * }
     */
    public static final long ev_context_size$offset() {
        return ev_context_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t ev_context_size
     * }
     */
    public static long ev_context_size(MemorySegment struct) {
        return struct.get(ev_context_size$LAYOUT, ev_context_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t ev_context_size
     * }
     */
    public static void ev_context_size(MemorySegment struct, long fieldValue) {
        struct.set(ev_context_size$LAYOUT, ev_context_size$OFFSET, fieldValue);
    }

    private static final AddressLayout req$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("req"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_coll_req_h req
     * }
     */
    public static final AddressLayout req$layout() {
        return req$LAYOUT;
    }

    private static final long req$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_coll_req_h req
     * }
     */
    public static final long req$offset() {
        return req$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_coll_req_h req
     * }
     */
    public static MemorySegment req(MemorySegment struct) {
        return struct.get(req$LAYOUT, req$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_coll_req_h req
     * }
     */
    public static void req(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(req$LAYOUT, req$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

