// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_reduce_cb_params {
 *     uint64_t mask;
 *     void *src1;
 *     void *src2;
 *     void *dst;
 *     size_t n_vectors;
 *     size_t count;
 *     size_t stride;
 *     ucc_dt_generic_t *dt;
 *     void *cb_ctx;
 * }
 * }
 */
public class ucc_reduce_cb_params {

    ucc_reduce_cb_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_LONG.withName("mask"),
        Ucc.C_POINTER.withName("src1"),
        Ucc.C_POINTER.withName("src2"),
        Ucc.C_POINTER.withName("dst"),
        Ucc.C_LONG.withName("n_vectors"),
        Ucc.C_LONG.withName("count"),
        Ucc.C_LONG.withName("stride"),
        Ucc.C_POINTER.withName("dt"),
        Ucc.C_POINTER.withName("cb_ctx")
    ).withName("ucc_reduce_cb_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final OfLong mask$layout() {
        return mask$LAYOUT;
    }

    private static final long mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final long mask$offset() {
        return mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static long mask(MemorySegment struct) {
        return struct.get(mask$LAYOUT, mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static void mask(MemorySegment struct, long fieldValue) {
        struct.set(mask$LAYOUT, mask$OFFSET, fieldValue);
    }

    private static final AddressLayout src1$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("src1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *src1
     * }
     */
    public static final AddressLayout src1$layout() {
        return src1$LAYOUT;
    }

    private static final long src1$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *src1
     * }
     */
    public static final long src1$offset() {
        return src1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *src1
     * }
     */
    public static MemorySegment src1(MemorySegment struct) {
        return struct.get(src1$LAYOUT, src1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *src1
     * }
     */
    public static void src1(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(src1$LAYOUT, src1$OFFSET, fieldValue);
    }

    private static final AddressLayout src2$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("src2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *src2
     * }
     */
    public static final AddressLayout src2$layout() {
        return src2$LAYOUT;
    }

    private static final long src2$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *src2
     * }
     */
    public static final long src2$offset() {
        return src2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *src2
     * }
     */
    public static MemorySegment src2(MemorySegment struct) {
        return struct.get(src2$LAYOUT, src2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *src2
     * }
     */
    public static void src2(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(src2$LAYOUT, src2$OFFSET, fieldValue);
    }

    private static final AddressLayout dst$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("dst"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *dst
     * }
     */
    public static final AddressLayout dst$layout() {
        return dst$LAYOUT;
    }

    private static final long dst$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *dst
     * }
     */
    public static final long dst$offset() {
        return dst$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *dst
     * }
     */
    public static MemorySegment dst(MemorySegment struct) {
        return struct.get(dst$LAYOUT, dst$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *dst
     * }
     */
    public static void dst(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(dst$LAYOUT, dst$OFFSET, fieldValue);
    }

    private static final OfLong n_vectors$LAYOUT = (OfLong)$LAYOUT.select(groupElement("n_vectors"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t n_vectors
     * }
     */
    public static final OfLong n_vectors$layout() {
        return n_vectors$LAYOUT;
    }

    private static final long n_vectors$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t n_vectors
     * }
     */
    public static final long n_vectors$offset() {
        return n_vectors$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t n_vectors
     * }
     */
    public static long n_vectors(MemorySegment struct) {
        return struct.get(n_vectors$LAYOUT, n_vectors$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t n_vectors
     * }
     */
    public static void n_vectors(MemorySegment struct, long fieldValue) {
        struct.set(n_vectors$LAYOUT, n_vectors$OFFSET, fieldValue);
    }

    private static final OfLong count$LAYOUT = (OfLong)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t count
     * }
     */
    public static final OfLong count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t count
     * }
     */
    public static long count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t count
     * }
     */
    public static void count(MemorySegment struct, long fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfLong stride$LAYOUT = (OfLong)$LAYOUT.select(groupElement("stride"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static final OfLong stride$layout() {
        return stride$LAYOUT;
    }

    private static final long stride$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static final long stride$offset() {
        return stride$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static long stride(MemorySegment struct) {
        return struct.get(stride$LAYOUT, stride$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static void stride(MemorySegment struct, long fieldValue) {
        struct.set(stride$LAYOUT, stride$OFFSET, fieldValue);
    }

    private static final AddressLayout dt$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("dt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_dt_generic_t *dt
     * }
     */
    public static final AddressLayout dt$layout() {
        return dt$LAYOUT;
    }

    private static final long dt$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_dt_generic_t *dt
     * }
     */
    public static final long dt$offset() {
        return dt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_dt_generic_t *dt
     * }
     */
    public static MemorySegment dt(MemorySegment struct) {
        return struct.get(dt$LAYOUT, dt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_dt_generic_t *dt
     * }
     */
    public static void dt(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(dt$LAYOUT, dt$OFFSET, fieldValue);
    }

    private static final AddressLayout cb_ctx$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cb_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *cb_ctx
     * }
     */
    public static final AddressLayout cb_ctx$layout() {
        return cb_ctx$LAYOUT;
    }

    private static final long cb_ctx$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *cb_ctx
     * }
     */
    public static final long cb_ctx$offset() {
        return cb_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *cb_ctx
     * }
     */
    public static MemorySegment cb_ctx(MemorySegment struct) {
        return struct.get(cb_ctx$LAYOUT, cb_ctx$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *cb_ctx
     * }
     */
    public static void cb_ctx(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cb_ctx$LAYOUT, cb_ctx$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

