// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_ep_map_t {
 *     ucc_ep_map_type_t type;
 *     uint64_t ep_num;
 *     union {
 *         struct ucc_ep_map_strided strided;
 *         struct ucc_ep_map_array array;
 *         struct ucc_ep_map_cb cb;
 *     };
 * }
 * }
 */
public class ucc_ep_map_t {

    ucc_ep_map_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        Ucc.C_LONG.withName("ep_num"),
        MemoryLayout.unionLayout(
            ucc_ep_map_strided.layout().withName("strided"),
            ucc_ep_map_array.layout().withName("array"),
            ucc_ep_map_cb.layout().withName("cb")
        ).withName("$anon$1352:5")
    ).withName("ucc_ep_map_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_ep_map_type_t type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_ep_map_type_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_ep_map_type_t type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_ep_map_type_t type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfLong ep_num$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ep_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t ep_num
     * }
     */
    public static final OfLong ep_num$layout() {
        return ep_num$LAYOUT;
    }

    private static final long ep_num$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t ep_num
     * }
     */
    public static final long ep_num$offset() {
        return ep_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t ep_num
     * }
     */
    public static long ep_num(MemorySegment struct) {
        return struct.get(ep_num$LAYOUT, ep_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t ep_num
     * }
     */
    public static void ep_num(MemorySegment struct, long fieldValue) {
        struct.set(ep_num$LAYOUT, ep_num$OFFSET, fieldValue);
    }

    private static final GroupLayout strided$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1352:5"), groupElement("strided"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_strided strided
     * }
     */
    public static final GroupLayout strided$layout() {
        return strided$LAYOUT;
    }

    private static final long strided$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_strided strided
     * }
     */
    public static final long strided$offset() {
        return strided$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_strided strided
     * }
     */
    public static MemorySegment strided(MemorySegment struct) {
        return struct.asSlice(strided$OFFSET, strided$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_strided strided
     * }
     */
    public static void strided(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, strided$OFFSET, strided$LAYOUT.byteSize());
    }

    private static final GroupLayout array$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1352:5"), groupElement("array"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_array array
     * }
     */
    public static final GroupLayout array$layout() {
        return array$LAYOUT;
    }

    private static final long array$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_array array
     * }
     */
    public static final long array$offset() {
        return array$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_array array
     * }
     */
    public static MemorySegment array(MemorySegment struct) {
        return struct.asSlice(array$OFFSET, array$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_array array
     * }
     */
    public static void array(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, array$OFFSET, array$LAYOUT.byteSize());
    }

    private static final GroupLayout cb$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1352:5"), groupElement("cb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_cb cb
     * }
     */
    public static final GroupLayout cb$layout() {
        return cb$LAYOUT;
    }

    private static final long cb$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_cb cb
     * }
     */
    public static final long cb$offset() {
        return cb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_cb cb
     * }
     */
    public static MemorySegment cb(MemorySegment struct) {
        return struct.asSlice(cb$OFFSET, cb$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ucc_ep_map_cb cb
     * }
     */
    public static void cb(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cb$OFFSET, cb$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

