// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_context_attr {
 *     uint64_t mask;
 *     ucc_context_type_t type;
 *     ucc_coll_sync_type_t sync_type;
 *     ucc_context_addr_h ctx_addr;
 *     ucc_context_addr_len_t ctx_addr_len;
 *     uint64_t global_work_buffer_size;
 * }
 * }
 */
public class ucc_context_attr {

    ucc_context_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_LONG.withName("mask"),
        Ucc.C_INT.withName("type"),
        Ucc.C_INT.withName("sync_type"),
        Ucc.C_POINTER.withName("ctx_addr"),
        Ucc.C_LONG.withName("ctx_addr_len"),
        Ucc.C_LONG.withName("global_work_buffer_size")
    ).withName("ucc_context_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final OfLong mask$layout() {
        return mask$LAYOUT;
    }

    private static final long mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final long mask$offset() {
        return mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static long mask(MemorySegment struct) {
        return struct.get(mask$LAYOUT, mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static void mask(MemorySegment struct, long fieldValue) {
        struct.set(mask$LAYOUT, mask$OFFSET, fieldValue);
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_context_type_t type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfInt sync_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sync_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final OfInt sync_type$layout() {
        return sync_type$LAYOUT;
    }

    private static final long sync_type$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final long sync_type$offset() {
        return sync_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static int sync_type(MemorySegment struct) {
        return struct.get(sync_type$LAYOUT, sync_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static void sync_type(MemorySegment struct, int fieldValue) {
        struct.set(sync_type$LAYOUT, sync_type$OFFSET, fieldValue);
    }

    private static final AddressLayout ctx_addr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ctx_addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_context_addr_h ctx_addr
     * }
     */
    public static final AddressLayout ctx_addr$layout() {
        return ctx_addr$LAYOUT;
    }

    private static final long ctx_addr$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_context_addr_h ctx_addr
     * }
     */
    public static final long ctx_addr$offset() {
        return ctx_addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_context_addr_h ctx_addr
     * }
     */
    public static MemorySegment ctx_addr(MemorySegment struct) {
        return struct.get(ctx_addr$LAYOUT, ctx_addr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_context_addr_h ctx_addr
     * }
     */
    public static void ctx_addr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ctx_addr$LAYOUT, ctx_addr$OFFSET, fieldValue);
    }

    private static final OfLong ctx_addr_len$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ctx_addr_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_context_addr_len_t ctx_addr_len
     * }
     */
    public static final OfLong ctx_addr_len$layout() {
        return ctx_addr_len$LAYOUT;
    }

    private static final long ctx_addr_len$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_context_addr_len_t ctx_addr_len
     * }
     */
    public static final long ctx_addr_len$offset() {
        return ctx_addr_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_context_addr_len_t ctx_addr_len
     * }
     */
    public static long ctx_addr_len(MemorySegment struct) {
        return struct.get(ctx_addr_len$LAYOUT, ctx_addr_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_context_addr_len_t ctx_addr_len
     * }
     */
    public static void ctx_addr_len(MemorySegment struct, long fieldValue) {
        struct.set(ctx_addr_len$LAYOUT, ctx_addr_len$OFFSET, fieldValue);
    }

    private static final OfLong global_work_buffer_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("global_work_buffer_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t global_work_buffer_size
     * }
     */
    public static final OfLong global_work_buffer_size$layout() {
        return global_work_buffer_size$LAYOUT;
    }

    private static final long global_work_buffer_size$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t global_work_buffer_size
     * }
     */
    public static final long global_work_buffer_size$offset() {
        return global_work_buffer_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t global_work_buffer_size
     * }
     */
    public static long global_work_buffer_size(MemorySegment struct) {
        return struct.get(global_work_buffer_size$LAYOUT, global_work_buffer_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t global_work_buffer_size
     * }
     */
    public static void global_work_buffer_size(MemorySegment struct, long fieldValue) {
        struct.set(global_work_buffer_size$LAYOUT, global_work_buffer_size$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

