// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucc;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucc_lib_params {
 *     uint64_t mask;
 *     ucc_thread_mode_t thread_mode;
 *     uint64_t coll_types;
 *     uint64_t reduction_types;
 *     ucc_coll_sync_type_t sync_type;
 * }
 * }
 */
public class ucc_lib_params {

    ucc_lib_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucc.C_LONG.withName("mask"),
        Ucc.C_INT.withName("thread_mode"),
        MemoryLayout.paddingLayout(4),
        Ucc.C_LONG.withName("coll_types"),
        Ucc.C_LONG.withName("reduction_types"),
        Ucc.C_INT.withName("sync_type"),
        MemoryLayout.paddingLayout(4)
    ).withName("ucc_lib_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final OfLong mask$layout() {
        return mask$LAYOUT;
    }

    private static final long mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static final long mask$offset() {
        return mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static long mask(MemorySegment struct) {
        return struct.get(mask$LAYOUT, mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t mask
     * }
     */
    public static void mask(MemorySegment struct, long fieldValue) {
        struct.set(mask$LAYOUT, mask$OFFSET, fieldValue);
    }

    private static final OfInt thread_mode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("thread_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_thread_mode_t thread_mode
     * }
     */
    public static final OfInt thread_mode$layout() {
        return thread_mode$LAYOUT;
    }

    private static final long thread_mode$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_thread_mode_t thread_mode
     * }
     */
    public static final long thread_mode$offset() {
        return thread_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_thread_mode_t thread_mode
     * }
     */
    public static int thread_mode(MemorySegment struct) {
        return struct.get(thread_mode$LAYOUT, thread_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_thread_mode_t thread_mode
     * }
     */
    public static void thread_mode(MemorySegment struct, int fieldValue) {
        struct.set(thread_mode$LAYOUT, thread_mode$OFFSET, fieldValue);
    }

    private static final OfLong coll_types$LAYOUT = (OfLong)$LAYOUT.select(groupElement("coll_types"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t coll_types
     * }
     */
    public static final OfLong coll_types$layout() {
        return coll_types$LAYOUT;
    }

    private static final long coll_types$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t coll_types
     * }
     */
    public static final long coll_types$offset() {
        return coll_types$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t coll_types
     * }
     */
    public static long coll_types(MemorySegment struct) {
        return struct.get(coll_types$LAYOUT, coll_types$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t coll_types
     * }
     */
    public static void coll_types(MemorySegment struct, long fieldValue) {
        struct.set(coll_types$LAYOUT, coll_types$OFFSET, fieldValue);
    }

    private static final OfLong reduction_types$LAYOUT = (OfLong)$LAYOUT.select(groupElement("reduction_types"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t reduction_types
     * }
     */
    public static final OfLong reduction_types$layout() {
        return reduction_types$LAYOUT;
    }

    private static final long reduction_types$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t reduction_types
     * }
     */
    public static final long reduction_types$offset() {
        return reduction_types$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t reduction_types
     * }
     */
    public static long reduction_types(MemorySegment struct) {
        return struct.get(reduction_types$LAYOUT, reduction_types$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t reduction_types
     * }
     */
    public static void reduction_types(MemorySegment struct, long fieldValue) {
        struct.set(reduction_types$LAYOUT, reduction_types$OFFSET, fieldValue);
    }

    private static final OfInt sync_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sync_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final OfInt sync_type$layout() {
        return sync_type$LAYOUT;
    }

    private static final long sync_type$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static final long sync_type$offset() {
        return sync_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static int sync_type(MemorySegment struct) {
        return struct.get(sync_type$LAYOUT, sync_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucc_coll_sync_type_t sync_type
     * }
     */
    public static void sync_type(MemorySegment struct, int fieldValue) {
        struct.set(sync_type$LAYOUT, sync_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

