// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct group_filter {
 *     uint32_t gf_interface;
 *     struct sockaddr_storage gf_group;
 *     uint32_t gf_fmode;
 *     uint32_t gf_numsrc;
 *     struct sockaddr_storage gf_slist[1];
 * }
 * }
 */
public class group_filter {

    group_filter() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("gf_interface"),
        MemoryLayout.paddingLayout(4),
        sockaddr_storage.layout().withName("gf_group"),
        RdmaCm.C_INT.withName("gf_fmode"),
        RdmaCm.C_INT.withName("gf_numsrc"),
        MemoryLayout.sequenceLayout(1, sockaddr_storage.layout()).withName("gf_slist")
    ).withName("group_filter");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt gf_interface$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gf_interface"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t gf_interface
     * }
     */
    public static final OfInt gf_interface$layout() {
        return gf_interface$LAYOUT;
    }

    private static final long gf_interface$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t gf_interface
     * }
     */
    public static final long gf_interface$offset() {
        return gf_interface$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t gf_interface
     * }
     */
    public static int gf_interface(MemorySegment struct) {
        return struct.get(gf_interface$LAYOUT, gf_interface$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t gf_interface
     * }
     */
    public static void gf_interface(MemorySegment struct, int fieldValue) {
        struct.set(gf_interface$LAYOUT, gf_interface$OFFSET, fieldValue);
    }

    private static final GroupLayout gf_group$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("gf_group"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_group
     * }
     */
    public static final GroupLayout gf_group$layout() {
        return gf_group$LAYOUT;
    }

    private static final long gf_group$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_group
     * }
     */
    public static final long gf_group$offset() {
        return gf_group$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_group
     * }
     */
    public static MemorySegment gf_group(MemorySegment struct) {
        return struct.asSlice(gf_group$OFFSET, gf_group$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_group
     * }
     */
    public static void gf_group(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, gf_group$OFFSET, gf_group$LAYOUT.byteSize());
    }

    private static final OfInt gf_fmode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gf_fmode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t gf_fmode
     * }
     */
    public static final OfInt gf_fmode$layout() {
        return gf_fmode$LAYOUT;
    }

    private static final long gf_fmode$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t gf_fmode
     * }
     */
    public static final long gf_fmode$offset() {
        return gf_fmode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t gf_fmode
     * }
     */
    public static int gf_fmode(MemorySegment struct) {
        return struct.get(gf_fmode$LAYOUT, gf_fmode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t gf_fmode
     * }
     */
    public static void gf_fmode(MemorySegment struct, int fieldValue) {
        struct.set(gf_fmode$LAYOUT, gf_fmode$OFFSET, fieldValue);
    }

    private static final OfInt gf_numsrc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gf_numsrc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t gf_numsrc
     * }
     */
    public static final OfInt gf_numsrc$layout() {
        return gf_numsrc$LAYOUT;
    }

    private static final long gf_numsrc$OFFSET = 140;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t gf_numsrc
     * }
     */
    public static final long gf_numsrc$offset() {
        return gf_numsrc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t gf_numsrc
     * }
     */
    public static int gf_numsrc(MemorySegment struct) {
        return struct.get(gf_numsrc$LAYOUT, gf_numsrc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t gf_numsrc
     * }
     */
    public static void gf_numsrc(MemorySegment struct, int fieldValue) {
        struct.set(gf_numsrc$LAYOUT, gf_numsrc$OFFSET, fieldValue);
    }

    private static final SequenceLayout gf_slist$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("gf_slist"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static final SequenceLayout gf_slist$layout() {
        return gf_slist$LAYOUT;
    }

    private static final long gf_slist$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static final long gf_slist$offset() {
        return gf_slist$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static MemorySegment gf_slist(MemorySegment struct) {
        return struct.asSlice(gf_slist$OFFSET, gf_slist$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static void gf_slist(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, gf_slist$OFFSET, gf_slist$LAYOUT.byteSize());
    }

    private static long[] gf_slist$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static long[] gf_slist$dimensions() {
        return gf_slist$DIMS;
    }
    private static final MethodHandle gf_slist$ELEM_HANDLE = gf_slist$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static MemorySegment gf_slist(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)gf_slist$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage gf_slist[1]
     * }
     */
    public static void gf_slist(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, gf_slist(struct, index0), 0L, sockaddr_storage.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

