// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ex_query_device_resp {
 *     struct ib_uverbs_query_device_resp base;
 *     __u32 comp_mask;
 *     __u32 response_length;
 *     struct ib_uverbs_odp_caps odp_caps;
 *     __u64 timestamp_mask;
 *     __u64 hca_core_clock;
 *     __u64 device_cap_flags_ex;
 *     struct ib_uverbs_rss_caps rss_caps;
 *     __u32 max_wq_type_rq;
 *     __u32 raw_packet_caps;
 *     struct ib_uverbs_tm_caps tm_caps;
 *     struct ib_uverbs_cq_moderation_caps cq_moderation_caps;
 *     __u64 max_dm_size;
 *     __u32 xrc_odp_caps;
 *     __u32 reserved;
 * }
 * }
 */
public class ib_uverbs_ex_query_device_resp {

    ib_uverbs_ex_query_device_resp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ib_uverbs_query_device_resp.layout().withName("base"),
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_INT.withName("response_length"),
        ib_uverbs_odp_caps.layout().withName("odp_caps"),
        RdmaCm.C_LONG_LONG.withName("timestamp_mask"),
        RdmaCm.C_LONG_LONG.withName("hca_core_clock"),
        RdmaCm.C_LONG_LONG.withName("device_cap_flags_ex"),
        ib_uverbs_rss_caps.layout().withName("rss_caps"),
        RdmaCm.C_INT.withName("max_wq_type_rq"),
        RdmaCm.C_INT.withName("raw_packet_caps"),
        ib_uverbs_tm_caps.layout().withName("tm_caps"),
        ib_uverbs_cq_moderation_caps.layout().withName("cq_moderation_caps"),
        RdmaCm.C_LONG_LONG.withName("max_dm_size"),
        RdmaCm.C_INT.withName("xrc_odp_caps"),
        RdmaCm.C_INT.withName("reserved")
    ).withName("ib_uverbs_ex_query_device_resp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout base$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("base"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_query_device_resp base
     * }
     */
    public static final GroupLayout base$layout() {
        return base$LAYOUT;
    }

    private static final long base$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_query_device_resp base
     * }
     */
    public static final long base$offset() {
        return base$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_query_device_resp base
     * }
     */
    public static MemorySegment base(MemorySegment struct) {
        return struct.asSlice(base$OFFSET, base$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_query_device_resp base
     * }
     */
    public static void base(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, base$OFFSET, base$LAYOUT.byteSize());
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt response_length$LAYOUT = (OfInt)$LAYOUT.select(groupElement("response_length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static final OfInt response_length$layout() {
        return response_length$LAYOUT;
    }

    private static final long response_length$OFFSET = 180;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static final long response_length$offset() {
        return response_length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static int response_length(MemorySegment struct) {
        return struct.get(response_length$LAYOUT, response_length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static void response_length(MemorySegment struct, int fieldValue) {
        struct.set(response_length$LAYOUT, response_length$OFFSET, fieldValue);
    }

    private static final GroupLayout odp_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("odp_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_odp_caps odp_caps
     * }
     */
    public static final GroupLayout odp_caps$layout() {
        return odp_caps$LAYOUT;
    }

    private static final long odp_caps$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_odp_caps odp_caps
     * }
     */
    public static final long odp_caps$offset() {
        return odp_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_odp_caps odp_caps
     * }
     */
    public static MemorySegment odp_caps(MemorySegment struct) {
        return struct.asSlice(odp_caps$OFFSET, odp_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_odp_caps odp_caps
     * }
     */
    public static void odp_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, odp_caps$OFFSET, odp_caps$LAYOUT.byteSize());
    }

    private static final OfLong timestamp_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("timestamp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 timestamp_mask
     * }
     */
    public static final OfLong timestamp_mask$layout() {
        return timestamp_mask$LAYOUT;
    }

    private static final long timestamp_mask$OFFSET = 208;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 timestamp_mask
     * }
     */
    public static final long timestamp_mask$offset() {
        return timestamp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 timestamp_mask
     * }
     */
    public static long timestamp_mask(MemorySegment struct) {
        return struct.get(timestamp_mask$LAYOUT, timestamp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 timestamp_mask
     * }
     */
    public static void timestamp_mask(MemorySegment struct, long fieldValue) {
        struct.set(timestamp_mask$LAYOUT, timestamp_mask$OFFSET, fieldValue);
    }

    private static final OfLong hca_core_clock$LAYOUT = (OfLong)$LAYOUT.select(groupElement("hca_core_clock"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 hca_core_clock
     * }
     */
    public static final OfLong hca_core_clock$layout() {
        return hca_core_clock$LAYOUT;
    }

    private static final long hca_core_clock$OFFSET = 216;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 hca_core_clock
     * }
     */
    public static final long hca_core_clock$offset() {
        return hca_core_clock$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 hca_core_clock
     * }
     */
    public static long hca_core_clock(MemorySegment struct) {
        return struct.get(hca_core_clock$LAYOUT, hca_core_clock$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 hca_core_clock
     * }
     */
    public static void hca_core_clock(MemorySegment struct, long fieldValue) {
        struct.set(hca_core_clock$LAYOUT, hca_core_clock$OFFSET, fieldValue);
    }

    private static final OfLong device_cap_flags_ex$LAYOUT = (OfLong)$LAYOUT.select(groupElement("device_cap_flags_ex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 device_cap_flags_ex
     * }
     */
    public static final OfLong device_cap_flags_ex$layout() {
        return device_cap_flags_ex$LAYOUT;
    }

    private static final long device_cap_flags_ex$OFFSET = 224;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 device_cap_flags_ex
     * }
     */
    public static final long device_cap_flags_ex$offset() {
        return device_cap_flags_ex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 device_cap_flags_ex
     * }
     */
    public static long device_cap_flags_ex(MemorySegment struct) {
        return struct.get(device_cap_flags_ex$LAYOUT, device_cap_flags_ex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 device_cap_flags_ex
     * }
     */
    public static void device_cap_flags_ex(MemorySegment struct, long fieldValue) {
        struct.set(device_cap_flags_ex$LAYOUT, device_cap_flags_ex$OFFSET, fieldValue);
    }

    private static final GroupLayout rss_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("rss_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_rss_caps rss_caps
     * }
     */
    public static final GroupLayout rss_caps$layout() {
        return rss_caps$LAYOUT;
    }

    private static final long rss_caps$OFFSET = 232;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_rss_caps rss_caps
     * }
     */
    public static final long rss_caps$offset() {
        return rss_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_rss_caps rss_caps
     * }
     */
    public static MemorySegment rss_caps(MemorySegment struct) {
        return struct.asSlice(rss_caps$OFFSET, rss_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_rss_caps rss_caps
     * }
     */
    public static void rss_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, rss_caps$OFFSET, rss_caps$LAYOUT.byteSize());
    }

    private static final OfInt max_wq_type_rq$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wq_type_rq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_wq_type_rq
     * }
     */
    public static final OfInt max_wq_type_rq$layout() {
        return max_wq_type_rq$LAYOUT;
    }

    private static final long max_wq_type_rq$OFFSET = 248;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_wq_type_rq
     * }
     */
    public static final long max_wq_type_rq$offset() {
        return max_wq_type_rq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_wq_type_rq
     * }
     */
    public static int max_wq_type_rq(MemorySegment struct) {
        return struct.get(max_wq_type_rq$LAYOUT, max_wq_type_rq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_wq_type_rq
     * }
     */
    public static void max_wq_type_rq(MemorySegment struct, int fieldValue) {
        struct.set(max_wq_type_rq$LAYOUT, max_wq_type_rq$OFFSET, fieldValue);
    }

    private static final OfInt raw_packet_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("raw_packet_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 raw_packet_caps
     * }
     */
    public static final OfInt raw_packet_caps$layout() {
        return raw_packet_caps$LAYOUT;
    }

    private static final long raw_packet_caps$OFFSET = 252;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 raw_packet_caps
     * }
     */
    public static final long raw_packet_caps$offset() {
        return raw_packet_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 raw_packet_caps
     * }
     */
    public static int raw_packet_caps(MemorySegment struct) {
        return struct.get(raw_packet_caps$LAYOUT, raw_packet_caps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 raw_packet_caps
     * }
     */
    public static void raw_packet_caps(MemorySegment struct, int fieldValue) {
        struct.set(raw_packet_caps$LAYOUT, raw_packet_caps$OFFSET, fieldValue);
    }

    private static final GroupLayout tm_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("tm_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_tm_caps tm_caps
     * }
     */
    public static final GroupLayout tm_caps$layout() {
        return tm_caps$LAYOUT;
    }

    private static final long tm_caps$OFFSET = 256;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_tm_caps tm_caps
     * }
     */
    public static final long tm_caps$offset() {
        return tm_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_tm_caps tm_caps
     * }
     */
    public static MemorySegment tm_caps(MemorySegment struct) {
        return struct.asSlice(tm_caps$OFFSET, tm_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_tm_caps tm_caps
     * }
     */
    public static void tm_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tm_caps$OFFSET, tm_caps$LAYOUT.byteSize());
    }

    private static final GroupLayout cq_moderation_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cq_moderation_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_cq_moderation_caps cq_moderation_caps
     * }
     */
    public static final GroupLayout cq_moderation_caps$layout() {
        return cq_moderation_caps$LAYOUT;
    }

    private static final long cq_moderation_caps$OFFSET = 280;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_cq_moderation_caps cq_moderation_caps
     * }
     */
    public static final long cq_moderation_caps$offset() {
        return cq_moderation_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_cq_moderation_caps cq_moderation_caps
     * }
     */
    public static MemorySegment cq_moderation_caps(MemorySegment struct) {
        return struct.asSlice(cq_moderation_caps$OFFSET, cq_moderation_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_cq_moderation_caps cq_moderation_caps
     * }
     */
    public static void cq_moderation_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cq_moderation_caps$OFFSET, cq_moderation_caps$LAYOUT.byteSize());
    }

    private static final OfLong max_dm_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("max_dm_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 max_dm_size
     * }
     */
    public static final OfLong max_dm_size$layout() {
        return max_dm_size$LAYOUT;
    }

    private static final long max_dm_size$OFFSET = 288;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 max_dm_size
     * }
     */
    public static final long max_dm_size$offset() {
        return max_dm_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 max_dm_size
     * }
     */
    public static long max_dm_size(MemorySegment struct) {
        return struct.get(max_dm_size$LAYOUT, max_dm_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 max_dm_size
     * }
     */
    public static void max_dm_size(MemorySegment struct, long fieldValue) {
        struct.set(max_dm_size$LAYOUT, max_dm_size$OFFSET, fieldValue);
    }

    private static final OfInt xrc_odp_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("xrc_odp_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 xrc_odp_caps
     * }
     */
    public static final OfInt xrc_odp_caps$layout() {
        return xrc_odp_caps$LAYOUT;
    }

    private static final long xrc_odp_caps$OFFSET = 296;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 xrc_odp_caps
     * }
     */
    public static final long xrc_odp_caps$offset() {
        return xrc_odp_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 xrc_odp_caps
     * }
     */
    public static int xrc_odp_caps(MemorySegment struct) {
        return struct.get(xrc_odp_caps$LAYOUT, xrc_odp_caps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 xrc_odp_caps
     * }
     */
    public static void xrc_odp_caps(MemorySegment struct, int fieldValue) {
        struct.set(xrc_odp_caps$LAYOUT, xrc_odp_caps$OFFSET, fieldValue);
    }

    private static final OfInt reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final OfInt reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 300;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static int reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static void reserved(MemorySegment struct, int fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

