// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_create_qp_resp {
 *     __u32 qp_handle;
 *     __u32 qpn;
 *     __u32 max_send_wr;
 *     __u32 max_recv_wr;
 *     __u32 max_send_sge;
 *     __u32 max_recv_sge;
 *     __u32 max_inline_data;
 *     __u32 reserved;
 *     __u32 driver_data[0];
 * }
 * }
 */
public class ib_uverbs_create_qp_resp {

    ib_uverbs_create_qp_resp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("qp_handle"),
        RdmaCm.C_INT.withName("qpn"),
        RdmaCm.C_INT.withName("max_send_wr"),
        RdmaCm.C_INT.withName("max_recv_wr"),
        RdmaCm.C_INT.withName("max_send_sge"),
        RdmaCm.C_INT.withName("max_recv_sge"),
        RdmaCm.C_INT.withName("max_inline_data"),
        RdmaCm.C_INT.withName("reserved"),
        MemoryLayout.sequenceLayout(0, RdmaCm.C_INT).withName("driver_data")
    ).withName("ib_uverbs_create_qp_resp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt qp_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static final OfInt qp_handle$layout() {
        return qp_handle$LAYOUT;
    }

    private static final long qp_handle$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static final long qp_handle$offset() {
        return qp_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static int qp_handle(MemorySegment struct) {
        return struct.get(qp_handle$LAYOUT, qp_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static void qp_handle(MemorySegment struct, int fieldValue) {
        struct.set(qp_handle$LAYOUT, qp_handle$OFFSET, fieldValue);
    }

    private static final OfInt qpn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qpn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static final OfInt qpn$layout() {
        return qpn$LAYOUT;
    }

    private static final long qpn$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static final long qpn$offset() {
        return qpn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static int qpn(MemorySegment struct) {
        return struct.get(qpn$LAYOUT, qpn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static void qpn(MemorySegment struct, int fieldValue) {
        struct.set(qpn$LAYOUT, qpn$OFFSET, fieldValue);
    }

    private static final OfInt max_send_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final OfInt max_send_wr$layout() {
        return max_send_wr$LAYOUT;
    }

    private static final long max_send_wr$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final long max_send_wr$offset() {
        return max_send_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static int max_send_wr(MemorySegment struct) {
        return struct.get(max_send_wr$LAYOUT, max_send_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static void max_send_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_send_wr$LAYOUT, max_send_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final OfInt max_recv_wr$layout() {
        return max_recv_wr$LAYOUT;
    }

    private static final long max_recv_wr$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final long max_recv_wr$offset() {
        return max_recv_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static int max_recv_wr(MemorySegment struct) {
        return struct.get(max_recv_wr$LAYOUT, max_recv_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static void max_recv_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_wr$LAYOUT, max_recv_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_send_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final OfInt max_send_sge$layout() {
        return max_send_sge$LAYOUT;
    }

    private static final long max_send_sge$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final long max_send_sge$offset() {
        return max_send_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static int max_send_sge(MemorySegment struct) {
        return struct.get(max_send_sge$LAYOUT, max_send_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static void max_send_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_send_sge$LAYOUT, max_send_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final OfInt max_recv_sge$layout() {
        return max_recv_sge$LAYOUT;
    }

    private static final long max_recv_sge$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final long max_recv_sge$offset() {
        return max_recv_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static int max_recv_sge(MemorySegment struct) {
        return struct.get(max_recv_sge$LAYOUT, max_recv_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static void max_recv_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_sge$LAYOUT, max_recv_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_inline_data$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_inline_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final OfInt max_inline_data$layout() {
        return max_inline_data$LAYOUT;
    }

    private static final long max_inline_data$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final long max_inline_data$offset() {
        return max_inline_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static int max_inline_data(MemorySegment struct) {
        return struct.get(max_inline_data$LAYOUT, max_inline_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static void max_inline_data(MemorySegment struct, int fieldValue) {
        struct.set(max_inline_data$LAYOUT, max_inline_data$OFFSET, fieldValue);
    }

    private static final OfInt reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final OfInt reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static int reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static void reserved(MemorySegment struct, int fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    private static final SequenceLayout driver_data$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("driver_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static final SequenceLayout driver_data$layout() {
        return driver_data$LAYOUT;
    }

    private static final long driver_data$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static final long driver_data$offset() {
        return driver_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static MemorySegment driver_data(MemorySegment struct) {
        return struct.asSlice(driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    private static long[] driver_data$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static long[] driver_data$dimensions() {
        return driver_data$DIMS;
    }
    private static final VarHandle driver_data$ELEM_HANDLE = driver_data$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static int driver_data(MemorySegment struct, long index0) {
        return (int)driver_data$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u32 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, long index0, int fieldValue) {
        driver_data$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

