// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_flow_attr {
 *     __u32 type;
 *     __u16 size;
 *     __u16 priority;
 *     __u8 num_of_specs;
 *     __u8 reserved[2];
 *     __u8 port;
 *     __u32 flags;
 *     struct ib_uverbs_flow_spec_hdr flow_specs[0];
 * }
 * }
 */
public class ib_uverbs_flow_attr {

    ib_uverbs_flow_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("type"),
        RdmaCm.C_SHORT.withName("size"),
        RdmaCm.C_SHORT.withName("priority"),
        RdmaCm.C_CHAR.withName("num_of_specs"),
        MemoryLayout.sequenceLayout(2, RdmaCm.C_CHAR).withName("reserved"),
        RdmaCm.C_CHAR.withName("port"),
        RdmaCm.C_INT.withName("flags"),
        MemoryLayout.sequenceLayout(0, ib_uverbs_flow_spec_hdr.layout()).withName("flow_specs")
    ).withName("ib_uverbs_flow_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfShort size$LAYOUT = (OfShort)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static final OfShort size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static short size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static void size(MemorySegment struct, short fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final OfShort priority$LAYOUT = (OfShort)$LAYOUT.select(groupElement("priority"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 priority
     * }
     */
    public static final OfShort priority$layout() {
        return priority$LAYOUT;
    }

    private static final long priority$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 priority
     * }
     */
    public static final long priority$offset() {
        return priority$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 priority
     * }
     */
    public static short priority(MemorySegment struct) {
        return struct.get(priority$LAYOUT, priority$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 priority
     * }
     */
    public static void priority(MemorySegment struct, short fieldValue) {
        struct.set(priority$LAYOUT, priority$OFFSET, fieldValue);
    }

    private static final OfByte num_of_specs$LAYOUT = (OfByte)$LAYOUT.select(groupElement("num_of_specs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 num_of_specs
     * }
     */
    public static final OfByte num_of_specs$layout() {
        return num_of_specs$LAYOUT;
    }

    private static final long num_of_specs$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 num_of_specs
     * }
     */
    public static final long num_of_specs$offset() {
        return num_of_specs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 num_of_specs
     * }
     */
    public static byte num_of_specs(MemorySegment struct) {
        return struct.get(num_of_specs$LAYOUT, num_of_specs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 num_of_specs
     * }
     */
    public static void num_of_specs(MemorySegment struct, byte fieldValue) {
        struct.set(num_of_specs$LAYOUT, num_of_specs$OFFSET, fieldValue);
    }

    private static final SequenceLayout reserved$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static final SequenceLayout reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 9;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static MemorySegment reserved(MemorySegment struct) {
        return struct.asSlice(reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static void reserved(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    private static long[] reserved$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static long[] reserved$dimensions() {
        return reserved$DIMS;
    }
    private static final VarHandle reserved$ELEM_HANDLE = reserved$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static byte reserved(MemorySegment struct, long index0) {
        return (byte)reserved$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u8 reserved[2]
     * }
     */
    public static void reserved(MemorySegment struct, long index0, byte fieldValue) {
        reserved$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfByte port$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 port
     * }
     */
    public static final OfByte port$layout() {
        return port$LAYOUT;
    }

    private static final long port$OFFSET = 11;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 port
     * }
     */
    public static final long port$offset() {
        return port$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 port
     * }
     */
    public static byte port(MemorySegment struct) {
        return struct.get(port$LAYOUT, port$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 port
     * }
     */
    public static void port(MemorySegment struct, byte fieldValue) {
        struct.set(port$LAYOUT, port$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final SequenceLayout flow_specs$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("flow_specs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static final SequenceLayout flow_specs$layout() {
        return flow_specs$LAYOUT;
    }

    private static final long flow_specs$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static final long flow_specs$offset() {
        return flow_specs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static MemorySegment flow_specs(MemorySegment struct) {
        return struct.asSlice(flow_specs$OFFSET, flow_specs$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static void flow_specs(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, flow_specs$OFFSET, flow_specs$LAYOUT.byteSize());
    }

    private static long[] flow_specs$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static long[] flow_specs$dimensions() {
        return flow_specs$DIMS;
    }
    private static final MethodHandle flow_specs$ELEM_HANDLE = flow_specs$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static MemorySegment flow_specs(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)flow_specs$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr flow_specs[0]
     * }
     */
    public static void flow_specs(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, flow_specs(struct, index0), 0L, ib_uverbs_flow_spec_hdr.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

