// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ex_create_qp {
 *     __u64 user_handle;
 *     __u32 pd_handle;
 *     __u32 send_cq_handle;
 *     __u32 recv_cq_handle;
 *     __u32 srq_handle;
 *     __u32 max_send_wr;
 *     __u32 max_recv_wr;
 *     __u32 max_send_sge;
 *     __u32 max_recv_sge;
 *     __u32 max_inline_data;
 *     __u8 sq_sig_all;
 *     __u8 qp_type;
 *     __u8 is_srq;
 *     __u8 reserved;
 *     __u32 comp_mask;
 *     __u32 create_flags;
 *     __u32 rwq_ind_tbl_handle;
 *     __u32 source_qpn;
 * }
 * }
 */
public class ib_uverbs_ex_create_qp {

    ib_uverbs_ex_create_qp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_LONG_LONG.withName("user_handle"),
        RdmaCm.C_INT.withName("pd_handle"),
        RdmaCm.C_INT.withName("send_cq_handle"),
        RdmaCm.C_INT.withName("recv_cq_handle"),
        RdmaCm.C_INT.withName("srq_handle"),
        RdmaCm.C_INT.withName("max_send_wr"),
        RdmaCm.C_INT.withName("max_recv_wr"),
        RdmaCm.C_INT.withName("max_send_sge"),
        RdmaCm.C_INT.withName("max_recv_sge"),
        RdmaCm.C_INT.withName("max_inline_data"),
        RdmaCm.C_CHAR.withName("sq_sig_all"),
        RdmaCm.C_CHAR.withName("qp_type"),
        RdmaCm.C_CHAR.withName("is_srq"),
        RdmaCm.C_CHAR.withName("reserved"),
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_INT.withName("create_flags"),
        RdmaCm.C_INT.withName("rwq_ind_tbl_handle"),
        RdmaCm.C_INT.withName("source_qpn")
    ).withName("ib_uverbs_ex_create_qp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong user_handle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("user_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final OfLong user_handle$layout() {
        return user_handle$LAYOUT;
    }

    private static final long user_handle$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final long user_handle$offset() {
        return user_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static long user_handle(MemorySegment struct) {
        return struct.get(user_handle$LAYOUT, user_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static void user_handle(MemorySegment struct, long fieldValue) {
        struct.set(user_handle$LAYOUT, user_handle$OFFSET, fieldValue);
    }

    private static final OfInt pd_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pd_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final OfInt pd_handle$layout() {
        return pd_handle$LAYOUT;
    }

    private static final long pd_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final long pd_handle$offset() {
        return pd_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static int pd_handle(MemorySegment struct) {
        return struct.get(pd_handle$LAYOUT, pd_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static void pd_handle(MemorySegment struct, int fieldValue) {
        struct.set(pd_handle$LAYOUT, pd_handle$OFFSET, fieldValue);
    }

    private static final OfInt send_cq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("send_cq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 send_cq_handle
     * }
     */
    public static final OfInt send_cq_handle$layout() {
        return send_cq_handle$LAYOUT;
    }

    private static final long send_cq_handle$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 send_cq_handle
     * }
     */
    public static final long send_cq_handle$offset() {
        return send_cq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 send_cq_handle
     * }
     */
    public static int send_cq_handle(MemorySegment struct) {
        return struct.get(send_cq_handle$LAYOUT, send_cq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 send_cq_handle
     * }
     */
    public static void send_cq_handle(MemorySegment struct, int fieldValue) {
        struct.set(send_cq_handle$LAYOUT, send_cq_handle$OFFSET, fieldValue);
    }

    private static final OfInt recv_cq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("recv_cq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 recv_cq_handle
     * }
     */
    public static final OfInt recv_cq_handle$layout() {
        return recv_cq_handle$LAYOUT;
    }

    private static final long recv_cq_handle$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 recv_cq_handle
     * }
     */
    public static final long recv_cq_handle$offset() {
        return recv_cq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 recv_cq_handle
     * }
     */
    public static int recv_cq_handle(MemorySegment struct) {
        return struct.get(recv_cq_handle$LAYOUT, recv_cq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 recv_cq_handle
     * }
     */
    public static void recv_cq_handle(MemorySegment struct, int fieldValue) {
        struct.set(recv_cq_handle$LAYOUT, recv_cq_handle$OFFSET, fieldValue);
    }

    private static final OfInt srq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static final OfInt srq_handle$layout() {
        return srq_handle$LAYOUT;
    }

    private static final long srq_handle$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static final long srq_handle$offset() {
        return srq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static int srq_handle(MemorySegment struct) {
        return struct.get(srq_handle$LAYOUT, srq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static void srq_handle(MemorySegment struct, int fieldValue) {
        struct.set(srq_handle$LAYOUT, srq_handle$OFFSET, fieldValue);
    }

    private static final OfInt max_send_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final OfInt max_send_wr$layout() {
        return max_send_wr$LAYOUT;
    }

    private static final long max_send_wr$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final long max_send_wr$offset() {
        return max_send_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static int max_send_wr(MemorySegment struct) {
        return struct.get(max_send_wr$LAYOUT, max_send_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static void max_send_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_send_wr$LAYOUT, max_send_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final OfInt max_recv_wr$layout() {
        return max_recv_wr$LAYOUT;
    }

    private static final long max_recv_wr$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final long max_recv_wr$offset() {
        return max_recv_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static int max_recv_wr(MemorySegment struct) {
        return struct.get(max_recv_wr$LAYOUT, max_recv_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static void max_recv_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_wr$LAYOUT, max_recv_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_send_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final OfInt max_send_sge$layout() {
        return max_send_sge$LAYOUT;
    }

    private static final long max_send_sge$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final long max_send_sge$offset() {
        return max_send_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static int max_send_sge(MemorySegment struct) {
        return struct.get(max_send_sge$LAYOUT, max_send_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static void max_send_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_send_sge$LAYOUT, max_send_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final OfInt max_recv_sge$layout() {
        return max_recv_sge$LAYOUT;
    }

    private static final long max_recv_sge$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final long max_recv_sge$offset() {
        return max_recv_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static int max_recv_sge(MemorySegment struct) {
        return struct.get(max_recv_sge$LAYOUT, max_recv_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static void max_recv_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_sge$LAYOUT, max_recv_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_inline_data$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_inline_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final OfInt max_inline_data$layout() {
        return max_inline_data$LAYOUT;
    }

    private static final long max_inline_data$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final long max_inline_data$offset() {
        return max_inline_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static int max_inline_data(MemorySegment struct) {
        return struct.get(max_inline_data$LAYOUT, max_inline_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static void max_inline_data(MemorySegment struct, int fieldValue) {
        struct.set(max_inline_data$LAYOUT, max_inline_data$OFFSET, fieldValue);
    }

    private static final OfByte sq_sig_all$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sq_sig_all"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 sq_sig_all
     * }
     */
    public static final OfByte sq_sig_all$layout() {
        return sq_sig_all$LAYOUT;
    }

    private static final long sq_sig_all$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 sq_sig_all
     * }
     */
    public static final long sq_sig_all$offset() {
        return sq_sig_all$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 sq_sig_all
     * }
     */
    public static byte sq_sig_all(MemorySegment struct) {
        return struct.get(sq_sig_all$LAYOUT, sq_sig_all$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 sq_sig_all
     * }
     */
    public static void sq_sig_all(MemorySegment struct, byte fieldValue) {
        struct.set(sq_sig_all$LAYOUT, sq_sig_all$OFFSET, fieldValue);
    }

    private static final OfByte qp_type$LAYOUT = (OfByte)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static final OfByte qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 45;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static byte qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, byte fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    private static final OfByte is_srq$LAYOUT = (OfByte)$LAYOUT.select(groupElement("is_srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 is_srq
     * }
     */
    public static final OfByte is_srq$layout() {
        return is_srq$LAYOUT;
    }

    private static final long is_srq$OFFSET = 46;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 is_srq
     * }
     */
    public static final long is_srq$offset() {
        return is_srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 is_srq
     * }
     */
    public static byte is_srq(MemorySegment struct) {
        return struct.get(is_srq$LAYOUT, is_srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 is_srq
     * }
     */
    public static void is_srq(MemorySegment struct, byte fieldValue) {
        struct.set(is_srq$LAYOUT, is_srq$OFFSET, fieldValue);
    }

    private static final OfByte reserved$LAYOUT = (OfByte)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static final OfByte reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 47;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static byte reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static void reserved(MemorySegment struct, byte fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt create_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("create_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static final OfInt create_flags$layout() {
        return create_flags$LAYOUT;
    }

    private static final long create_flags$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static final long create_flags$offset() {
        return create_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static int create_flags(MemorySegment struct) {
        return struct.get(create_flags$LAYOUT, create_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static void create_flags(MemorySegment struct, int fieldValue) {
        struct.set(create_flags$LAYOUT, create_flags$OFFSET, fieldValue);
    }

    private static final OfInt rwq_ind_tbl_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rwq_ind_tbl_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 rwq_ind_tbl_handle
     * }
     */
    public static final OfInt rwq_ind_tbl_handle$layout() {
        return rwq_ind_tbl_handle$LAYOUT;
    }

    private static final long rwq_ind_tbl_handle$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 rwq_ind_tbl_handle
     * }
     */
    public static final long rwq_ind_tbl_handle$offset() {
        return rwq_ind_tbl_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 rwq_ind_tbl_handle
     * }
     */
    public static int rwq_ind_tbl_handle(MemorySegment struct) {
        return struct.get(rwq_ind_tbl_handle$LAYOUT, rwq_ind_tbl_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 rwq_ind_tbl_handle
     * }
     */
    public static void rwq_ind_tbl_handle(MemorySegment struct, int fieldValue) {
        struct.set(rwq_ind_tbl_handle$LAYOUT, rwq_ind_tbl_handle$OFFSET, fieldValue);
    }

    private static final OfInt source_qpn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("source_qpn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 source_qpn
     * }
     */
    public static final OfInt source_qpn$layout() {
        return source_qpn$LAYOUT;
    }

    private static final long source_qpn$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 source_qpn
     * }
     */
    public static final long source_qpn$offset() {
        return source_qpn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 source_qpn
     * }
     */
    public static int source_qpn(MemorySegment struct) {
        return struct.get(source_qpn$LAYOUT, source_qpn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 source_qpn
     * }
     */
    public static void source_qpn(MemorySegment struct, int fieldValue) {
        struct.set(source_qpn$LAYOUT, source_qpn$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

