// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_flow_action_esp_keymat_aes_gcm {
 *     __u64 iv;
 *     __u32 iv_algo;
 *     __u32 salt;
 *     __u32 icv_len;
 *     __u32 key_len;
 *     __u32 aes_key[8];
 * }
 * }
 */
public class ib_uverbs_flow_action_esp_keymat_aes_gcm {

    ib_uverbs_flow_action_esp_keymat_aes_gcm() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_LONG_LONG.withName("iv"),
        RdmaCm.C_INT.withName("iv_algo"),
        RdmaCm.C_INT.withName("salt"),
        RdmaCm.C_INT.withName("icv_len"),
        RdmaCm.C_INT.withName("key_len"),
        MemoryLayout.sequenceLayout(8, RdmaCm.C_INT).withName("aes_key")
    ).withName("ib_uverbs_flow_action_esp_keymat_aes_gcm");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong iv$LAYOUT = (OfLong)$LAYOUT.select(groupElement("iv"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 iv
     * }
     */
    public static final OfLong iv$layout() {
        return iv$LAYOUT;
    }

    private static final long iv$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 iv
     * }
     */
    public static final long iv$offset() {
        return iv$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 iv
     * }
     */
    public static long iv(MemorySegment struct) {
        return struct.get(iv$LAYOUT, iv$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 iv
     * }
     */
    public static void iv(MemorySegment struct, long fieldValue) {
        struct.set(iv$LAYOUT, iv$OFFSET, fieldValue);
    }

    private static final OfInt iv_algo$LAYOUT = (OfInt)$LAYOUT.select(groupElement("iv_algo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 iv_algo
     * }
     */
    public static final OfInt iv_algo$layout() {
        return iv_algo$LAYOUT;
    }

    private static final long iv_algo$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 iv_algo
     * }
     */
    public static final long iv_algo$offset() {
        return iv_algo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 iv_algo
     * }
     */
    public static int iv_algo(MemorySegment struct) {
        return struct.get(iv_algo$LAYOUT, iv_algo$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 iv_algo
     * }
     */
    public static void iv_algo(MemorySegment struct, int fieldValue) {
        struct.set(iv_algo$LAYOUT, iv_algo$OFFSET, fieldValue);
    }

    private static final OfInt salt$LAYOUT = (OfInt)$LAYOUT.select(groupElement("salt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 salt
     * }
     */
    public static final OfInt salt$layout() {
        return salt$LAYOUT;
    }

    private static final long salt$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 salt
     * }
     */
    public static final long salt$offset() {
        return salt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 salt
     * }
     */
    public static int salt(MemorySegment struct) {
        return struct.get(salt$LAYOUT, salt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 salt
     * }
     */
    public static void salt(MemorySegment struct, int fieldValue) {
        struct.set(salt$LAYOUT, salt$OFFSET, fieldValue);
    }

    private static final OfInt icv_len$LAYOUT = (OfInt)$LAYOUT.select(groupElement("icv_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 icv_len
     * }
     */
    public static final OfInt icv_len$layout() {
        return icv_len$LAYOUT;
    }

    private static final long icv_len$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 icv_len
     * }
     */
    public static final long icv_len$offset() {
        return icv_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 icv_len
     * }
     */
    public static int icv_len(MemorySegment struct) {
        return struct.get(icv_len$LAYOUT, icv_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 icv_len
     * }
     */
    public static void icv_len(MemorySegment struct, int fieldValue) {
        struct.set(icv_len$LAYOUT, icv_len$OFFSET, fieldValue);
    }

    private static final OfInt key_len$LAYOUT = (OfInt)$LAYOUT.select(groupElement("key_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 key_len
     * }
     */
    public static final OfInt key_len$layout() {
        return key_len$LAYOUT;
    }

    private static final long key_len$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 key_len
     * }
     */
    public static final long key_len$offset() {
        return key_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 key_len
     * }
     */
    public static int key_len(MemorySegment struct) {
        return struct.get(key_len$LAYOUT, key_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 key_len
     * }
     */
    public static void key_len(MemorySegment struct, int fieldValue) {
        struct.set(key_len$LAYOUT, key_len$OFFSET, fieldValue);
    }

    private static final SequenceLayout aes_key$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("aes_key"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static final SequenceLayout aes_key$layout() {
        return aes_key$LAYOUT;
    }

    private static final long aes_key$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static final long aes_key$offset() {
        return aes_key$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static MemorySegment aes_key(MemorySegment struct) {
        return struct.asSlice(aes_key$OFFSET, aes_key$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static void aes_key(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, aes_key$OFFSET, aes_key$LAYOUT.byteSize());
    }

    private static long[] aes_key$DIMS = { 8 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static long[] aes_key$dimensions() {
        return aes_key$DIMS;
    }
    private static final VarHandle aes_key$ELEM_HANDLE = aes_key$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static int aes_key(MemorySegment struct, long index0) {
        return (int)aes_key$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u32 aes_key[8]
     * }
     */
    public static void aes_key(MemorySegment struct, long index0, int fieldValue) {
        aes_key$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

