// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_flow_action_esp {
 *     __u32 spi;
 *     __u32 seq;
 *     __u32 tfc_pad;
 *     __u32 flags;
 *     __u64 hard_limit_pkts;
 * }
 * }
 */
public class ib_uverbs_flow_action_esp {

    ib_uverbs_flow_action_esp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("spi"),
        RdmaCm.C_INT.withName("seq"),
        RdmaCm.C_INT.withName("tfc_pad"),
        RdmaCm.C_INT.withName("flags"),
        RdmaCm.C_LONG_LONG.withName("hard_limit_pkts")
    ).withName("ib_uverbs_flow_action_esp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt spi$LAYOUT = (OfInt)$LAYOUT.select(groupElement("spi"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 spi
     * }
     */
    public static final OfInt spi$layout() {
        return spi$LAYOUT;
    }

    private static final long spi$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 spi
     * }
     */
    public static final long spi$offset() {
        return spi$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 spi
     * }
     */
    public static int spi(MemorySegment struct) {
        return struct.get(spi$LAYOUT, spi$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 spi
     * }
     */
    public static void spi(MemorySegment struct, int fieldValue) {
        struct.set(spi$LAYOUT, spi$OFFSET, fieldValue);
    }

    private static final OfInt seq$LAYOUT = (OfInt)$LAYOUT.select(groupElement("seq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 seq
     * }
     */
    public static final OfInt seq$layout() {
        return seq$LAYOUT;
    }

    private static final long seq$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 seq
     * }
     */
    public static final long seq$offset() {
        return seq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 seq
     * }
     */
    public static int seq(MemorySegment struct) {
        return struct.get(seq$LAYOUT, seq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 seq
     * }
     */
    public static void seq(MemorySegment struct, int fieldValue) {
        struct.set(seq$LAYOUT, seq$OFFSET, fieldValue);
    }

    private static final OfInt tfc_pad$LAYOUT = (OfInt)$LAYOUT.select(groupElement("tfc_pad"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 tfc_pad
     * }
     */
    public static final OfInt tfc_pad$layout() {
        return tfc_pad$LAYOUT;
    }

    private static final long tfc_pad$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 tfc_pad
     * }
     */
    public static final long tfc_pad$offset() {
        return tfc_pad$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 tfc_pad
     * }
     */
    public static int tfc_pad(MemorySegment struct) {
        return struct.get(tfc_pad$LAYOUT, tfc_pad$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 tfc_pad
     * }
     */
    public static void tfc_pad(MemorySegment struct, int fieldValue) {
        struct.set(tfc_pad$LAYOUT, tfc_pad$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfLong hard_limit_pkts$LAYOUT = (OfLong)$LAYOUT.select(groupElement("hard_limit_pkts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 hard_limit_pkts
     * }
     */
    public static final OfLong hard_limit_pkts$layout() {
        return hard_limit_pkts$LAYOUT;
    }

    private static final long hard_limit_pkts$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 hard_limit_pkts
     * }
     */
    public static final long hard_limit_pkts$offset() {
        return hard_limit_pkts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 hard_limit_pkts
     * }
     */
    public static long hard_limit_pkts(MemorySegment struct) {
        return struct.get(hard_limit_pkts$LAYOUT, hard_limit_pkts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 hard_limit_pkts
     * }
     */
    public static void hard_limit_pkts(MemorySegment struct, long fieldValue) {
        struct.set(hard_limit_pkts$LAYOUT, hard_limit_pkts$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

