// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_gid_entry {
 *     __u64 gid[2];
 *     __u32 gid_index;
 *     __u32 port_num;
 *     __u32 gid_type;
 *     __u32 netdev_ifindex;
 * }
 * }
 */
public class ib_uverbs_gid_entry {

    ib_uverbs_gid_entry() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(2, RdmaCm.C_LONG_LONG).withName("gid"),
        RdmaCm.C_INT.withName("gid_index"),
        RdmaCm.C_INT.withName("port_num"),
        RdmaCm.C_INT.withName("gid_type"),
        RdmaCm.C_INT.withName("netdev_ifindex")
    ).withName("ib_uverbs_gid_entry");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout gid$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("gid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static final SequenceLayout gid$layout() {
        return gid$LAYOUT;
    }

    private static final long gid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static final long gid$offset() {
        return gid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static MemorySegment gid(MemorySegment struct) {
        return struct.asSlice(gid$OFFSET, gid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static void gid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, gid$OFFSET, gid$LAYOUT.byteSize());
    }

    private static long[] gid$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static long[] gid$dimensions() {
        return gid$DIMS;
    }
    private static final VarHandle gid$ELEM_HANDLE = gid$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static long gid(MemorySegment struct, long index0) {
        return (long)gid$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u64 gid[2]
     * }
     */
    public static void gid(MemorySegment struct, long index0, long fieldValue) {
        gid$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt gid_index$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gid_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 gid_index
     * }
     */
    public static final OfInt gid_index$layout() {
        return gid_index$LAYOUT;
    }

    private static final long gid_index$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 gid_index
     * }
     */
    public static final long gid_index$offset() {
        return gid_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 gid_index
     * }
     */
    public static int gid_index(MemorySegment struct) {
        return struct.get(gid_index$LAYOUT, gid_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 gid_index
     * }
     */
    public static void gid_index(MemorySegment struct, int fieldValue) {
        struct.set(gid_index$LAYOUT, gid_index$OFFSET, fieldValue);
    }

    private static final OfInt port_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 port_num
     * }
     */
    public static final OfInt port_num$layout() {
        return port_num$LAYOUT;
    }

    private static final long port_num$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 port_num
     * }
     */
    public static final long port_num$offset() {
        return port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 port_num
     * }
     */
    public static int port_num(MemorySegment struct) {
        return struct.get(port_num$LAYOUT, port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 port_num
     * }
     */
    public static void port_num(MemorySegment struct, int fieldValue) {
        struct.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
    }

    private static final OfInt gid_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gid_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 gid_type
     * }
     */
    public static final OfInt gid_type$layout() {
        return gid_type$LAYOUT;
    }

    private static final long gid_type$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 gid_type
     * }
     */
    public static final long gid_type$offset() {
        return gid_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 gid_type
     * }
     */
    public static int gid_type(MemorySegment struct) {
        return struct.get(gid_type$LAYOUT, gid_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 gid_type
     * }
     */
    public static void gid_type(MemorySegment struct, int fieldValue) {
        struct.set(gid_type$LAYOUT, gid_type$OFFSET, fieldValue);
    }

    private static final OfInt netdev_ifindex$LAYOUT = (OfInt)$LAYOUT.select(groupElement("netdev_ifindex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 netdev_ifindex
     * }
     */
    public static final OfInt netdev_ifindex$layout() {
        return netdev_ifindex$LAYOUT;
    }

    private static final long netdev_ifindex$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 netdev_ifindex
     * }
     */
    public static final long netdev_ifindex$offset() {
        return netdev_ifindex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 netdev_ifindex
     * }
     */
    public static int netdev_ifindex(MemorySegment struct) {
        return struct.get(netdev_ifindex$LAYOUT, netdev_ifindex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 netdev_ifindex
     * }
     */
    public static void netdev_ifindex(MemorySegment struct, int fieldValue) {
        struct.set(netdev_ifindex$LAYOUT, netdev_ifindex$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

