// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_create_xsrq {
 *     __u64 response;
 *     __u64 user_handle;
 *     __u32 srq_type;
 *     __u32 pd_handle;
 *     __u32 max_wr;
 *     __u32 max_sge;
 *     __u32 srq_limit;
 *     __u32 max_num_tags;
 *     __u32 xrcd_handle;
 *     __u32 cq_handle;
 *     __u64 driver_data[0];
 * }
 * }
 */
public class ib_uverbs_create_xsrq {

    ib_uverbs_create_xsrq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_LONG_LONG.withName("response"),
        RdmaCm.C_LONG_LONG.withName("user_handle"),
        RdmaCm.C_INT.withName("srq_type"),
        RdmaCm.C_INT.withName("pd_handle"),
        RdmaCm.C_INT.withName("max_wr"),
        RdmaCm.C_INT.withName("max_sge"),
        RdmaCm.C_INT.withName("srq_limit"),
        RdmaCm.C_INT.withName("max_num_tags"),
        RdmaCm.C_INT.withName("xrcd_handle"),
        RdmaCm.C_INT.withName("cq_handle"),
        MemoryLayout.sequenceLayout(0, RdmaCm.C_LONG_LONG).withName("driver_data")
    ).withName("ib_uverbs_create_xsrq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong response$LAYOUT = (OfLong)$LAYOUT.select(groupElement("response"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final OfLong response$layout() {
        return response$LAYOUT;
    }

    private static final long response$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final long response$offset() {
        return response$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static long response(MemorySegment struct) {
        return struct.get(response$LAYOUT, response$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static void response(MemorySegment struct, long fieldValue) {
        struct.set(response$LAYOUT, response$OFFSET, fieldValue);
    }

    private static final OfLong user_handle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("user_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final OfLong user_handle$layout() {
        return user_handle$LAYOUT;
    }

    private static final long user_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final long user_handle$offset() {
        return user_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static long user_handle(MemorySegment struct) {
        return struct.get(user_handle$LAYOUT, user_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static void user_handle(MemorySegment struct, long fieldValue) {
        struct.set(user_handle$LAYOUT, user_handle$OFFSET, fieldValue);
    }

    private static final OfInt srq_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 srq_type
     * }
     */
    public static final OfInt srq_type$layout() {
        return srq_type$LAYOUT;
    }

    private static final long srq_type$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 srq_type
     * }
     */
    public static final long srq_type$offset() {
        return srq_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 srq_type
     * }
     */
    public static int srq_type(MemorySegment struct) {
        return struct.get(srq_type$LAYOUT, srq_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 srq_type
     * }
     */
    public static void srq_type(MemorySegment struct, int fieldValue) {
        struct.set(srq_type$LAYOUT, srq_type$OFFSET, fieldValue);
    }

    private static final OfInt pd_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pd_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final OfInt pd_handle$layout() {
        return pd_handle$LAYOUT;
    }

    private static final long pd_handle$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final long pd_handle$offset() {
        return pd_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static int pd_handle(MemorySegment struct) {
        return struct.get(pd_handle$LAYOUT, pd_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static void pd_handle(MemorySegment struct, int fieldValue) {
        struct.set(pd_handle$LAYOUT, pd_handle$OFFSET, fieldValue);
    }

    private static final OfInt max_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final OfInt max_wr$layout() {
        return max_wr$LAYOUT;
    }

    private static final long max_wr$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final long max_wr$offset() {
        return max_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static int max_wr(MemorySegment struct) {
        return struct.get(max_wr$LAYOUT, max_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static void max_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_wr$LAYOUT, max_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static final OfInt max_sge$layout() {
        return max_sge$LAYOUT;
    }

    private static final long max_sge$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static final long max_sge$offset() {
        return max_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static int max_sge(MemorySegment struct) {
        return struct.get(max_sge$LAYOUT, max_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static void max_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_sge$LAYOUT, max_sge$OFFSET, fieldValue);
    }

    private static final OfInt srq_limit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static final OfInt srq_limit$layout() {
        return srq_limit$LAYOUT;
    }

    private static final long srq_limit$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static final long srq_limit$offset() {
        return srq_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static int srq_limit(MemorySegment struct) {
        return struct.get(srq_limit$LAYOUT, srq_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static void srq_limit(MemorySegment struct, int fieldValue) {
        struct.set(srq_limit$LAYOUT, srq_limit$OFFSET, fieldValue);
    }

    private static final OfInt max_num_tags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_num_tags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_num_tags
     * }
     */
    public static final OfInt max_num_tags$layout() {
        return max_num_tags$LAYOUT;
    }

    private static final long max_num_tags$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_num_tags
     * }
     */
    public static final long max_num_tags$offset() {
        return max_num_tags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_num_tags
     * }
     */
    public static int max_num_tags(MemorySegment struct) {
        return struct.get(max_num_tags$LAYOUT, max_num_tags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_num_tags
     * }
     */
    public static void max_num_tags(MemorySegment struct, int fieldValue) {
        struct.set(max_num_tags$LAYOUT, max_num_tags$OFFSET, fieldValue);
    }

    private static final OfInt xrcd_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("xrcd_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 xrcd_handle
     * }
     */
    public static final OfInt xrcd_handle$layout() {
        return xrcd_handle$LAYOUT;
    }

    private static final long xrcd_handle$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 xrcd_handle
     * }
     */
    public static final long xrcd_handle$offset() {
        return xrcd_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 xrcd_handle
     * }
     */
    public static int xrcd_handle(MemorySegment struct) {
        return struct.get(xrcd_handle$LAYOUT, xrcd_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 xrcd_handle
     * }
     */
    public static void xrcd_handle(MemorySegment struct, int fieldValue) {
        struct.set(xrcd_handle$LAYOUT, xrcd_handle$OFFSET, fieldValue);
    }

    private static final OfInt cq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static final OfInt cq_handle$layout() {
        return cq_handle$LAYOUT;
    }

    private static final long cq_handle$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static final long cq_handle$offset() {
        return cq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static int cq_handle(MemorySegment struct) {
        return struct.get(cq_handle$LAYOUT, cq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static void cq_handle(MemorySegment struct, int fieldValue) {
        struct.set(cq_handle$LAYOUT, cq_handle$OFFSET, fieldValue);
    }

    private static final SequenceLayout driver_data$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("driver_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final SequenceLayout driver_data$layout() {
        return driver_data$LAYOUT;
    }

    private static final long driver_data$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final long driver_data$offset() {
        return driver_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static MemorySegment driver_data(MemorySegment struct) {
        return struct.asSlice(driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    private static long[] driver_data$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long[] driver_data$dimensions() {
        return driver_data$DIMS;
    }
    private static final VarHandle driver_data$ELEM_HANDLE = driver_data$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long driver_data(MemorySegment struct, long index0) {
        return (long)driver_data$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, long index0, long fieldValue) {
        driver_data$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

