// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_post_recv {
 *     __u64 response;
 *     __u32 qp_handle;
 *     __u32 wr_count;
 *     __u32 sge_count;
 *     __u32 wqe_size;
 *     struct ib_uverbs_recv_wr recv_wr[0];
 * }
 * }
 */
public class ib_uverbs_post_recv {

    ib_uverbs_post_recv() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_LONG_LONG.withName("response"),
        RdmaCm.C_INT.withName("qp_handle"),
        RdmaCm.C_INT.withName("wr_count"),
        RdmaCm.C_INT.withName("sge_count"),
        RdmaCm.C_INT.withName("wqe_size"),
        MemoryLayout.sequenceLayout(0, ib_uverbs_recv_wr.layout()).withName("recv_wr")
    ).withName("ib_uverbs_post_recv");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong response$LAYOUT = (OfLong)$LAYOUT.select(groupElement("response"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final OfLong response$layout() {
        return response$LAYOUT;
    }

    private static final long response$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final long response$offset() {
        return response$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static long response(MemorySegment struct) {
        return struct.get(response$LAYOUT, response$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static void response(MemorySegment struct, long fieldValue) {
        struct.set(response$LAYOUT, response$OFFSET, fieldValue);
    }

    private static final OfInt qp_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static final OfInt qp_handle$layout() {
        return qp_handle$LAYOUT;
    }

    private static final long qp_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static final long qp_handle$offset() {
        return qp_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static int qp_handle(MemorySegment struct) {
        return struct.get(qp_handle$LAYOUT, qp_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static void qp_handle(MemorySegment struct, int fieldValue) {
        struct.set(qp_handle$LAYOUT, qp_handle$OFFSET, fieldValue);
    }

    private static final OfInt wr_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wr_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static final OfInt wr_count$layout() {
        return wr_count$LAYOUT;
    }

    private static final long wr_count$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static final long wr_count$offset() {
        return wr_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static int wr_count(MemorySegment struct) {
        return struct.get(wr_count$LAYOUT, wr_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static void wr_count(MemorySegment struct, int fieldValue) {
        struct.set(wr_count$LAYOUT, wr_count$OFFSET, fieldValue);
    }

    private static final OfInt sge_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sge_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static final OfInt sge_count$layout() {
        return sge_count$LAYOUT;
    }

    private static final long sge_count$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static final long sge_count$offset() {
        return sge_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static int sge_count(MemorySegment struct) {
        return struct.get(sge_count$LAYOUT, sge_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static void sge_count(MemorySegment struct, int fieldValue) {
        struct.set(sge_count$LAYOUT, sge_count$OFFSET, fieldValue);
    }

    private static final OfInt wqe_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wqe_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static final OfInt wqe_size$layout() {
        return wqe_size$LAYOUT;
    }

    private static final long wqe_size$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static final long wqe_size$offset() {
        return wqe_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static int wqe_size(MemorySegment struct) {
        return struct.get(wqe_size$LAYOUT, wqe_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static void wqe_size(MemorySegment struct, int fieldValue) {
        struct.set(wqe_size$LAYOUT, wqe_size$OFFSET, fieldValue);
    }

    private static final SequenceLayout recv_wr$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("recv_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static final SequenceLayout recv_wr$layout() {
        return recv_wr$LAYOUT;
    }

    private static final long recv_wr$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static final long recv_wr$offset() {
        return recv_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static MemorySegment recv_wr(MemorySegment struct) {
        return struct.asSlice(recv_wr$OFFSET, recv_wr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static void recv_wr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, recv_wr$OFFSET, recv_wr$LAYOUT.byteSize());
    }

    private static long[] recv_wr$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static long[] recv_wr$dimensions() {
        return recv_wr$DIMS;
    }
    private static final MethodHandle recv_wr$ELEM_HANDLE = recv_wr$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static MemorySegment recv_wr(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)recv_wr$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv_wr[0]
     * }
     */
    public static void recv_wr(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, recv_wr(struct, index0), 0L, ib_uverbs_recv_wr.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

