// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_qp_dest {
 *     __u8 dgid[16];
 *     __u32 flow_label;
 *     __u16 dlid;
 *     __u16 reserved;
 *     __u8 sgid_index;
 *     __u8 hop_limit;
 *     __u8 traffic_class;
 *     __u8 sl;
 *     __u8 src_path_bits;
 *     __u8 static_rate;
 *     __u8 is_global;
 *     __u8 port_num;
 * }
 * }
 */
public class ib_uverbs_qp_dest {

    ib_uverbs_qp_dest() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(16, RdmaCm.C_CHAR).withName("dgid"),
        RdmaCm.C_INT.withName("flow_label"),
        RdmaCm.C_SHORT.withName("dlid"),
        RdmaCm.C_SHORT.withName("reserved"),
        RdmaCm.C_CHAR.withName("sgid_index"),
        RdmaCm.C_CHAR.withName("hop_limit"),
        RdmaCm.C_CHAR.withName("traffic_class"),
        RdmaCm.C_CHAR.withName("sl"),
        RdmaCm.C_CHAR.withName("src_path_bits"),
        RdmaCm.C_CHAR.withName("static_rate"),
        RdmaCm.C_CHAR.withName("is_global"),
        RdmaCm.C_CHAR.withName("port_num")
    ).withName("ib_uverbs_qp_dest");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout dgid$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("dgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static final SequenceLayout dgid$layout() {
        return dgid$LAYOUT;
    }

    private static final long dgid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static final long dgid$offset() {
        return dgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static MemorySegment dgid(MemorySegment struct) {
        return struct.asSlice(dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static void dgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    private static long[] dgid$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static long[] dgid$dimensions() {
        return dgid$DIMS;
    }
    private static final VarHandle dgid$ELEM_HANDLE = dgid$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static byte dgid(MemorySegment struct, long index0) {
        return (byte)dgid$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u8 dgid[16]
     * }
     */
    public static void dgid(MemorySegment struct, long index0, byte fieldValue) {
        dgid$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt flow_label$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flow_label"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flow_label
     * }
     */
    public static final OfInt flow_label$layout() {
        return flow_label$LAYOUT;
    }

    private static final long flow_label$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flow_label
     * }
     */
    public static final long flow_label$offset() {
        return flow_label$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flow_label
     * }
     */
    public static int flow_label(MemorySegment struct) {
        return struct.get(flow_label$LAYOUT, flow_label$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flow_label
     * }
     */
    public static void flow_label(MemorySegment struct, int fieldValue) {
        struct.set(flow_label$LAYOUT, flow_label$OFFSET, fieldValue);
    }

    private static final OfShort dlid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("dlid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static final OfShort dlid$layout() {
        return dlid$LAYOUT;
    }

    private static final long dlid$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static final long dlid$offset() {
        return dlid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static short dlid(MemorySegment struct) {
        return struct.get(dlid$LAYOUT, dlid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static void dlid(MemorySegment struct, short fieldValue) {
        struct.set(dlid$LAYOUT, dlid$OFFSET, fieldValue);
    }

    private static final OfShort reserved$LAYOUT = (OfShort)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static final OfShort reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 22;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static short reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static void reserved(MemorySegment struct, short fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    private static final OfByte sgid_index$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sgid_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 sgid_index
     * }
     */
    public static final OfByte sgid_index$layout() {
        return sgid_index$LAYOUT;
    }

    private static final long sgid_index$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 sgid_index
     * }
     */
    public static final long sgid_index$offset() {
        return sgid_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 sgid_index
     * }
     */
    public static byte sgid_index(MemorySegment struct) {
        return struct.get(sgid_index$LAYOUT, sgid_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 sgid_index
     * }
     */
    public static void sgid_index(MemorySegment struct, byte fieldValue) {
        struct.set(sgid_index$LAYOUT, sgid_index$OFFSET, fieldValue);
    }

    private static final OfByte hop_limit$LAYOUT = (OfByte)$LAYOUT.select(groupElement("hop_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static final OfByte hop_limit$layout() {
        return hop_limit$LAYOUT;
    }

    private static final long hop_limit$OFFSET = 25;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static final long hop_limit$offset() {
        return hop_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static byte hop_limit(MemorySegment struct) {
        return struct.get(hop_limit$LAYOUT, hop_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static void hop_limit(MemorySegment struct, byte fieldValue) {
        struct.set(hop_limit$LAYOUT, hop_limit$OFFSET, fieldValue);
    }

    private static final OfByte traffic_class$LAYOUT = (OfByte)$LAYOUT.select(groupElement("traffic_class"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static final OfByte traffic_class$layout() {
        return traffic_class$LAYOUT;
    }

    private static final long traffic_class$OFFSET = 26;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static final long traffic_class$offset() {
        return traffic_class$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static byte traffic_class(MemorySegment struct) {
        return struct.get(traffic_class$LAYOUT, traffic_class$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static void traffic_class(MemorySegment struct, byte fieldValue) {
        struct.set(traffic_class$LAYOUT, traffic_class$OFFSET, fieldValue);
    }

    private static final OfByte sl$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static final OfByte sl$layout() {
        return sl$LAYOUT;
    }

    private static final long sl$OFFSET = 27;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static final long sl$offset() {
        return sl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static byte sl(MemorySegment struct) {
        return struct.get(sl$LAYOUT, sl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static void sl(MemorySegment struct, byte fieldValue) {
        struct.set(sl$LAYOUT, sl$OFFSET, fieldValue);
    }

    private static final OfByte src_path_bits$LAYOUT = (OfByte)$LAYOUT.select(groupElement("src_path_bits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static final OfByte src_path_bits$layout() {
        return src_path_bits$LAYOUT;
    }

    private static final long src_path_bits$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static final long src_path_bits$offset() {
        return src_path_bits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static byte src_path_bits(MemorySegment struct) {
        return struct.get(src_path_bits$LAYOUT, src_path_bits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static void src_path_bits(MemorySegment struct, byte fieldValue) {
        struct.set(src_path_bits$LAYOUT, src_path_bits$OFFSET, fieldValue);
    }

    private static final OfByte static_rate$LAYOUT = (OfByte)$LAYOUT.select(groupElement("static_rate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static final OfByte static_rate$layout() {
        return static_rate$LAYOUT;
    }

    private static final long static_rate$OFFSET = 29;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static final long static_rate$offset() {
        return static_rate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static byte static_rate(MemorySegment struct) {
        return struct.get(static_rate$LAYOUT, static_rate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static void static_rate(MemorySegment struct, byte fieldValue) {
        struct.set(static_rate$LAYOUT, static_rate$OFFSET, fieldValue);
    }

    private static final OfByte is_global$LAYOUT = (OfByte)$LAYOUT.select(groupElement("is_global"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static final OfByte is_global$layout() {
        return is_global$LAYOUT;
    }

    private static final long is_global$OFFSET = 30;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static final long is_global$offset() {
        return is_global$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static byte is_global(MemorySegment struct) {
        return struct.get(is_global$LAYOUT, is_global$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static void is_global(MemorySegment struct, byte fieldValue) {
        struct.set(is_global$LAYOUT, is_global$OFFSET, fieldValue);
    }

    private static final OfByte port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static final OfByte port_num$layout() {
        return port_num$LAYOUT;
    }

    private static final long port_num$OFFSET = 31;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static final long port_num$offset() {
        return port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static byte port_num(MemorySegment struct) {
        return struct.get(port_num$LAYOUT, port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static void port_num(MemorySegment struct, byte fieldValue) {
        struct.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

