// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_qp_attr {
 *     __u32 qp_attr_mask;
 *     __u32 qp_state;
 *     __u32 cur_qp_state;
 *     __u32 path_mtu;
 *     __u32 path_mig_state;
 *     __u32 qkey;
 *     __u32 rq_psn;
 *     __u32 sq_psn;
 *     __u32 dest_qp_num;
 *     __u32 qp_access_flags;
 *     struct ib_uverbs_ah_attr ah_attr;
 *     struct ib_uverbs_ah_attr alt_ah_attr;
 *     __u32 max_send_wr;
 *     __u32 max_recv_wr;
 *     __u32 max_send_sge;
 *     __u32 max_recv_sge;
 *     __u32 max_inline_data;
 *     __u16 pkey_index;
 *     __u16 alt_pkey_index;
 *     __u8 en_sqd_async_notify;
 *     __u8 sq_draining;
 *     __u8 max_rd_atomic;
 *     __u8 max_dest_rd_atomic;
 *     __u8 min_rnr_timer;
 *     __u8 port_num;
 *     __u8 timeout;
 *     __u8 retry_cnt;
 *     __u8 rnr_retry;
 *     __u8 alt_port_num;
 *     __u8 alt_timeout;
 *     __u8 reserved[5];
 * }
 * }
 */
public class ib_uverbs_qp_attr {

    ib_uverbs_qp_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("qp_attr_mask"),
        RdmaCm.C_INT.withName("qp_state"),
        RdmaCm.C_INT.withName("cur_qp_state"),
        RdmaCm.C_INT.withName("path_mtu"),
        RdmaCm.C_INT.withName("path_mig_state"),
        RdmaCm.C_INT.withName("qkey"),
        RdmaCm.C_INT.withName("rq_psn"),
        RdmaCm.C_INT.withName("sq_psn"),
        RdmaCm.C_INT.withName("dest_qp_num"),
        RdmaCm.C_INT.withName("qp_access_flags"),
        ib_uverbs_ah_attr.layout().withName("ah_attr"),
        ib_uverbs_ah_attr.layout().withName("alt_ah_attr"),
        RdmaCm.C_INT.withName("max_send_wr"),
        RdmaCm.C_INT.withName("max_recv_wr"),
        RdmaCm.C_INT.withName("max_send_sge"),
        RdmaCm.C_INT.withName("max_recv_sge"),
        RdmaCm.C_INT.withName("max_inline_data"),
        RdmaCm.C_SHORT.withName("pkey_index"),
        RdmaCm.C_SHORT.withName("alt_pkey_index"),
        RdmaCm.C_CHAR.withName("en_sqd_async_notify"),
        RdmaCm.C_CHAR.withName("sq_draining"),
        RdmaCm.C_CHAR.withName("max_rd_atomic"),
        RdmaCm.C_CHAR.withName("max_dest_rd_atomic"),
        RdmaCm.C_CHAR.withName("min_rnr_timer"),
        RdmaCm.C_CHAR.withName("port_num"),
        RdmaCm.C_CHAR.withName("timeout"),
        RdmaCm.C_CHAR.withName("retry_cnt"),
        RdmaCm.C_CHAR.withName("rnr_retry"),
        RdmaCm.C_CHAR.withName("alt_port_num"),
        RdmaCm.C_CHAR.withName("alt_timeout"),
        MemoryLayout.sequenceLayout(5, RdmaCm.C_CHAR).withName("reserved")
    ).withName("ib_uverbs_qp_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt qp_attr_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_attr_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qp_attr_mask
     * }
     */
    public static final OfInt qp_attr_mask$layout() {
        return qp_attr_mask$LAYOUT;
    }

    private static final long qp_attr_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qp_attr_mask
     * }
     */
    public static final long qp_attr_mask$offset() {
        return qp_attr_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qp_attr_mask
     * }
     */
    public static int qp_attr_mask(MemorySegment struct) {
        return struct.get(qp_attr_mask$LAYOUT, qp_attr_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qp_attr_mask
     * }
     */
    public static void qp_attr_mask(MemorySegment struct, int fieldValue) {
        struct.set(qp_attr_mask$LAYOUT, qp_attr_mask$OFFSET, fieldValue);
    }

    private static final OfInt qp_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qp_state
     * }
     */
    public static final OfInt qp_state$layout() {
        return qp_state$LAYOUT;
    }

    private static final long qp_state$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qp_state
     * }
     */
    public static final long qp_state$offset() {
        return qp_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qp_state
     * }
     */
    public static int qp_state(MemorySegment struct) {
        return struct.get(qp_state$LAYOUT, qp_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qp_state
     * }
     */
    public static void qp_state(MemorySegment struct, int fieldValue) {
        struct.set(qp_state$LAYOUT, qp_state$OFFSET, fieldValue);
    }

    private static final OfInt cur_qp_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cur_qp_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 cur_qp_state
     * }
     */
    public static final OfInt cur_qp_state$layout() {
        return cur_qp_state$LAYOUT;
    }

    private static final long cur_qp_state$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 cur_qp_state
     * }
     */
    public static final long cur_qp_state$offset() {
        return cur_qp_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 cur_qp_state
     * }
     */
    public static int cur_qp_state(MemorySegment struct) {
        return struct.get(cur_qp_state$LAYOUT, cur_qp_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 cur_qp_state
     * }
     */
    public static void cur_qp_state(MemorySegment struct, int fieldValue) {
        struct.set(cur_qp_state$LAYOUT, cur_qp_state$OFFSET, fieldValue);
    }

    private static final OfInt path_mtu$LAYOUT = (OfInt)$LAYOUT.select(groupElement("path_mtu"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 path_mtu
     * }
     */
    public static final OfInt path_mtu$layout() {
        return path_mtu$LAYOUT;
    }

    private static final long path_mtu$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 path_mtu
     * }
     */
    public static final long path_mtu$offset() {
        return path_mtu$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 path_mtu
     * }
     */
    public static int path_mtu(MemorySegment struct) {
        return struct.get(path_mtu$LAYOUT, path_mtu$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 path_mtu
     * }
     */
    public static void path_mtu(MemorySegment struct, int fieldValue) {
        struct.set(path_mtu$LAYOUT, path_mtu$OFFSET, fieldValue);
    }

    private static final OfInt path_mig_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("path_mig_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 path_mig_state
     * }
     */
    public static final OfInt path_mig_state$layout() {
        return path_mig_state$LAYOUT;
    }

    private static final long path_mig_state$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 path_mig_state
     * }
     */
    public static final long path_mig_state$offset() {
        return path_mig_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 path_mig_state
     * }
     */
    public static int path_mig_state(MemorySegment struct) {
        return struct.get(path_mig_state$LAYOUT, path_mig_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 path_mig_state
     * }
     */
    public static void path_mig_state(MemorySegment struct, int fieldValue) {
        struct.set(path_mig_state$LAYOUT, path_mig_state$OFFSET, fieldValue);
    }

    private static final OfInt qkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qkey
     * }
     */
    public static final OfInt qkey$layout() {
        return qkey$LAYOUT;
    }

    private static final long qkey$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qkey
     * }
     */
    public static final long qkey$offset() {
        return qkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qkey
     * }
     */
    public static int qkey(MemorySegment struct) {
        return struct.get(qkey$LAYOUT, qkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qkey
     * }
     */
    public static void qkey(MemorySegment struct, int fieldValue) {
        struct.set(qkey$LAYOUT, qkey$OFFSET, fieldValue);
    }

    private static final OfInt rq_psn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rq_psn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 rq_psn
     * }
     */
    public static final OfInt rq_psn$layout() {
        return rq_psn$LAYOUT;
    }

    private static final long rq_psn$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 rq_psn
     * }
     */
    public static final long rq_psn$offset() {
        return rq_psn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 rq_psn
     * }
     */
    public static int rq_psn(MemorySegment struct) {
        return struct.get(rq_psn$LAYOUT, rq_psn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 rq_psn
     * }
     */
    public static void rq_psn(MemorySegment struct, int fieldValue) {
        struct.set(rq_psn$LAYOUT, rq_psn$OFFSET, fieldValue);
    }

    private static final OfInt sq_psn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sq_psn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 sq_psn
     * }
     */
    public static final OfInt sq_psn$layout() {
        return sq_psn$LAYOUT;
    }

    private static final long sq_psn$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 sq_psn
     * }
     */
    public static final long sq_psn$offset() {
        return sq_psn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 sq_psn
     * }
     */
    public static int sq_psn(MemorySegment struct) {
        return struct.get(sq_psn$LAYOUT, sq_psn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 sq_psn
     * }
     */
    public static void sq_psn(MemorySegment struct, int fieldValue) {
        struct.set(sq_psn$LAYOUT, sq_psn$OFFSET, fieldValue);
    }

    private static final OfInt dest_qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dest_qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 dest_qp_num
     * }
     */
    public static final OfInt dest_qp_num$layout() {
        return dest_qp_num$LAYOUT;
    }

    private static final long dest_qp_num$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 dest_qp_num
     * }
     */
    public static final long dest_qp_num$offset() {
        return dest_qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 dest_qp_num
     * }
     */
    public static int dest_qp_num(MemorySegment struct) {
        return struct.get(dest_qp_num$LAYOUT, dest_qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 dest_qp_num
     * }
     */
    public static void dest_qp_num(MemorySegment struct, int fieldValue) {
        struct.set(dest_qp_num$LAYOUT, dest_qp_num$OFFSET, fieldValue);
    }

    private static final OfInt qp_access_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_access_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qp_access_flags
     * }
     */
    public static final OfInt qp_access_flags$layout() {
        return qp_access_flags$LAYOUT;
    }

    private static final long qp_access_flags$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qp_access_flags
     * }
     */
    public static final long qp_access_flags$offset() {
        return qp_access_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qp_access_flags
     * }
     */
    public static int qp_access_flags(MemorySegment struct) {
        return struct.get(qp_access_flags$LAYOUT, qp_access_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qp_access_flags
     * }
     */
    public static void qp_access_flags(MemorySegment struct, int fieldValue) {
        struct.set(qp_access_flags$LAYOUT, qp_access_flags$OFFSET, fieldValue);
    }

    private static final GroupLayout ah_attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ah_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr ah_attr
     * }
     */
    public static final GroupLayout ah_attr$layout() {
        return ah_attr$LAYOUT;
    }

    private static final long ah_attr$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr ah_attr
     * }
     */
    public static final long ah_attr$offset() {
        return ah_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr ah_attr
     * }
     */
    public static MemorySegment ah_attr(MemorySegment struct) {
        return struct.asSlice(ah_attr$OFFSET, ah_attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr ah_attr
     * }
     */
    public static void ah_attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ah_attr$OFFSET, ah_attr$LAYOUT.byteSize());
    }

    private static final GroupLayout alt_ah_attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("alt_ah_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr alt_ah_attr
     * }
     */
    public static final GroupLayout alt_ah_attr$layout() {
        return alt_ah_attr$LAYOUT;
    }

    private static final long alt_ah_attr$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr alt_ah_attr
     * }
     */
    public static final long alt_ah_attr$offset() {
        return alt_ah_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr alt_ah_attr
     * }
     */
    public static MemorySegment alt_ah_attr(MemorySegment struct) {
        return struct.asSlice(alt_ah_attr$OFFSET, alt_ah_attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_ah_attr alt_ah_attr
     * }
     */
    public static void alt_ah_attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, alt_ah_attr$OFFSET, alt_ah_attr$LAYOUT.byteSize());
    }

    private static final OfInt max_send_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final OfInt max_send_wr$layout() {
        return max_send_wr$LAYOUT;
    }

    private static final long max_send_wr$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final long max_send_wr$offset() {
        return max_send_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static int max_send_wr(MemorySegment struct) {
        return struct.get(max_send_wr$LAYOUT, max_send_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static void max_send_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_send_wr$LAYOUT, max_send_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final OfInt max_recv_wr$layout() {
        return max_recv_wr$LAYOUT;
    }

    private static final long max_recv_wr$OFFSET = 108;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final long max_recv_wr$offset() {
        return max_recv_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static int max_recv_wr(MemorySegment struct) {
        return struct.get(max_recv_wr$LAYOUT, max_recv_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static void max_recv_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_wr$LAYOUT, max_recv_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_send_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final OfInt max_send_sge$layout() {
        return max_send_sge$LAYOUT;
    }

    private static final long max_send_sge$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final long max_send_sge$offset() {
        return max_send_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static int max_send_sge(MemorySegment struct) {
        return struct.get(max_send_sge$LAYOUT, max_send_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static void max_send_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_send_sge$LAYOUT, max_send_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final OfInt max_recv_sge$layout() {
        return max_recv_sge$LAYOUT;
    }

    private static final long max_recv_sge$OFFSET = 116;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final long max_recv_sge$offset() {
        return max_recv_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static int max_recv_sge(MemorySegment struct) {
        return struct.get(max_recv_sge$LAYOUT, max_recv_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static void max_recv_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_sge$LAYOUT, max_recv_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_inline_data$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_inline_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final OfInt max_inline_data$layout() {
        return max_inline_data$LAYOUT;
    }

    private static final long max_inline_data$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final long max_inline_data$offset() {
        return max_inline_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static int max_inline_data(MemorySegment struct) {
        return struct.get(max_inline_data$LAYOUT, max_inline_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static void max_inline_data(MemorySegment struct, int fieldValue) {
        struct.set(max_inline_data$LAYOUT, max_inline_data$OFFSET, fieldValue);
    }

    private static final OfShort pkey_index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 pkey_index
     * }
     */
    public static final OfShort pkey_index$layout() {
        return pkey_index$LAYOUT;
    }

    private static final long pkey_index$OFFSET = 124;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 pkey_index
     * }
     */
    public static final long pkey_index$offset() {
        return pkey_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 pkey_index
     * }
     */
    public static short pkey_index(MemorySegment struct) {
        return struct.get(pkey_index$LAYOUT, pkey_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 pkey_index
     * }
     */
    public static void pkey_index(MemorySegment struct, short fieldValue) {
        struct.set(pkey_index$LAYOUT, pkey_index$OFFSET, fieldValue);
    }

    private static final OfShort alt_pkey_index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("alt_pkey_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 alt_pkey_index
     * }
     */
    public static final OfShort alt_pkey_index$layout() {
        return alt_pkey_index$LAYOUT;
    }

    private static final long alt_pkey_index$OFFSET = 126;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 alt_pkey_index
     * }
     */
    public static final long alt_pkey_index$offset() {
        return alt_pkey_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 alt_pkey_index
     * }
     */
    public static short alt_pkey_index(MemorySegment struct) {
        return struct.get(alt_pkey_index$LAYOUT, alt_pkey_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 alt_pkey_index
     * }
     */
    public static void alt_pkey_index(MemorySegment struct, short fieldValue) {
        struct.set(alt_pkey_index$LAYOUT, alt_pkey_index$OFFSET, fieldValue);
    }

    private static final OfByte en_sqd_async_notify$LAYOUT = (OfByte)$LAYOUT.select(groupElement("en_sqd_async_notify"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 en_sqd_async_notify
     * }
     */
    public static final OfByte en_sqd_async_notify$layout() {
        return en_sqd_async_notify$LAYOUT;
    }

    private static final long en_sqd_async_notify$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 en_sqd_async_notify
     * }
     */
    public static final long en_sqd_async_notify$offset() {
        return en_sqd_async_notify$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 en_sqd_async_notify
     * }
     */
    public static byte en_sqd_async_notify(MemorySegment struct) {
        return struct.get(en_sqd_async_notify$LAYOUT, en_sqd_async_notify$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 en_sqd_async_notify
     * }
     */
    public static void en_sqd_async_notify(MemorySegment struct, byte fieldValue) {
        struct.set(en_sqd_async_notify$LAYOUT, en_sqd_async_notify$OFFSET, fieldValue);
    }

    private static final OfByte sq_draining$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sq_draining"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 sq_draining
     * }
     */
    public static final OfByte sq_draining$layout() {
        return sq_draining$LAYOUT;
    }

    private static final long sq_draining$OFFSET = 129;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 sq_draining
     * }
     */
    public static final long sq_draining$offset() {
        return sq_draining$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 sq_draining
     * }
     */
    public static byte sq_draining(MemorySegment struct) {
        return struct.get(sq_draining$LAYOUT, sq_draining$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 sq_draining
     * }
     */
    public static void sq_draining(MemorySegment struct, byte fieldValue) {
        struct.set(sq_draining$LAYOUT, sq_draining$OFFSET, fieldValue);
    }

    private static final OfByte max_rd_atomic$LAYOUT = (OfByte)$LAYOUT.select(groupElement("max_rd_atomic"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 max_rd_atomic
     * }
     */
    public static final OfByte max_rd_atomic$layout() {
        return max_rd_atomic$LAYOUT;
    }

    private static final long max_rd_atomic$OFFSET = 130;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 max_rd_atomic
     * }
     */
    public static final long max_rd_atomic$offset() {
        return max_rd_atomic$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 max_rd_atomic
     * }
     */
    public static byte max_rd_atomic(MemorySegment struct) {
        return struct.get(max_rd_atomic$LAYOUT, max_rd_atomic$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 max_rd_atomic
     * }
     */
    public static void max_rd_atomic(MemorySegment struct, byte fieldValue) {
        struct.set(max_rd_atomic$LAYOUT, max_rd_atomic$OFFSET, fieldValue);
    }

    private static final OfByte max_dest_rd_atomic$LAYOUT = (OfByte)$LAYOUT.select(groupElement("max_dest_rd_atomic"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 max_dest_rd_atomic
     * }
     */
    public static final OfByte max_dest_rd_atomic$layout() {
        return max_dest_rd_atomic$LAYOUT;
    }

    private static final long max_dest_rd_atomic$OFFSET = 131;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 max_dest_rd_atomic
     * }
     */
    public static final long max_dest_rd_atomic$offset() {
        return max_dest_rd_atomic$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 max_dest_rd_atomic
     * }
     */
    public static byte max_dest_rd_atomic(MemorySegment struct) {
        return struct.get(max_dest_rd_atomic$LAYOUT, max_dest_rd_atomic$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 max_dest_rd_atomic
     * }
     */
    public static void max_dest_rd_atomic(MemorySegment struct, byte fieldValue) {
        struct.set(max_dest_rd_atomic$LAYOUT, max_dest_rd_atomic$OFFSET, fieldValue);
    }

    private static final OfByte min_rnr_timer$LAYOUT = (OfByte)$LAYOUT.select(groupElement("min_rnr_timer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 min_rnr_timer
     * }
     */
    public static final OfByte min_rnr_timer$layout() {
        return min_rnr_timer$LAYOUT;
    }

    private static final long min_rnr_timer$OFFSET = 132;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 min_rnr_timer
     * }
     */
    public static final long min_rnr_timer$offset() {
        return min_rnr_timer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 min_rnr_timer
     * }
     */
    public static byte min_rnr_timer(MemorySegment struct) {
        return struct.get(min_rnr_timer$LAYOUT, min_rnr_timer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 min_rnr_timer
     * }
     */
    public static void min_rnr_timer(MemorySegment struct, byte fieldValue) {
        struct.set(min_rnr_timer$LAYOUT, min_rnr_timer$OFFSET, fieldValue);
    }

    private static final OfByte port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static final OfByte port_num$layout() {
        return port_num$LAYOUT;
    }

    private static final long port_num$OFFSET = 133;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static final long port_num$offset() {
        return port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static byte port_num(MemorySegment struct) {
        return struct.get(port_num$LAYOUT, port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static void port_num(MemorySegment struct, byte fieldValue) {
        struct.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
    }

    private static final OfByte timeout$LAYOUT = (OfByte)$LAYOUT.select(groupElement("timeout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 timeout
     * }
     */
    public static final OfByte timeout$layout() {
        return timeout$LAYOUT;
    }

    private static final long timeout$OFFSET = 134;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 timeout
     * }
     */
    public static final long timeout$offset() {
        return timeout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 timeout
     * }
     */
    public static byte timeout(MemorySegment struct) {
        return struct.get(timeout$LAYOUT, timeout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 timeout
     * }
     */
    public static void timeout(MemorySegment struct, byte fieldValue) {
        struct.set(timeout$LAYOUT, timeout$OFFSET, fieldValue);
    }

    private static final OfByte retry_cnt$LAYOUT = (OfByte)$LAYOUT.select(groupElement("retry_cnt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 retry_cnt
     * }
     */
    public static final OfByte retry_cnt$layout() {
        return retry_cnt$LAYOUT;
    }

    private static final long retry_cnt$OFFSET = 135;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 retry_cnt
     * }
     */
    public static final long retry_cnt$offset() {
        return retry_cnt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 retry_cnt
     * }
     */
    public static byte retry_cnt(MemorySegment struct) {
        return struct.get(retry_cnt$LAYOUT, retry_cnt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 retry_cnt
     * }
     */
    public static void retry_cnt(MemorySegment struct, byte fieldValue) {
        struct.set(retry_cnt$LAYOUT, retry_cnt$OFFSET, fieldValue);
    }

    private static final OfByte rnr_retry$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rnr_retry"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 rnr_retry
     * }
     */
    public static final OfByte rnr_retry$layout() {
        return rnr_retry$LAYOUT;
    }

    private static final long rnr_retry$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 rnr_retry
     * }
     */
    public static final long rnr_retry$offset() {
        return rnr_retry$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 rnr_retry
     * }
     */
    public static byte rnr_retry(MemorySegment struct) {
        return struct.get(rnr_retry$LAYOUT, rnr_retry$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 rnr_retry
     * }
     */
    public static void rnr_retry(MemorySegment struct, byte fieldValue) {
        struct.set(rnr_retry$LAYOUT, rnr_retry$OFFSET, fieldValue);
    }

    private static final OfByte alt_port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("alt_port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 alt_port_num
     * }
     */
    public static final OfByte alt_port_num$layout() {
        return alt_port_num$LAYOUT;
    }

    private static final long alt_port_num$OFFSET = 137;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 alt_port_num
     * }
     */
    public static final long alt_port_num$offset() {
        return alt_port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 alt_port_num
     * }
     */
    public static byte alt_port_num(MemorySegment struct) {
        return struct.get(alt_port_num$LAYOUT, alt_port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 alt_port_num
     * }
     */
    public static void alt_port_num(MemorySegment struct, byte fieldValue) {
        struct.set(alt_port_num$LAYOUT, alt_port_num$OFFSET, fieldValue);
    }

    private static final OfByte alt_timeout$LAYOUT = (OfByte)$LAYOUT.select(groupElement("alt_timeout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 alt_timeout
     * }
     */
    public static final OfByte alt_timeout$layout() {
        return alt_timeout$LAYOUT;
    }

    private static final long alt_timeout$OFFSET = 138;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 alt_timeout
     * }
     */
    public static final long alt_timeout$offset() {
        return alt_timeout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 alt_timeout
     * }
     */
    public static byte alt_timeout(MemorySegment struct) {
        return struct.get(alt_timeout$LAYOUT, alt_timeout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 alt_timeout
     * }
     */
    public static void alt_timeout(MemorySegment struct, byte fieldValue) {
        struct.set(alt_timeout$LAYOUT, alt_timeout$OFFSET, fieldValue);
    }

    private static final SequenceLayout reserved$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 reserved[5]
     * }
     */
    public static final SequenceLayout reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 139;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 reserved[5]
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 reserved[5]
     * }
     */
    public static MemorySegment reserved(MemorySegment struct) {
        return struct.asSlice(reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 reserved[5]
     * }
     */
    public static void reserved(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    private static long[] reserved$DIMS = { 5 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 reserved[5]
     * }
     */
    public static long[] reserved$dimensions() {
        return reserved$DIMS;
    }
