// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ex_create_wq {
 *     __u32 comp_mask;
 *     __u32 wq_type;
 *     __u64 user_handle;
 *     __u32 pd_handle;
 *     __u32 cq_handle;
 *     __u32 max_wr;
 *     __u32 max_sge;
 *     __u32 create_flags;
 *     __u32 reserved;
 * }
 * }
 */
public class ib_uverbs_ex_create_wq {

    ib_uverbs_ex_create_wq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_INT.withName("wq_type"),
        RdmaCm.C_LONG_LONG.withName("user_handle"),
        RdmaCm.C_INT.withName("pd_handle"),
        RdmaCm.C_INT.withName("cq_handle"),
        RdmaCm.C_INT.withName("max_wr"),
        RdmaCm.C_INT.withName("max_sge"),
        RdmaCm.C_INT.withName("create_flags"),
        RdmaCm.C_INT.withName("reserved")
    ).withName("ib_uverbs_ex_create_wq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt wq_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wq_type
     * }
     */
    public static final OfInt wq_type$layout() {
        return wq_type$LAYOUT;
    }

    private static final long wq_type$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wq_type
     * }
     */
    public static final long wq_type$offset() {
        return wq_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wq_type
     * }
     */
    public static int wq_type(MemorySegment struct) {
        return struct.get(wq_type$LAYOUT, wq_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wq_type
     * }
     */
    public static void wq_type(MemorySegment struct, int fieldValue) {
        struct.set(wq_type$LAYOUT, wq_type$OFFSET, fieldValue);
    }

    private static final OfLong user_handle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("user_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final OfLong user_handle$layout() {
        return user_handle$LAYOUT;
    }

    private static final long user_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final long user_handle$offset() {
        return user_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static long user_handle(MemorySegment struct) {
        return struct.get(user_handle$LAYOUT, user_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static void user_handle(MemorySegment struct, long fieldValue) {
        struct.set(user_handle$LAYOUT, user_handle$OFFSET, fieldValue);
    }

    private static final OfInt pd_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pd_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final OfInt pd_handle$layout() {
        return pd_handle$LAYOUT;
    }

    private static final long pd_handle$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final long pd_handle$offset() {
        return pd_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static int pd_handle(MemorySegment struct) {
        return struct.get(pd_handle$LAYOUT, pd_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static void pd_handle(MemorySegment struct, int fieldValue) {
        struct.set(pd_handle$LAYOUT, pd_handle$OFFSET, fieldValue);
    }

    private static final OfInt cq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static final OfInt cq_handle$layout() {
        return cq_handle$LAYOUT;
    }

    private static final long cq_handle$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static final long cq_handle$offset() {
        return cq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static int cq_handle(MemorySegment struct) {
        return struct.get(cq_handle$LAYOUT, cq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 cq_handle
     * }
     */
    public static void cq_handle(MemorySegment struct, int fieldValue) {
        struct.set(cq_handle$LAYOUT, cq_handle$OFFSET, fieldValue);
    }

    private static final OfInt max_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final OfInt max_wr$layout() {
        return max_wr$LAYOUT;
    }

    private static final long max_wr$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final long max_wr$offset() {
        return max_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static int max_wr(MemorySegment struct) {
        return struct.get(max_wr$LAYOUT, max_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static void max_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_wr$LAYOUT, max_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static final OfInt max_sge$layout() {
        return max_sge$LAYOUT;
    }

    private static final long max_sge$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static final long max_sge$offset() {
        return max_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static int max_sge(MemorySegment struct) {
        return struct.get(max_sge$LAYOUT, max_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static void max_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_sge$LAYOUT, max_sge$OFFSET, fieldValue);
    }

    private static final OfInt create_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("create_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static final OfInt create_flags$layout() {
        return create_flags$LAYOUT;
    }

    private static final long create_flags$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static final long create_flags$offset() {
        return create_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static int create_flags(MemorySegment struct) {
        return struct.get(create_flags$LAYOUT, create_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 create_flags
     * }
     */
    public static void create_flags(MemorySegment struct, int fieldValue) {
        struct.set(create_flags$LAYOUT, create_flags$OFFSET, fieldValue);
    }

    private static final OfInt reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final OfInt reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static int reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static void reserved(MemorySegment struct, int fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

