// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_flow_action_esp_encap {
 *     union {
 *         void *val_ptr;
 *         __u64 val_ptr_data_u64;
 *     };
 *     union {
 *         struct ib_uverbs_flow_action_esp_encap *next_ptr;
 *         __u64 next_ptr_data_u64;
 *     };
 *     __u16 len;
 *     __u16 type;
 * }
 * }
 */
public class ib_uverbs_flow_action_esp_encap {

    ib_uverbs_flow_action_esp_encap() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            RdmaCm.C_POINTER.withName("val_ptr"),
            RdmaCm.C_LONG_LONG.withName("val_ptr_data_u64")
        ).withName("$anon$189:2"),
        MemoryLayout.unionLayout(
            RdmaCm.C_POINTER.withName("next_ptr"),
            RdmaCm.C_LONG_LONG.withName("next_ptr_data_u64")
        ).withName("$anon$190:2"),
        RdmaCm.C_SHORT.withName("len"),
        RdmaCm.C_SHORT.withName("type"),
        MemoryLayout.paddingLayout(4)
    ).withName("ib_uverbs_flow_action_esp_encap");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout val_ptr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("$anon$189:2"), groupElement("val_ptr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *val_ptr
     * }
     */
    public static final AddressLayout val_ptr$layout() {
        return val_ptr$LAYOUT;
    }

    private static final long val_ptr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *val_ptr
     * }
     */
    public static final long val_ptr$offset() {
        return val_ptr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *val_ptr
     * }
     */
    public static MemorySegment val_ptr(MemorySegment struct) {
        return struct.get(val_ptr$LAYOUT, val_ptr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *val_ptr
     * }
     */
    public static void val_ptr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(val_ptr$LAYOUT, val_ptr$OFFSET, fieldValue);
    }

    private static final OfLong val_ptr_data_u64$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$189:2"), groupElement("val_ptr_data_u64"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 val_ptr_data_u64
     * }
     */
    public static final OfLong val_ptr_data_u64$layout() {
        return val_ptr_data_u64$LAYOUT;
    }

    private static final long val_ptr_data_u64$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 val_ptr_data_u64
     * }
     */
    public static final long val_ptr_data_u64$offset() {
        return val_ptr_data_u64$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 val_ptr_data_u64
     * }
     */
    public static long val_ptr_data_u64(MemorySegment struct) {
        return struct.get(val_ptr_data_u64$LAYOUT, val_ptr_data_u64$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 val_ptr_data_u64
     * }
     */
    public static void val_ptr_data_u64(MemorySegment struct, long fieldValue) {
        struct.set(val_ptr_data_u64$LAYOUT, val_ptr_data_u64$OFFSET, fieldValue);
    }

    private static final AddressLayout next_ptr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("$anon$190:2"), groupElement("next_ptr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *next_ptr
     * }
     */
    public static final AddressLayout next_ptr$layout() {
        return next_ptr$LAYOUT;
    }

    private static final long next_ptr$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *next_ptr
     * }
     */
    public static final long next_ptr$offset() {
        return next_ptr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *next_ptr
     * }
     */
    public static MemorySegment next_ptr(MemorySegment struct) {
        return struct.get(next_ptr$LAYOUT, next_ptr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *next_ptr
     * }
     */
    public static void next_ptr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(next_ptr$LAYOUT, next_ptr$OFFSET, fieldValue);
    }

    private static final OfLong next_ptr_data_u64$LAYOUT = (OfLong)$LAYOUT.select(groupElement("$anon$190:2"), groupElement("next_ptr_data_u64"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 next_ptr_data_u64
     * }
     */
    public static final OfLong next_ptr_data_u64$layout() {
        return next_ptr_data_u64$LAYOUT;
    }

    private static final long next_ptr_data_u64$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 next_ptr_data_u64
     * }
     */
    public static final long next_ptr_data_u64$offset() {
        return next_ptr_data_u64$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 next_ptr_data_u64
     * }
     */
    public static long next_ptr_data_u64(MemorySegment struct) {
        return struct.get(next_ptr_data_u64$LAYOUT, next_ptr_data_u64$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 next_ptr_data_u64
     * }
     */
    public static void next_ptr_data_u64(MemorySegment struct, long fieldValue) {
        struct.set(next_ptr_data_u64$LAYOUT, next_ptr_data_u64$OFFSET, fieldValue);
    }

    private static final OfShort len$LAYOUT = (OfShort)$LAYOUT.select(groupElement("len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 len
     * }
     */
    public static final OfShort len$layout() {
        return len$LAYOUT;
    }

    private static final long len$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 len
     * }
     */
    public static final long len$offset() {
        return len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 len
     * }
     */
    public static short len(MemorySegment struct) {
        return struct.get(len$LAYOUT, len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 len
     * }
     */
    public static void len(MemorySegment struct, short fieldValue) {
        struct.set(len$LAYOUT, len$OFFSET, fieldValue);
    }

    private static final OfShort type$LAYOUT = (OfShort)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 type
     * }
     */
    public static final OfShort type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 18;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 type
     * }
     */
    public static short type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 type
     * }
     */
    public static void type(MemorySegment struct, short fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

