// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_qp_cap {
 *     __u32 max_send_wr;
 *     __u32 max_recv_wr;
 *     __u32 max_send_sge;
 *     __u32 max_recv_sge;
 *     __u32 max_inline_data;
 * }
 * }
 */
public class ib_uverbs_qp_cap {

    ib_uverbs_qp_cap() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("max_send_wr"),
        RdmaCm.C_INT.withName("max_recv_wr"),
        RdmaCm.C_INT.withName("max_send_sge"),
        RdmaCm.C_INT.withName("max_recv_sge"),
        RdmaCm.C_INT.withName("max_inline_data")
    ).withName("ib_uverbs_qp_cap");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt max_send_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final OfInt max_send_wr$layout() {
        return max_send_wr$LAYOUT;
    }

    private static final long max_send_wr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static final long max_send_wr$offset() {
        return max_send_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static int max_send_wr(MemorySegment struct) {
        return struct.get(max_send_wr$LAYOUT, max_send_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_wr
     * }
     */
    public static void max_send_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_send_wr$LAYOUT, max_send_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final OfInt max_recv_wr$layout() {
        return max_recv_wr$LAYOUT;
    }

    private static final long max_recv_wr$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static final long max_recv_wr$offset() {
        return max_recv_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static int max_recv_wr(MemorySegment struct) {
        return struct.get(max_recv_wr$LAYOUT, max_recv_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_wr
     * }
     */
    public static void max_recv_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_wr$LAYOUT, max_recv_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_send_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_send_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final OfInt max_send_sge$layout() {
        return max_send_sge$LAYOUT;
    }

    private static final long max_send_sge$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static final long max_send_sge$offset() {
        return max_send_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static int max_send_sge(MemorySegment struct) {
        return struct.get(max_send_sge$LAYOUT, max_send_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_send_sge
     * }
     */
    public static void max_send_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_send_sge$LAYOUT, max_send_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_recv_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_recv_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final OfInt max_recv_sge$layout() {
        return max_recv_sge$LAYOUT;
    }

    private static final long max_recv_sge$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static final long max_recv_sge$offset() {
        return max_recv_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static int max_recv_sge(MemorySegment struct) {
        return struct.get(max_recv_sge$LAYOUT, max_recv_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_recv_sge
     * }
     */
    public static void max_recv_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_recv_sge$LAYOUT, max_recv_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_inline_data$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_inline_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final OfInt max_inline_data$layout() {
        return max_inline_data$LAYOUT;
    }

    private static final long max_inline_data$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static final long max_inline_data$offset() {
        return max_inline_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static int max_inline_data(MemorySegment struct) {
        return struct.get(max_inline_data$LAYOUT, max_inline_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_inline_data
     * }
     */
    public static void max_inline_data(MemorySegment struct, int fieldValue) {
        struct.set(max_inline_data$LAYOUT, max_inline_data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

