// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_flow_ipv6_filter {
 *     __u8 src_ip[16];
 *     __u8 dst_ip[16];
 *     __be32 flow_label;
 *     __u8 next_hdr;
 *     __u8 traffic_class;
 *     __u8 hop_limit;
 *     __u8 reserved;
 * }
 * }
 */
public class ib_uverbs_flow_ipv6_filter {

    ib_uverbs_flow_ipv6_filter() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(16, RdmaCm.C_CHAR).withName("src_ip"),
        MemoryLayout.sequenceLayout(16, RdmaCm.C_CHAR).withName("dst_ip"),
        RdmaCm.C_INT.withName("flow_label"),
        RdmaCm.C_CHAR.withName("next_hdr"),
        RdmaCm.C_CHAR.withName("traffic_class"),
        RdmaCm.C_CHAR.withName("hop_limit"),
        RdmaCm.C_CHAR.withName("reserved")
    ).withName("ib_uverbs_flow_ipv6_filter");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout src_ip$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("src_ip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static final SequenceLayout src_ip$layout() {
        return src_ip$LAYOUT;
    }

    private static final long src_ip$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static final long src_ip$offset() {
        return src_ip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static MemorySegment src_ip(MemorySegment struct) {
        return struct.asSlice(src_ip$OFFSET, src_ip$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static void src_ip(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, src_ip$OFFSET, src_ip$LAYOUT.byteSize());
    }

    private static long[] src_ip$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static long[] src_ip$dimensions() {
        return src_ip$DIMS;
    }
    private static final VarHandle src_ip$ELEM_HANDLE = src_ip$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static byte src_ip(MemorySegment struct, long index0) {
        return (byte)src_ip$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u8 src_ip[16]
     * }
     */
    public static void src_ip(MemorySegment struct, long index0, byte fieldValue) {
        src_ip$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout dst_ip$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("dst_ip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static final SequenceLayout dst_ip$layout() {
        return dst_ip$LAYOUT;
    }

    private static final long dst_ip$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static final long dst_ip$offset() {
        return dst_ip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static MemorySegment dst_ip(MemorySegment struct) {
        return struct.asSlice(dst_ip$OFFSET, dst_ip$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static void dst_ip(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dst_ip$OFFSET, dst_ip$LAYOUT.byteSize());
    }

    private static long[] dst_ip$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static long[] dst_ip$dimensions() {
        return dst_ip$DIMS;
    }
    private static final VarHandle dst_ip$ELEM_HANDLE = dst_ip$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static byte dst_ip(MemorySegment struct, long index0) {
        return (byte)dst_ip$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u8 dst_ip[16]
     * }
     */
    public static void dst_ip(MemorySegment struct, long index0, byte fieldValue) {
        dst_ip$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt flow_label$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flow_label"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static final OfInt flow_label$layout() {
        return flow_label$LAYOUT;
    }

    private static final long flow_label$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static final long flow_label$offset() {
        return flow_label$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static int flow_label(MemorySegment struct) {
        return struct.get(flow_label$LAYOUT, flow_label$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static void flow_label(MemorySegment struct, int fieldValue) {
        struct.set(flow_label$LAYOUT, flow_label$OFFSET, fieldValue);
    }

    private static final OfByte next_hdr$LAYOUT = (OfByte)$LAYOUT.select(groupElement("next_hdr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 next_hdr
     * }
     */
    public static final OfByte next_hdr$layout() {
        return next_hdr$LAYOUT;
    }

    private static final long next_hdr$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 next_hdr
     * }
     */
    public static final long next_hdr$offset() {
        return next_hdr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 next_hdr
     * }
     */
    public static byte next_hdr(MemorySegment struct) {
        return struct.get(next_hdr$LAYOUT, next_hdr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 next_hdr
     * }
     */
    public static void next_hdr(MemorySegment struct, byte fieldValue) {
        struct.set(next_hdr$LAYOUT, next_hdr$OFFSET, fieldValue);
    }

    private static final OfByte traffic_class$LAYOUT = (OfByte)$LAYOUT.select(groupElement("traffic_class"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static final OfByte traffic_class$layout() {
        return traffic_class$LAYOUT;
    }

    private static final long traffic_class$OFFSET = 37;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static final long traffic_class$offset() {
        return traffic_class$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static byte traffic_class(MemorySegment struct) {
        return struct.get(traffic_class$LAYOUT, traffic_class$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 traffic_class
     * }
     */
    public static void traffic_class(MemorySegment struct, byte fieldValue) {
        struct.set(traffic_class$LAYOUT, traffic_class$OFFSET, fieldValue);
    }

    private static final OfByte hop_limit$LAYOUT = (OfByte)$LAYOUT.select(groupElement("hop_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static final OfByte hop_limit$layout() {
        return hop_limit$LAYOUT;
    }

    private static final long hop_limit$OFFSET = 38;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static final long hop_limit$offset() {
        return hop_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static byte hop_limit(MemorySegment struct) {
        return struct.get(hop_limit$LAYOUT, hop_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 hop_limit
     * }
     */
    public static void hop_limit(MemorySegment struct, byte fieldValue) {
        struct.set(hop_limit$LAYOUT, hop_limit$OFFSET, fieldValue);
    }

    private static final OfByte reserved$LAYOUT = (OfByte)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static final OfByte reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 39;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static byte reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static void reserved(MemorySegment struct, byte fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

