// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_rwq_ind_table_init_attr {
 *     uint32_t log_ind_tbl_size;
 *     struct ibv_wq **ind_tbl;
 *     uint32_t comp_mask;
 * }
 * }
 */
public class ibv_rwq_ind_table_init_attr {

    ibv_rwq_ind_table_init_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("log_ind_tbl_size"),
        MemoryLayout.paddingLayout(4),
        RdmaCm.C_POINTER.withName("ind_tbl"),
        RdmaCm.C_INT.withName("comp_mask"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_rwq_ind_table_init_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt log_ind_tbl_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("log_ind_tbl_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t log_ind_tbl_size
     * }
     */
    public static final OfInt log_ind_tbl_size$layout() {
        return log_ind_tbl_size$LAYOUT;
    }

    private static final long log_ind_tbl_size$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t log_ind_tbl_size
     * }
     */
    public static final long log_ind_tbl_size$offset() {
        return log_ind_tbl_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t log_ind_tbl_size
     * }
     */
    public static int log_ind_tbl_size(MemorySegment struct) {
        return struct.get(log_ind_tbl_size$LAYOUT, log_ind_tbl_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t log_ind_tbl_size
     * }
     */
    public static void log_ind_tbl_size(MemorySegment struct, int fieldValue) {
        struct.set(log_ind_tbl_size$LAYOUT, log_ind_tbl_size$OFFSET, fieldValue);
    }

    private static final AddressLayout ind_tbl$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ind_tbl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_wq **ind_tbl
     * }
     */
    public static final AddressLayout ind_tbl$layout() {
        return ind_tbl$LAYOUT;
    }

    private static final long ind_tbl$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_wq **ind_tbl
     * }
     */
    public static final long ind_tbl$offset() {
        return ind_tbl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_wq **ind_tbl
     * }
     */
    public static MemorySegment ind_tbl(MemorySegment struct) {
        return struct.get(ind_tbl$LAYOUT, ind_tbl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_wq **ind_tbl
     * }
     */
    public static void ind_tbl(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ind_tbl$LAYOUT, ind_tbl$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

