// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_qp_init_attr_ex {
 *     void *qp_context;
 *     struct ibv_cq *send_cq;
 *     struct ibv_cq *recv_cq;
 *     struct ibv_srq *srq;
 *     struct ibv_qp_cap cap;
 *     enum ibv_qp_type qp_type;
 *     int sq_sig_all;
 *     uint32_t comp_mask;
 *     struct ibv_pd *pd;
 *     struct ibv_xrcd *xrcd;
 *     uint32_t create_flags;
 *     uint16_t max_tso_header;
 *     struct ibv_rwq_ind_table *rwq_ind_tbl;
 *     struct ibv_rx_hash_conf rx_hash_conf;
 *     uint32_t source_qpn;
 *     uint64_t send_ops_flags;
 * }
 * }
 */
public class ibv_qp_init_attr_ex {

    ibv_qp_init_attr_ex() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("qp_context"),
        RdmaCm.C_POINTER.withName("send_cq"),
        RdmaCm.C_POINTER.withName("recv_cq"),
        RdmaCm.C_POINTER.withName("srq"),
        ibv_qp_cap.layout().withName("cap"),
        RdmaCm.C_INT.withName("qp_type"),
        RdmaCm.C_INT.withName("sq_sig_all"),
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_POINTER.withName("pd"),
        RdmaCm.C_POINTER.withName("xrcd"),
        RdmaCm.C_INT.withName("create_flags"),
        RdmaCm.C_SHORT.withName("max_tso_header"),
        MemoryLayout.paddingLayout(2),
        RdmaCm.C_POINTER.withName("rwq_ind_tbl"),
        ibv_rx_hash_conf.layout().withName("rx_hash_conf"),
        RdmaCm.C_INT.withName("source_qpn"),
        MemoryLayout.paddingLayout(4),
        RdmaCm.C_LONG.withName("send_ops_flags")
    ).withName("ibv_qp_init_attr_ex");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout qp_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("qp_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final AddressLayout qp_context$layout() {
        return qp_context$LAYOUT;
    }

    private static final long qp_context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final long qp_context$offset() {
        return qp_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static MemorySegment qp_context(MemorySegment struct) {
        return struct.get(qp_context$LAYOUT, qp_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static void qp_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(qp_context$LAYOUT, qp_context$OFFSET, fieldValue);
    }

    private static final AddressLayout send_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("send_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final AddressLayout send_cq$layout() {
        return send_cq$LAYOUT;
    }

    private static final long send_cq$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final long send_cq$offset() {
        return send_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static MemorySegment send_cq(MemorySegment struct) {
        return struct.get(send_cq$LAYOUT, send_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static void send_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(send_cq$LAYOUT, send_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout recv_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final AddressLayout recv_cq$layout() {
        return recv_cq$LAYOUT;
    }

    private static final long recv_cq$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final long recv_cq$offset() {
        return recv_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static MemorySegment recv_cq(MemorySegment struct) {
        return struct.get(recv_cq$LAYOUT, recv_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static void recv_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(recv_cq$LAYOUT, recv_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout srq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final AddressLayout srq$layout() {
        return srq$LAYOUT;
    }

    private static final long srq$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final long srq$offset() {
        return srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static MemorySegment srq(MemorySegment struct) {
        return struct.get(srq$LAYOUT, srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static void srq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srq$LAYOUT, srq$OFFSET, fieldValue);
    }

    private static final GroupLayout cap$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static final GroupLayout cap$layout() {
        return cap$LAYOUT;
    }

    private static final long cap$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static final long cap$offset() {
        return cap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static MemorySegment cap(MemorySegment struct) {
        return struct.asSlice(cap$OFFSET, cap$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static void cap(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cap$OFFSET, cap$LAYOUT.byteSize());
    }

    private static final OfInt qp_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final OfInt qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static int qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, int fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    private static final OfInt sq_sig_all$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sq_sig_all"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static final OfInt sq_sig_all$layout() {
        return sq_sig_all$LAYOUT;
    }

    private static final long sq_sig_all$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static final long sq_sig_all$offset() {
        return sq_sig_all$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static int sq_sig_all(MemorySegment struct) {
        return struct.get(sq_sig_all$LAYOUT, sq_sig_all$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static void sq_sig_all(MemorySegment struct, int fieldValue) {
        struct.set(sq_sig_all$LAYOUT, sq_sig_all$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final AddressLayout xrcd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("xrcd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static final AddressLayout xrcd$layout() {
        return xrcd$LAYOUT;
    }

    private static final long xrcd$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static final long xrcd$offset() {
        return xrcd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static MemorySegment xrcd(MemorySegment struct) {
        return struct.get(xrcd$LAYOUT, xrcd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static void xrcd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(xrcd$LAYOUT, xrcd$OFFSET, fieldValue);
    }

    private static final OfInt create_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("create_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static final OfInt create_flags$layout() {
        return create_flags$LAYOUT;
    }

    private static final long create_flags$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static final long create_flags$offset() {
        return create_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static int create_flags(MemorySegment struct) {
        return struct.get(create_flags$LAYOUT, create_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static void create_flags(MemorySegment struct, int fieldValue) {
        struct.set(create_flags$LAYOUT, create_flags$OFFSET, fieldValue);
    }

    private static final OfShort max_tso_header$LAYOUT = (OfShort)$LAYOUT.select(groupElement("max_tso_header"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t max_tso_header
     * }
     */
    public static final OfShort max_tso_header$layout() {
        return max_tso_header$LAYOUT;
    }

    private static final long max_tso_header$OFFSET = 84;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t max_tso_header
     * }
     */
    public static final long max_tso_header$offset() {
        return max_tso_header$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t max_tso_header
     * }
     */
    public static short max_tso_header(MemorySegment struct) {
        return struct.get(max_tso_header$LAYOUT, max_tso_header$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t max_tso_header
     * }
     */
    public static void max_tso_header(MemorySegment struct, short fieldValue) {
        struct.set(max_tso_header$LAYOUT, max_tso_header$OFFSET, fieldValue);
    }

    private static final AddressLayout rwq_ind_tbl$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rwq_ind_tbl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_rwq_ind_table *rwq_ind_tbl
     * }
     */
    public static final AddressLayout rwq_ind_tbl$layout() {
        return rwq_ind_tbl$LAYOUT;
    }

    private static final long rwq_ind_tbl$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_rwq_ind_table *rwq_ind_tbl
     * }
     */
    public static final long rwq_ind_tbl$offset() {
        return rwq_ind_tbl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_rwq_ind_table *rwq_ind_tbl
     * }
     */
    public static MemorySegment rwq_ind_tbl(MemorySegment struct) {
        return struct.get(rwq_ind_tbl$LAYOUT, rwq_ind_tbl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_rwq_ind_table *rwq_ind_tbl
     * }
     */
    public static void rwq_ind_tbl(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rwq_ind_tbl$LAYOUT, rwq_ind_tbl$OFFSET, fieldValue);
    }

    private static final GroupLayout rx_hash_conf$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("rx_hash_conf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_rx_hash_conf rx_hash_conf
     * }
     */
    public static final GroupLayout rx_hash_conf$layout() {
        return rx_hash_conf$LAYOUT;
    }

    private static final long rx_hash_conf$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_rx_hash_conf rx_hash_conf
     * }
     */
    public static final long rx_hash_conf$offset() {
        return rx_hash_conf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_rx_hash_conf rx_hash_conf
     * }
     */
    public static MemorySegment rx_hash_conf(MemorySegment struct) {
        return struct.asSlice(rx_hash_conf$OFFSET, rx_hash_conf$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_rx_hash_conf rx_hash_conf
     * }
     */
    public static void rx_hash_conf(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, rx_hash_conf$OFFSET, rx_hash_conf$LAYOUT.byteSize());
    }

    private static final OfInt source_qpn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("source_qpn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t source_qpn
     * }
     */
    public static final OfInt source_qpn$layout() {
        return source_qpn$LAYOUT;
    }

    private static final long source_qpn$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t source_qpn
     * }
     */
    public static final long source_qpn$offset() {
        return source_qpn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t source_qpn
     * }
     */
    public static int source_qpn(MemorySegment struct) {
        return struct.get(source_qpn$LAYOUT, source_qpn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t source_qpn
     * }
     */
    public static void source_qpn(MemorySegment struct, int fieldValue) {
        struct.set(source_qpn$LAYOUT, source_qpn$OFFSET, fieldValue);
    }

    private static final OfLong send_ops_flags$LAYOUT = (OfLong)$LAYOUT.select(groupElement("send_ops_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t send_ops_flags
     * }
     */
    public static final OfLong send_ops_flags$layout() {
        return send_ops_flags$LAYOUT;
    }

    private static final long send_ops_flags$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t send_ops_flags
     * }
     */
    public static final long send_ops_flags$offset() {
        return send_ops_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t send_ops_flags
     * }
     */
    public static long send_ops_flags(MemorySegment struct) {
        return struct.get(send_ops_flags$LAYOUT, send_ops_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t send_ops_flags
     * }
     */
    public static void send_ops_flags(MemorySegment struct, long fieldValue) {
        struct.set(send_ops_flags$LAYOUT, send_ops_flags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

