// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_rwq_ind_table {
 *     struct ibv_context *context;
 *     int ind_tbl_handle;
 *     int ind_tbl_num;
 *     uint32_t comp_mask;
 * }
 * }
 */
public class ibv_rwq_ind_table {

    ibv_rwq_ind_table() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("context"),
        RdmaCm.C_INT.withName("ind_tbl_handle"),
        RdmaCm.C_INT.withName("ind_tbl_num"),
        RdmaCm.C_INT.withName("comp_mask"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_rwq_ind_table");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final AddressLayout context$layout() {
        return context$LAYOUT;
    }

    private static final long context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final long context$offset() {
        return context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static MemorySegment context(MemorySegment struct) {
        return struct.get(context$LAYOUT, context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static void context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(context$LAYOUT, context$OFFSET, fieldValue);
    }

    private static final OfInt ind_tbl_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ind_tbl_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int ind_tbl_handle
     * }
     */
    public static final OfInt ind_tbl_handle$layout() {
        return ind_tbl_handle$LAYOUT;
    }

    private static final long ind_tbl_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int ind_tbl_handle
     * }
     */
    public static final long ind_tbl_handle$offset() {
        return ind_tbl_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int ind_tbl_handle
     * }
     */
    public static int ind_tbl_handle(MemorySegment struct) {
        return struct.get(ind_tbl_handle$LAYOUT, ind_tbl_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int ind_tbl_handle
     * }
     */
    public static void ind_tbl_handle(MemorySegment struct, int fieldValue) {
        struct.set(ind_tbl_handle$LAYOUT, ind_tbl_handle$OFFSET, fieldValue);
    }

    private static final OfInt ind_tbl_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ind_tbl_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int ind_tbl_num
     * }
     */
    public static final OfInt ind_tbl_num$layout() {
        return ind_tbl_num$LAYOUT;
    }

    private static final long ind_tbl_num$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int ind_tbl_num
     * }
     */
    public static final long ind_tbl_num$offset() {
        return ind_tbl_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int ind_tbl_num
     * }
     */
    public static int ind_tbl_num(MemorySegment struct) {
        return struct.get(ind_tbl_num$LAYOUT, ind_tbl_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int ind_tbl_num
     * }
     */
    public static void ind_tbl_num(MemorySegment struct, int fieldValue) {
        struct.set(ind_tbl_num$LAYOUT, ind_tbl_num$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

