// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_srq {
 *     struct ibv_context *context;
 *     void *srq_context;
 *     struct ibv_pd *pd;
 *     uint32_t handle;
 *     pthread_mutex_t mutex;
 *     pthread_cond_t cond;
 *     uint32_t events_completed;
 * }
 * }
 */
public class ibv_srq {

    ibv_srq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("context"),
        RdmaCm.C_POINTER.withName("srq_context"),
        RdmaCm.C_POINTER.withName("pd"),
        RdmaCm.C_INT.withName("handle"),
        MemoryLayout.paddingLayout(4),
        pthread_mutex_t.layout().withName("mutex"),
        pthread_cond_t.layout().withName("cond"),
        RdmaCm.C_INT.withName("events_completed"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_srq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final AddressLayout context$layout() {
        return context$LAYOUT;
    }

    private static final long context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final long context$offset() {
        return context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static MemorySegment context(MemorySegment struct) {
        return struct.get(context$LAYOUT, context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static void context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(context$LAYOUT, context$OFFSET, fieldValue);
    }

    private static final AddressLayout srq_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static final AddressLayout srq_context$layout() {
        return srq_context$LAYOUT;
    }

    private static final long srq_context$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static final long srq_context$offset() {
        return srq_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static MemorySegment srq_context(MemorySegment struct) {
        return struct.get(srq_context$LAYOUT, srq_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static void srq_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srq_context$LAYOUT, srq_context$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final OfInt handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final OfInt handle$layout() {
        return handle$LAYOUT;
    }

    private static final long handle$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final long handle$offset() {
        return handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static int handle(MemorySegment struct) {
        return struct.get(handle$LAYOUT, handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static void handle(MemorySegment struct, int fieldValue) {
        struct.set(handle$LAYOUT, handle$OFFSET, fieldValue);
    }

    private static final GroupLayout mutex$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mutex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final GroupLayout mutex$layout() {
        return mutex$LAYOUT;
    }

    private static final long mutex$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final long mutex$offset() {
        return mutex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static MemorySegment mutex(MemorySegment struct) {
        return struct.asSlice(mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static void mutex(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    private static final GroupLayout cond$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cond"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final GroupLayout cond$layout() {
        return cond$LAYOUT;
    }

    private static final long cond$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final long cond$offset() {
        return cond$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static MemorySegment cond(MemorySegment struct) {
        return struct.asSlice(cond$OFFSET, cond$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static void cond(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cond$OFFSET, cond$LAYOUT.byteSize());
    }

    private static final OfInt events_completed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("events_completed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static final OfInt events_completed$layout() {
        return events_completed$LAYOUT;
    }

    private static final long events_completed$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static final long events_completed$offset() {
        return events_completed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static int events_completed(MemorySegment struct) {
        return struct.get(events_completed$LAYOUT, events_completed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static void events_completed(MemorySegment struct, int fieldValue) {
        struct.set(events_completed$LAYOUT, events_completed$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

