// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_path_record {
 *     __be64 service_id;
 *     union ibv_gid dgid;
 *     union ibv_gid sgid;
 *     __be16 dlid;
 *     __be16 slid;
 *     __be32 flowlabel_hoplimit;
 *     uint8_t tclass;
 *     uint8_t reversible_numpath;
 *     __be16 pkey;
 *     __be16 qosclass_sl;
 *     uint8_t mtu;
 *     uint8_t rate;
 *     uint8_t packetlifetime;
 *     uint8_t preference;
 *     uint8_t reserved[6];
 * }
 * }
 */
public class ibv_path_record {

    ibv_path_record() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_LONG_LONG.withName("service_id"),
        ibv_gid.layout().withName("dgid"),
        ibv_gid.layout().withName("sgid"),
        RdmaCm.C_SHORT.withName("dlid"),
        RdmaCm.C_SHORT.withName("slid"),
        RdmaCm.C_INT.withName("flowlabel_hoplimit"),
        RdmaCm.C_CHAR.withName("tclass"),
        RdmaCm.C_CHAR.withName("reversible_numpath"),
        RdmaCm.C_SHORT.withName("pkey"),
        RdmaCm.C_SHORT.withName("qosclass_sl"),
        RdmaCm.C_CHAR.withName("mtu"),
        RdmaCm.C_CHAR.withName("rate"),
        RdmaCm.C_CHAR.withName("packetlifetime"),
        RdmaCm.C_CHAR.withName("preference"),
        MemoryLayout.sequenceLayout(6, RdmaCm.C_CHAR).withName("reserved")
    ).withName("ibv_path_record");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong service_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("service_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be64 service_id
     * }
     */
    public static final OfLong service_id$layout() {
        return service_id$LAYOUT;
    }

    private static final long service_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be64 service_id
     * }
     */
    public static final long service_id$offset() {
        return service_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be64 service_id
     * }
     */
    public static long service_id(MemorySegment struct) {
        return struct.get(service_id$LAYOUT, service_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be64 service_id
     * }
     */
    public static void service_id(MemorySegment struct, long fieldValue) {
        struct.set(service_id$LAYOUT, service_id$OFFSET, fieldValue);
    }

    private static final GroupLayout dgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("dgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final GroupLayout dgid$layout() {
        return dgid$LAYOUT;
    }

    private static final long dgid$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final long dgid$offset() {
        return dgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static MemorySegment dgid(MemorySegment struct) {
        return struct.asSlice(dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static void dgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    private static final GroupLayout sgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("sgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static final GroupLayout sgid$layout() {
        return sgid$LAYOUT;
    }

    private static final long sgid$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static final long sgid$offset() {
        return sgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static MemorySegment sgid(MemorySegment struct) {
        return struct.asSlice(sgid$OFFSET, sgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static void sgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, sgid$OFFSET, sgid$LAYOUT.byteSize());
    }

    private static final OfShort dlid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("dlid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static final OfShort dlid$layout() {
        return dlid$LAYOUT;
    }

    private static final long dlid$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static final long dlid$offset() {
        return dlid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static short dlid(MemorySegment struct) {
        return struct.get(dlid$LAYOUT, dlid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static void dlid(MemorySegment struct, short fieldValue) {
        struct.set(dlid$LAYOUT, dlid$OFFSET, fieldValue);
    }

    private static final OfShort slid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("slid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static final OfShort slid$layout() {
        return slid$LAYOUT;
    }

    private static final long slid$OFFSET = 42;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static final long slid$offset() {
        return slid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static short slid(MemorySegment struct) {
        return struct.get(slid$LAYOUT, slid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static void slid(MemorySegment struct, short fieldValue) {
        struct.set(slid$LAYOUT, slid$OFFSET, fieldValue);
    }

    private static final OfInt flowlabel_hoplimit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flowlabel_hoplimit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be32 flowlabel_hoplimit
     * }
     */
    public static final OfInt flowlabel_hoplimit$layout() {
        return flowlabel_hoplimit$LAYOUT;
    }

    private static final long flowlabel_hoplimit$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be32 flowlabel_hoplimit
     * }
     */
    public static final long flowlabel_hoplimit$offset() {
        return flowlabel_hoplimit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be32 flowlabel_hoplimit
     * }
     */
    public static int flowlabel_hoplimit(MemorySegment struct) {
        return struct.get(flowlabel_hoplimit$LAYOUT, flowlabel_hoplimit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be32 flowlabel_hoplimit
     * }
     */
    public static void flowlabel_hoplimit(MemorySegment struct, int fieldValue) {
        struct.set(flowlabel_hoplimit$LAYOUT, flowlabel_hoplimit$OFFSET, fieldValue);
    }

    private static final OfByte tclass$LAYOUT = (OfByte)$LAYOUT.select(groupElement("tclass"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t tclass
     * }
     */
    public static final OfByte tclass$layout() {
        return tclass$LAYOUT;
    }

    private static final long tclass$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t tclass
     * }
     */
    public static final long tclass$offset() {
        return tclass$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t tclass
     * }
     */
    public static byte tclass(MemorySegment struct) {
        return struct.get(tclass$LAYOUT, tclass$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t tclass
     * }
     */
    public static void tclass(MemorySegment struct, byte fieldValue) {
        struct.set(tclass$LAYOUT, tclass$OFFSET, fieldValue);
    }

    private static final OfByte reversible_numpath$LAYOUT = (OfByte)$LAYOUT.select(groupElement("reversible_numpath"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t reversible_numpath
     * }
     */
    public static final OfByte reversible_numpath$layout() {
        return reversible_numpath$LAYOUT;
    }

    private static final long reversible_numpath$OFFSET = 49;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t reversible_numpath
     * }
     */
    public static final long reversible_numpath$offset() {
        return reversible_numpath$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t reversible_numpath
     * }
     */
    public static byte reversible_numpath(MemorySegment struct) {
        return struct.get(reversible_numpath$LAYOUT, reversible_numpath$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t reversible_numpath
     * }
     */
    public static void reversible_numpath(MemorySegment struct, byte fieldValue) {
        struct.set(reversible_numpath$LAYOUT, reversible_numpath$OFFSET, fieldValue);
    }

    private static final OfShort pkey$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static final OfShort pkey$layout() {
        return pkey$LAYOUT;
    }

    private static final long pkey$OFFSET = 50;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static final long pkey$offset() {
        return pkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static short pkey(MemorySegment struct) {
        return struct.get(pkey$LAYOUT, pkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static void pkey(MemorySegment struct, short fieldValue) {
        struct.set(pkey$LAYOUT, pkey$OFFSET, fieldValue);
    }

    private static final OfShort qosclass_sl$LAYOUT = (OfShort)$LAYOUT.select(groupElement("qosclass_sl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 qosclass_sl
     * }
     */
    public static final OfShort qosclass_sl$layout() {
        return qosclass_sl$LAYOUT;
    }

    private static final long qosclass_sl$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 qosclass_sl
     * }
     */
    public static final long qosclass_sl$offset() {
        return qosclass_sl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 qosclass_sl
     * }
     */
    public static short qosclass_sl(MemorySegment struct) {
        return struct.get(qosclass_sl$LAYOUT, qosclass_sl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 qosclass_sl
     * }
     */
    public static void qosclass_sl(MemorySegment struct, short fieldValue) {
        struct.set(qosclass_sl$LAYOUT, qosclass_sl$OFFSET, fieldValue);
    }

    private static final OfByte mtu$LAYOUT = (OfByte)$LAYOUT.select(groupElement("mtu"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static final OfByte mtu$layout() {
        return mtu$LAYOUT;
    }

    private static final long mtu$OFFSET = 54;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static final long mtu$offset() {
        return mtu$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static byte mtu(MemorySegment struct) {
        return struct.get(mtu$LAYOUT, mtu$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static void mtu(MemorySegment struct, byte fieldValue) {
        struct.set(mtu$LAYOUT, mtu$OFFSET, fieldValue);
    }

    private static final OfByte rate$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static final OfByte rate$layout() {
        return rate$LAYOUT;
    }

    private static final long rate$OFFSET = 55;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static final long rate$offset() {
        return rate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static byte rate(MemorySegment struct) {
        return struct.get(rate$LAYOUT, rate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static void rate(MemorySegment struct, byte fieldValue) {
        struct.set(rate$LAYOUT, rate$OFFSET, fieldValue);
    }

    private static final OfByte packetlifetime$LAYOUT = (OfByte)$LAYOUT.select(groupElement("packetlifetime"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t packetlifetime
     * }
     */
    public static final OfByte packetlifetime$layout() {
        return packetlifetime$LAYOUT;
    }

    private static final long packetlifetime$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t packetlifetime
     * }
     */
    public static final long packetlifetime$offset() {
        return packetlifetime$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t packetlifetime
     * }
     */
    public static byte packetlifetime(MemorySegment struct) {
        return struct.get(packetlifetime$LAYOUT, packetlifetime$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t packetlifetime
     * }
     */
    public static void packetlifetime(MemorySegment struct, byte fieldValue) {
        struct.set(packetlifetime$LAYOUT, packetlifetime$OFFSET, fieldValue);
    }

    private static final OfByte preference$LAYOUT = (OfByte)$LAYOUT.select(groupElement("preference"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static final OfByte preference$layout() {
        return preference$LAYOUT;
    }

    private static final long preference$OFFSET = 57;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static final long preference$offset() {
        return preference$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static byte preference(MemorySegment struct) {
        return struct.get(preference$LAYOUT, preference$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static void preference(MemorySegment struct, byte fieldValue) {
        struct.set(preference$LAYOUT, preference$OFFSET, fieldValue);
    }

    private static final SequenceLayout reserved$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static final SequenceLayout reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 58;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static MemorySegment reserved(MemorySegment struct) {
        return struct.asSlice(reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static void reserved(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    private static long[] reserved$DIMS = { 6 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static long[] reserved$dimensions() {
        return reserved$DIMS;
    }
    private static final VarHandle reserved$ELEM_HANDLE = reserved$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static byte reserved(MemorySegment struct, long index0) {
        return (byte)reserved$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t reserved[6]
     * }
     */
    public static void reserved(MemorySegment struct, long index0, byte fieldValue) {
        reserved$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

