// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_wq_init_attr {
 *     void *wq_context;
 *     enum ibv_wq_type wq_type;
 *     uint32_t max_wr;
 *     uint32_t max_sge;
 *     struct ibv_pd *pd;
 *     struct ibv_cq *cq;
 *     uint32_t comp_mask;
 *     uint32_t create_flags;
 * }
 * }
 */
public class ibv_wq_init_attr {

    ibv_wq_init_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("wq_context"),
        RdmaCm.C_INT.withName("wq_type"),
        RdmaCm.C_INT.withName("max_wr"),
        RdmaCm.C_INT.withName("max_sge"),
        MemoryLayout.paddingLayout(4),
        RdmaCm.C_POINTER.withName("pd"),
        RdmaCm.C_POINTER.withName("cq"),
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_INT.withName("create_flags")
    ).withName("ibv_wq_init_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout wq_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("wq_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static final AddressLayout wq_context$layout() {
        return wq_context$LAYOUT;
    }

    private static final long wq_context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static final long wq_context$offset() {
        return wq_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static MemorySegment wq_context(MemorySegment struct) {
        return struct.get(wq_context$LAYOUT, wq_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static void wq_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(wq_context$LAYOUT, wq_context$OFFSET, fieldValue);
    }

    private static final OfInt wq_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static final OfInt wq_type$layout() {
        return wq_type$LAYOUT;
    }

    private static final long wq_type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static final long wq_type$offset() {
        return wq_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static int wq_type(MemorySegment struct) {
        return struct.get(wq_type$LAYOUT, wq_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static void wq_type(MemorySegment struct, int fieldValue) {
        struct.set(wq_type$LAYOUT, wq_type$OFFSET, fieldValue);
    }

    private static final OfInt max_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_wr
     * }
     */
    public static final OfInt max_wr$layout() {
        return max_wr$LAYOUT;
    }

    private static final long max_wr$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_wr
     * }
     */
    public static final long max_wr$offset() {
        return max_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_wr
     * }
     */
    public static int max_wr(MemorySegment struct) {
        return struct.get(max_wr$LAYOUT, max_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_wr
     * }
     */
    public static void max_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_wr$LAYOUT, max_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static final OfInt max_sge$layout() {
        return max_sge$LAYOUT;
    }

    private static final long max_sge$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static final long max_sge$offset() {
        return max_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static int max_sge(MemorySegment struct) {
        return struct.get(max_sge$LAYOUT, max_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static void max_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_sge$LAYOUT, max_sge$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final AddressLayout cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static final AddressLayout cq$layout() {
        return cq$LAYOUT;
    }

    private static final long cq$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static final long cq$offset() {
        return cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static MemorySegment cq(MemorySegment struct) {
        return struct.get(cq$LAYOUT, cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static void cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cq$LAYOUT, cq$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt create_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("create_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static final OfInt create_flags$layout() {
        return create_flags$LAYOUT;
    }

    private static final long create_flags$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static final long create_flags$offset() {
        return create_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static int create_flags(MemorySegment struct) {
        return struct.get(create_flags$LAYOUT, create_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t create_flags
     * }
     */
    public static void create_flags(MemorySegment struct, int fieldValue) {
        struct.set(create_flags$LAYOUT, create_flags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

