// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_sa_path_rec {
 *     union ibv_gid dgid;
 *     union ibv_gid sgid;
 *     __be16 dlid;
 *     __be16 slid;
 *     int raw_traffic;
 *     __be32 flow_label;
 *     uint8_t hop_limit;
 *     uint8_t traffic_class;
 *     int reversible;
 *     uint8_t numb_path;
 *     __be16 pkey;
 *     uint8_t sl;
 *     uint8_t mtu_selector;
 *     uint8_t mtu;
 *     uint8_t rate_selector;
 *     uint8_t rate;
 *     uint8_t packet_life_time_selector;
 *     uint8_t packet_life_time;
 *     uint8_t preference;
 * }
 * }
 */
public class ibv_sa_path_rec {

    ibv_sa_path_rec() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ibv_gid.layout().withName("dgid"),
        ibv_gid.layout().withName("sgid"),
        RdmaCm.C_SHORT.withName("dlid"),
        RdmaCm.C_SHORT.withName("slid"),
        RdmaCm.C_INT.withName("raw_traffic"),
        RdmaCm.C_INT.withName("flow_label"),
        RdmaCm.C_CHAR.withName("hop_limit"),
        RdmaCm.C_CHAR.withName("traffic_class"),
        MemoryLayout.paddingLayout(2),
        RdmaCm.C_INT.withName("reversible"),
        RdmaCm.C_CHAR.withName("numb_path"),
        MemoryLayout.paddingLayout(1),
        RdmaCm.C_SHORT.withName("pkey"),
        RdmaCm.C_CHAR.withName("sl"),
        RdmaCm.C_CHAR.withName("mtu_selector"),
        RdmaCm.C_CHAR.withName("mtu"),
        RdmaCm.C_CHAR.withName("rate_selector"),
        RdmaCm.C_CHAR.withName("rate"),
        RdmaCm.C_CHAR.withName("packet_life_time_selector"),
        RdmaCm.C_CHAR.withName("packet_life_time"),
        RdmaCm.C_CHAR.withName("preference")
    ).withName("ibv_sa_path_rec");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout dgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("dgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final GroupLayout dgid$layout() {
        return dgid$LAYOUT;
    }

    private static final long dgid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final long dgid$offset() {
        return dgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static MemorySegment dgid(MemorySegment struct) {
        return struct.asSlice(dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static void dgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    private static final GroupLayout sgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("sgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static final GroupLayout sgid$layout() {
        return sgid$LAYOUT;
    }

    private static final long sgid$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static final long sgid$offset() {
        return sgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static MemorySegment sgid(MemorySegment struct) {
        return struct.asSlice(sgid$OFFSET, sgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static void sgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, sgid$OFFSET, sgid$LAYOUT.byteSize());
    }

    private static final OfShort dlid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("dlid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static final OfShort dlid$layout() {
        return dlid$LAYOUT;
    }

    private static final long dlid$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static final long dlid$offset() {
        return dlid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static short dlid(MemorySegment struct) {
        return struct.get(dlid$LAYOUT, dlid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 dlid
     * }
     */
    public static void dlid(MemorySegment struct, short fieldValue) {
        struct.set(dlid$LAYOUT, dlid$OFFSET, fieldValue);
    }

    private static final OfShort slid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("slid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static final OfShort slid$layout() {
        return slid$LAYOUT;
    }

    private static final long slid$OFFSET = 34;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static final long slid$offset() {
        return slid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static short slid(MemorySegment struct) {
        return struct.get(slid$LAYOUT, slid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 slid
     * }
     */
    public static void slid(MemorySegment struct, short fieldValue) {
        struct.set(slid$LAYOUT, slid$OFFSET, fieldValue);
    }

    private static final OfInt raw_traffic$LAYOUT = (OfInt)$LAYOUT.select(groupElement("raw_traffic"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int raw_traffic
     * }
     */
    public static final OfInt raw_traffic$layout() {
        return raw_traffic$LAYOUT;
    }

    private static final long raw_traffic$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int raw_traffic
     * }
     */
    public static final long raw_traffic$offset() {
        return raw_traffic$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int raw_traffic
     * }
     */
    public static int raw_traffic(MemorySegment struct) {
        return struct.get(raw_traffic$LAYOUT, raw_traffic$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int raw_traffic
     * }
     */
    public static void raw_traffic(MemorySegment struct, int fieldValue) {
        struct.set(raw_traffic$LAYOUT, raw_traffic$OFFSET, fieldValue);
    }

    private static final OfInt flow_label$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flow_label"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static final OfInt flow_label$layout() {
        return flow_label$LAYOUT;
    }

    private static final long flow_label$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static final long flow_label$offset() {
        return flow_label$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static int flow_label(MemorySegment struct) {
        return struct.get(flow_label$LAYOUT, flow_label$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be32 flow_label
     * }
     */
    public static void flow_label(MemorySegment struct, int fieldValue) {
        struct.set(flow_label$LAYOUT, flow_label$OFFSET, fieldValue);
    }

    private static final OfByte hop_limit$LAYOUT = (OfByte)$LAYOUT.select(groupElement("hop_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final OfByte hop_limit$layout() {
        return hop_limit$LAYOUT;
    }

    private static final long hop_limit$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final long hop_limit$offset() {
        return hop_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static byte hop_limit(MemorySegment struct) {
        return struct.get(hop_limit$LAYOUT, hop_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static void hop_limit(MemorySegment struct, byte fieldValue) {
        struct.set(hop_limit$LAYOUT, hop_limit$OFFSET, fieldValue);
    }

    private static final OfByte traffic_class$LAYOUT = (OfByte)$LAYOUT.select(groupElement("traffic_class"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static final OfByte traffic_class$layout() {
        return traffic_class$LAYOUT;
    }

    private static final long traffic_class$OFFSET = 45;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static final long traffic_class$offset() {
        return traffic_class$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static byte traffic_class(MemorySegment struct) {
        return struct.get(traffic_class$LAYOUT, traffic_class$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static void traffic_class(MemorySegment struct, byte fieldValue) {
        struct.set(traffic_class$LAYOUT, traffic_class$OFFSET, fieldValue);
    }

    private static final OfInt reversible$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reversible"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int reversible
     * }
     */
    public static final OfInt reversible$layout() {
        return reversible$LAYOUT;
    }

    private static final long reversible$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int reversible
     * }
     */
    public static final long reversible$offset() {
        return reversible$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int reversible
     * }
     */
    public static int reversible(MemorySegment struct) {
        return struct.get(reversible$LAYOUT, reversible$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int reversible
     * }
     */
    public static void reversible(MemorySegment struct, int fieldValue) {
        struct.set(reversible$LAYOUT, reversible$OFFSET, fieldValue);
    }

    private static final OfByte numb_path$LAYOUT = (OfByte)$LAYOUT.select(groupElement("numb_path"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t numb_path
     * }
     */
    public static final OfByte numb_path$layout() {
        return numb_path$LAYOUT;
    }

    private static final long numb_path$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t numb_path
     * }
     */
    public static final long numb_path$offset() {
        return numb_path$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t numb_path
     * }
     */
    public static byte numb_path(MemorySegment struct) {
        return struct.get(numb_path$LAYOUT, numb_path$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t numb_path
     * }
     */
    public static void numb_path(MemorySegment struct, byte fieldValue) {
        struct.set(numb_path$LAYOUT, numb_path$OFFSET, fieldValue);
    }

    private static final OfShort pkey$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static final OfShort pkey$layout() {
        return pkey$LAYOUT;
    }

    private static final long pkey$OFFSET = 54;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static final long pkey$offset() {
        return pkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static short pkey(MemorySegment struct) {
        return struct.get(pkey$LAYOUT, pkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 pkey
     * }
     */
    public static void pkey(MemorySegment struct, short fieldValue) {
        struct.set(pkey$LAYOUT, pkey$OFFSET, fieldValue);
    }

    private static final OfByte sl$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static final OfByte sl$layout() {
        return sl$LAYOUT;
    }

    private static final long sl$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static final long sl$offset() {
        return sl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static byte sl(MemorySegment struct) {
        return struct.get(sl$LAYOUT, sl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static void sl(MemorySegment struct, byte fieldValue) {
        struct.set(sl$LAYOUT, sl$OFFSET, fieldValue);
    }

    private static final OfByte mtu_selector$LAYOUT = (OfByte)$LAYOUT.select(groupElement("mtu_selector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static final OfByte mtu_selector$layout() {
        return mtu_selector$LAYOUT;
    }

    private static final long mtu_selector$OFFSET = 57;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static final long mtu_selector$offset() {
        return mtu_selector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static byte mtu_selector(MemorySegment struct) {
        return struct.get(mtu_selector$LAYOUT, mtu_selector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static void mtu_selector(MemorySegment struct, byte fieldValue) {
        struct.set(mtu_selector$LAYOUT, mtu_selector$OFFSET, fieldValue);
    }

    private static final OfByte mtu$LAYOUT = (OfByte)$LAYOUT.select(groupElement("mtu"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static final OfByte mtu$layout() {
        return mtu$LAYOUT;
    }

    private static final long mtu$OFFSET = 58;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static final long mtu$offset() {
        return mtu$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static byte mtu(MemorySegment struct) {
        return struct.get(mtu$LAYOUT, mtu$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static void mtu(MemorySegment struct, byte fieldValue) {
        struct.set(mtu$LAYOUT, mtu$OFFSET, fieldValue);
    }

    private static final OfByte rate_selector$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rate_selector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static final OfByte rate_selector$layout() {
        return rate_selector$LAYOUT;
    }

    private static final long rate_selector$OFFSET = 59;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static final long rate_selector$offset() {
        return rate_selector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static byte rate_selector(MemorySegment struct) {
        return struct.get(rate_selector$LAYOUT, rate_selector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static void rate_selector(MemorySegment struct, byte fieldValue) {
        struct.set(rate_selector$LAYOUT, rate_selector$OFFSET, fieldValue);
    }

    private static final OfByte rate$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static final OfByte rate$layout() {
        return rate$LAYOUT;
    }

    private static final long rate$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static final long rate$offset() {
        return rate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static byte rate(MemorySegment struct) {
        return struct.get(rate$LAYOUT, rate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static void rate(MemorySegment struct, byte fieldValue) {
        struct.set(rate$LAYOUT, rate$OFFSET, fieldValue);
    }

    private static final OfByte packet_life_time_selector$LAYOUT = (OfByte)$LAYOUT.select(groupElement("packet_life_time_selector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static final OfByte packet_life_time_selector$layout() {
        return packet_life_time_selector$LAYOUT;
    }

    private static final long packet_life_time_selector$OFFSET = 61;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static final long packet_life_time_selector$offset() {
        return packet_life_time_selector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static byte packet_life_time_selector(MemorySegment struct) {
        return struct.get(packet_life_time_selector$LAYOUT, packet_life_time_selector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static void packet_life_time_selector(MemorySegment struct, byte fieldValue) {
        struct.set(packet_life_time_selector$LAYOUT, packet_life_time_selector$OFFSET, fieldValue);
    }

    private static final OfByte packet_life_time$LAYOUT = (OfByte)$LAYOUT.select(groupElement("packet_life_time"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static final OfByte packet_life_time$layout() {
        return packet_life_time$LAYOUT;
    }

    private static final long packet_life_time$OFFSET = 62;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static final long packet_life_time$offset() {
        return packet_life_time$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static byte packet_life_time(MemorySegment struct) {
        return struct.get(packet_life_time$LAYOUT, packet_life_time$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static void packet_life_time(MemorySegment struct, byte fieldValue) {
        struct.set(packet_life_time$LAYOUT, packet_life_time$OFFSET, fieldValue);
    }

    private static final OfByte preference$LAYOUT = (OfByte)$LAYOUT.select(groupElement("preference"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static final OfByte preference$layout() {
        return preference$LAYOUT;
    }

    private static final long preference$OFFSET = 63;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static final long preference$offset() {
        return preference$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static byte preference(MemorySegment struct) {
        return struct.get(preference$LAYOUT, preference$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t preference
     * }
     */
    public static void preference(MemorySegment struct, byte fieldValue) {
        struct.set(preference$LAYOUT, preference$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

