// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_wq {
 *     struct ibv_context *context;
 *     void *wq_context;
 *     struct ibv_pd *pd;
 *     struct ibv_cq *cq;
 *     uint32_t wq_num;
 *     uint32_t handle;
 *     enum ibv_wq_state state;
 *     enum ibv_wq_type wq_type;
 *     int (*post_recv)(struct ibv_wq *, struct ibv_recv_wr *, struct ibv_recv_wr **);
 *     pthread_mutex_t mutex;
 *     pthread_cond_t cond;
 *     uint32_t events_completed;
 *     uint32_t comp_mask;
 * }
 * }
 */
public class ibv_wq {

    ibv_wq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("context"),
        RdmaCm.C_POINTER.withName("wq_context"),
        RdmaCm.C_POINTER.withName("pd"),
        RdmaCm.C_POINTER.withName("cq"),
        RdmaCm.C_INT.withName("wq_num"),
        RdmaCm.C_INT.withName("handle"),
        RdmaCm.C_INT.withName("state"),
        RdmaCm.C_INT.withName("wq_type"),
        RdmaCm.C_POINTER.withName("post_recv"),
        pthread_mutex_t.layout().withName("mutex"),
        pthread_cond_t.layout().withName("cond"),
        RdmaCm.C_INT.withName("events_completed"),
        RdmaCm.C_INT.withName("comp_mask")
    ).withName("ibv_wq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final AddressLayout context$layout() {
        return context$LAYOUT;
    }

    private static final long context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final long context$offset() {
        return context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static MemorySegment context(MemorySegment struct) {
        return struct.get(context$LAYOUT, context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static void context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(context$LAYOUT, context$OFFSET, fieldValue);
    }

    private static final AddressLayout wq_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("wq_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static final AddressLayout wq_context$layout() {
        return wq_context$LAYOUT;
    }

    private static final long wq_context$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static final long wq_context$offset() {
        return wq_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static MemorySegment wq_context(MemorySegment struct) {
        return struct.get(wq_context$LAYOUT, wq_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *wq_context
     * }
     */
    public static void wq_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(wq_context$LAYOUT, wq_context$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final AddressLayout cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static final AddressLayout cq$layout() {
        return cq$LAYOUT;
    }

    private static final long cq$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static final long cq$offset() {
        return cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static MemorySegment cq(MemorySegment struct) {
        return struct.get(cq$LAYOUT, cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static void cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cq$LAYOUT, cq$OFFSET, fieldValue);
    }

    private static final OfInt wq_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t wq_num
     * }
     */
    public static final OfInt wq_num$layout() {
        return wq_num$LAYOUT;
    }

    private static final long wq_num$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t wq_num
     * }
     */
    public static final long wq_num$offset() {
        return wq_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t wq_num
     * }
     */
    public static int wq_num(MemorySegment struct) {
        return struct.get(wq_num$LAYOUT, wq_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t wq_num
     * }
     */
    public static void wq_num(MemorySegment struct, int fieldValue) {
        struct.set(wq_num$LAYOUT, wq_num$OFFSET, fieldValue);
    }

    private static final OfInt handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final OfInt handle$layout() {
        return handle$LAYOUT;
    }

    private static final long handle$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final long handle$offset() {
        return handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static int handle(MemorySegment struct) {
        return struct.get(handle$LAYOUT, handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static void handle(MemorySegment struct, int fieldValue) {
        struct.set(handle$LAYOUT, handle$OFFSET, fieldValue);
    }

    private static final OfInt state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_wq_state state
     * }
     */
    public static final OfInt state$layout() {
        return state$LAYOUT;
    }

    private static final long state$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_wq_state state
     * }
     */
    public static final long state$offset() {
        return state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_wq_state state
     * }
     */
    public static int state(MemorySegment struct) {
        return struct.get(state$LAYOUT, state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_wq_state state
     * }
     */
    public static void state(MemorySegment struct, int fieldValue) {
        struct.set(state$LAYOUT, state$OFFSET, fieldValue);
    }

    private static final OfInt wq_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static final OfInt wq_type$layout() {
        return wq_type$LAYOUT;
    }

    private static final long wq_type$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static final long wq_type$offset() {
        return wq_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static int wq_type(MemorySegment struct) {
        return struct.get(wq_type$LAYOUT, wq_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_wq_type wq_type
     * }
     */
    public static void wq_type(MemorySegment struct, int fieldValue) {
        struct.set(wq_type$LAYOUT, wq_type$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * int (*post_recv)(struct ibv_wq *, struct ibv_recv_wr *, struct ibv_recv_wr **)
     * }
     */
    public static class post_recv {

        post_recv() {
            // Should not be called directly
        }

        /**
         * The function pointer signature, expressed as a functional interface
         */
        public interface Function {
            int apply(MemorySegment _x0, MemorySegment _x1, MemorySegment _x2);
        }

        private static final FunctionDescriptor $DESC = FunctionDescriptor.of(
            RdmaCm.C_INT,
            RdmaCm.C_POINTER,
            RdmaCm.C_POINTER,
            RdmaCm.C_POINTER
        );

        /**
         * The descriptor of this function pointer
         */
        public static FunctionDescriptor descriptor() {
            return $DESC;
        }

        private static final MethodHandle UP$MH = RdmaCm.upcallHandle(post_recv.Function.class, "apply", $DESC);

        /**
         * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
         * The lifetime of the returned segment is managed by {@code arena}
         */
        public static MemorySegment allocate(post_recv.Function fi, Arena arena) {
            return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
        }

        private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

        /**
         * Invoke the upcall stub {@code funcPtr}, with given parameters
         */
        public static int invoke(MemorySegment funcPtr,MemorySegment _x0, MemorySegment _x1, MemorySegment _x2) {
            try {
                return (int) DOWN$MH.invokeExact(funcPtr, _x0, _x1, _x2);
            } catch (Throwable ex$) {
                throw new AssertionError("should not reach here", ex$);
            }
        }
    }

    private static final AddressLayout post_recv$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("post_recv"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int (*post_recv)(struct ibv_wq *, struct ibv_recv_wr *, struct ibv_recv_wr **)
     * }
     */
    public static final AddressLayout post_recv$layout() {
        return post_recv$LAYOUT;
    }

    private static final long post_recv$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int (*post_recv)(struct ibv_wq *, struct ibv_recv_wr *, struct ibv_recv_wr **)
     * }
     */
    public static final long post_recv$offset() {
        return post_recv$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int (*post_recv)(struct ibv_wq *, struct ibv_recv_wr *, struct ibv_recv_wr **)
     * }
     */
    public static MemorySegment post_recv(MemorySegment struct) {
        return struct.get(post_recv$LAYOUT, post_recv$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int (*post_recv)(struct ibv_wq *, struct ibv_recv_wr *, struct ibv_recv_wr **)
     * }
     */
    public static void post_recv(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(post_recv$LAYOUT, post_recv$OFFSET, fieldValue);
    }

    private static final GroupLayout mutex$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mutex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final GroupLayout mutex$layout() {
        return mutex$LAYOUT;
    }

    private static final long mutex$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final long mutex$offset() {
        return mutex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static MemorySegment mutex(MemorySegment struct) {
        return struct.asSlice(mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static void mutex(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    private static final GroupLayout cond$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cond"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final GroupLayout cond$layout() {
        return cond$LAYOUT;
    }

    private static final long cond$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final long cond$offset() {
        return cond$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static MemorySegment cond(MemorySegment struct) {
        return struct.asSlice(cond$OFFSET, cond$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static void cond(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cond$OFFSET, cond$LAYOUT.byteSize());
    }

    private static final OfInt events_completed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("events_completed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static final OfInt events_completed$layout() {
        return events_completed$LAYOUT;
    }

    private static final long events_completed$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static final long events_completed$offset() {
        return events_completed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static int events_completed(MemorySegment struct) {
        return struct.get(events_completed$LAYOUT, events_completed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static void events_completed(MemorySegment struct, int fieldValue) {
        struct.set(events_completed$LAYOUT, events_completed$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 148;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

