// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_sa_service_rec {
 *     uint64_t id;
 *     union ibv_gid gid;
 *     uint16_t pkey;
 *     uint32_t lease;
 *     uint8_t key[16];
 *     uint8_t name[64];
 *     uint8_t data8[16];
 *     uint16_t data16[8];
 *     uint32_t data32[4];
 *     uint64_t data64[2];
 * }
 * }
 */
public class ibv_sa_service_rec {

    ibv_sa_service_rec() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_LONG.withName("id"),
        ibv_gid.layout().withName("gid"),
        RdmaCm.C_SHORT.withName("pkey"),
        MemoryLayout.paddingLayout(2),
        RdmaCm.C_INT.withName("lease"),
        MemoryLayout.sequenceLayout(16, RdmaCm.C_CHAR).withName("key"),
        MemoryLayout.sequenceLayout(64, RdmaCm.C_CHAR).withName("name"),
        MemoryLayout.sequenceLayout(16, RdmaCm.C_CHAR).withName("data8"),
        MemoryLayout.sequenceLayout(8, RdmaCm.C_SHORT).withName("data16"),
        MemoryLayout.sequenceLayout(4, RdmaCm.C_INT).withName("data32"),
        MemoryLayout.sequenceLayout(2, RdmaCm.C_LONG).withName("data64")
    ).withName("ibv_sa_service_rec");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t id
     * }
     */
    public static final OfLong id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t id
     * }
     */
    public static long id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t id
     * }
     */
    public static void id(MemorySegment struct, long fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final GroupLayout gid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("gid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid gid
     * }
     */
    public static final GroupLayout gid$layout() {
        return gid$LAYOUT;
    }

    private static final long gid$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid gid
     * }
     */
    public static final long gid$offset() {
        return gid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid gid
     * }
     */
    public static MemorySegment gid(MemorySegment struct) {
        return struct.asSlice(gid$OFFSET, gid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid gid
     * }
     */
    public static void gid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, gid$OFFSET, gid$LAYOUT.byteSize());
    }

    private static final OfShort pkey$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static final OfShort pkey$layout() {
        return pkey$LAYOUT;
    }

    private static final long pkey$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static final long pkey$offset() {
        return pkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static short pkey(MemorySegment struct) {
        return struct.get(pkey$LAYOUT, pkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static void pkey(MemorySegment struct, short fieldValue) {
        struct.set(pkey$LAYOUT, pkey$OFFSET, fieldValue);
    }

    private static final OfInt lease$LAYOUT = (OfInt)$LAYOUT.select(groupElement("lease"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t lease
     * }
     */
    public static final OfInt lease$layout() {
        return lease$LAYOUT;
    }

    private static final long lease$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t lease
     * }
     */
    public static final long lease$offset() {
        return lease$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t lease
     * }
     */
    public static int lease(MemorySegment struct) {
        return struct.get(lease$LAYOUT, lease$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t lease
     * }
     */
    public static void lease(MemorySegment struct, int fieldValue) {
        struct.set(lease$LAYOUT, lease$OFFSET, fieldValue);
    }

    private static final SequenceLayout key$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("key"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static final SequenceLayout key$layout() {
        return key$LAYOUT;
    }

    private static final long key$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static final long key$offset() {
        return key$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static MemorySegment key(MemorySegment struct) {
        return struct.asSlice(key$OFFSET, key$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static void key(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, key$OFFSET, key$LAYOUT.byteSize());
    }

    private static long[] key$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static long[] key$dimensions() {
        return key$DIMS;
    }
    private static final VarHandle key$ELEM_HANDLE = key$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static byte key(MemorySegment struct, long index0) {
        return (byte)key$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t key[16]
     * }
     */
    public static void key(MemorySegment struct, long index0, byte fieldValue) {
        key$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout name$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static final SequenceLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.asSlice(name$OFFSET, name$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, name$OFFSET, name$LAYOUT.byteSize());
    }

    private static long[] name$DIMS = { 64 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static long[] name$dimensions() {
        return name$DIMS;
    }
    private static final VarHandle name$ELEM_HANDLE = name$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static byte name(MemorySegment struct, long index0) {
        return (byte)name$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t name[64]
     * }
     */
    public static void name(MemorySegment struct, long index0, byte fieldValue) {
        name$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout data8$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("data8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static final SequenceLayout data8$layout() {
        return data8$LAYOUT;
    }

    private static final long data8$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static final long data8$offset() {
        return data8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static MemorySegment data8(MemorySegment struct) {
        return struct.asSlice(data8$OFFSET, data8$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static void data8(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, data8$OFFSET, data8$LAYOUT.byteSize());
    }

    private static long[] data8$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static long[] data8$dimensions() {
        return data8$DIMS;
    }
    private static final VarHandle data8$ELEM_HANDLE = data8$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static byte data8(MemorySegment struct, long index0) {
        return (byte)data8$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t data8[16]
     * }
     */
    public static void data8(MemorySegment struct, long index0, byte fieldValue) {
        data8$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout data16$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("data16"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static final SequenceLayout data16$layout() {
        return data16$LAYOUT;
    }

    private static final long data16$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static final long data16$offset() {
        return data16$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static MemorySegment data16(MemorySegment struct) {
        return struct.asSlice(data16$OFFSET, data16$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static void data16(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, data16$OFFSET, data16$LAYOUT.byteSize());
    }

    private static long[] data16$DIMS = { 8 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static long[] data16$dimensions() {
        return data16$DIMS;
    }
    private static final VarHandle data16$ELEM_HANDLE = data16$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static short data16(MemorySegment struct, long index0) {
        return (short)data16$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint16_t data16[8]
     * }
     */
    public static void data16(MemorySegment struct, long index0, short fieldValue) {
        data16$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout data32$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("data32"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static final SequenceLayout data32$layout() {
        return data32$LAYOUT;
    }

    private static final long data32$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static final long data32$offset() {
        return data32$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static MemorySegment data32(MemorySegment struct) {
        return struct.asSlice(data32$OFFSET, data32$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static void data32(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, data32$OFFSET, data32$LAYOUT.byteSize());
    }

    private static long[] data32$DIMS = { 4 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static long[] data32$dimensions() {
        return data32$DIMS;
    }
    private static final VarHandle data32$ELEM_HANDLE = data32$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static int data32(MemorySegment struct, long index0) {
        return (int)data32$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint32_t data32[4]
     * }
     */
    public static void data32(MemorySegment struct, long index0, int fieldValue) {
        data32$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout data64$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("data64"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static final SequenceLayout data64$layout() {
        return data64$LAYOUT;
    }

    private static final long data64$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static final long data64$offset() {
        return data64$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static MemorySegment data64(MemorySegment struct) {
        return struct.asSlice(data64$OFFSET, data64$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static void data64(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, data64$OFFSET, data64$LAYOUT.byteSize());
    }

    private static long[] data64$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static long[] data64$dimensions() {
        return data64$DIMS;
    }
    private static final VarHandle data64$ELEM_HANDLE = data64$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static long data64(MemorySegment struct, long index0) {
        return (long)data64$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint64_t data64[2]
     * }
     */
    public static void data64(MemorySegment struct, long index0, long fieldValue) {
        data64$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

