// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_sa_mcmember_rec {
 *     union ibv_gid mgid;
 *     union ibv_gid port_gid;
 *     uint32_t qkey;
 *     uint16_t mlid;
 *     uint8_t mtu_selector;
 *     uint8_t mtu;
 *     uint8_t traffic_class;
 *     uint16_t pkey;
 *     uint8_t rate_selector;
 *     uint8_t rate;
 *     uint8_t packet_life_time_selector;
 *     uint8_t packet_life_time;
 *     uint8_t sl;
 *     uint32_t flow_label;
 *     uint8_t hop_limit;
 *     uint8_t scope;
 *     uint8_t join_state;
 *     int proxy_join;
 * }
 * }
 */
public class ibv_sa_mcmember_rec {

    ibv_sa_mcmember_rec() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ibv_gid.layout().withName("mgid"),
        ibv_gid.layout().withName("port_gid"),
        RdmaCm.C_INT.withName("qkey"),
        RdmaCm.C_SHORT.withName("mlid"),
        RdmaCm.C_CHAR.withName("mtu_selector"),
        RdmaCm.C_CHAR.withName("mtu"),
        RdmaCm.C_CHAR.withName("traffic_class"),
        MemoryLayout.paddingLayout(1),
        RdmaCm.C_SHORT.withName("pkey"),
        RdmaCm.C_CHAR.withName("rate_selector"),
        RdmaCm.C_CHAR.withName("rate"),
        RdmaCm.C_CHAR.withName("packet_life_time_selector"),
        RdmaCm.C_CHAR.withName("packet_life_time"),
        RdmaCm.C_CHAR.withName("sl"),
        MemoryLayout.paddingLayout(3),
        RdmaCm.C_INT.withName("flow_label"),
        RdmaCm.C_CHAR.withName("hop_limit"),
        RdmaCm.C_CHAR.withName("scope"),
        RdmaCm.C_CHAR.withName("join_state"),
        MemoryLayout.paddingLayout(1),
        RdmaCm.C_INT.withName("proxy_join")
    ).withName("ibv_sa_mcmember_rec");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout mgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid mgid
     * }
     */
    public static final GroupLayout mgid$layout() {
        return mgid$LAYOUT;
    }

    private static final long mgid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid mgid
     * }
     */
    public static final long mgid$offset() {
        return mgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid mgid
     * }
     */
    public static MemorySegment mgid(MemorySegment struct) {
        return struct.asSlice(mgid$OFFSET, mgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid mgid
     * }
     */
    public static void mgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mgid$OFFSET, mgid$LAYOUT.byteSize());
    }

    private static final GroupLayout port_gid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("port_gid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid port_gid
     * }
     */
    public static final GroupLayout port_gid$layout() {
        return port_gid$LAYOUT;
    }

    private static final long port_gid$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid port_gid
     * }
     */
    public static final long port_gid$offset() {
        return port_gid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid port_gid
     * }
     */
    public static MemorySegment port_gid(MemorySegment struct) {
        return struct.asSlice(port_gid$OFFSET, port_gid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid port_gid
     * }
     */
    public static void port_gid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, port_gid$OFFSET, port_gid$LAYOUT.byteSize());
    }

    private static final OfInt qkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static final OfInt qkey$layout() {
        return qkey$LAYOUT;
    }

    private static final long qkey$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static final long qkey$offset() {
        return qkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static int qkey(MemorySegment struct) {
        return struct.get(qkey$LAYOUT, qkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static void qkey(MemorySegment struct, int fieldValue) {
        struct.set(qkey$LAYOUT, qkey$OFFSET, fieldValue);
    }

    private static final OfShort mlid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("mlid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t mlid
     * }
     */
    public static final OfShort mlid$layout() {
        return mlid$LAYOUT;
    }

    private static final long mlid$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t mlid
     * }
     */
    public static final long mlid$offset() {
        return mlid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t mlid
     * }
     */
    public static short mlid(MemorySegment struct) {
        return struct.get(mlid$LAYOUT, mlid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t mlid
     * }
     */
    public static void mlid(MemorySegment struct, short fieldValue) {
        struct.set(mlid$LAYOUT, mlid$OFFSET, fieldValue);
    }

    private static final OfByte mtu_selector$LAYOUT = (OfByte)$LAYOUT.select(groupElement("mtu_selector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static final OfByte mtu_selector$layout() {
        return mtu_selector$LAYOUT;
    }

    private static final long mtu_selector$OFFSET = 38;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static final long mtu_selector$offset() {
        return mtu_selector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static byte mtu_selector(MemorySegment struct) {
        return struct.get(mtu_selector$LAYOUT, mtu_selector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t mtu_selector
     * }
     */
    public static void mtu_selector(MemorySegment struct, byte fieldValue) {
        struct.set(mtu_selector$LAYOUT, mtu_selector$OFFSET, fieldValue);
    }

    private static final OfByte mtu$LAYOUT = (OfByte)$LAYOUT.select(groupElement("mtu"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static final OfByte mtu$layout() {
        return mtu$LAYOUT;
    }

    private static final long mtu$OFFSET = 39;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static final long mtu$offset() {
        return mtu$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static byte mtu(MemorySegment struct) {
        return struct.get(mtu$LAYOUT, mtu$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t mtu
     * }
     */
    public static void mtu(MemorySegment struct, byte fieldValue) {
        struct.set(mtu$LAYOUT, mtu$OFFSET, fieldValue);
    }

    private static final OfByte traffic_class$LAYOUT = (OfByte)$LAYOUT.select(groupElement("traffic_class"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static final OfByte traffic_class$layout() {
        return traffic_class$LAYOUT;
    }

    private static final long traffic_class$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static final long traffic_class$offset() {
        return traffic_class$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static byte traffic_class(MemorySegment struct) {
        return struct.get(traffic_class$LAYOUT, traffic_class$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static void traffic_class(MemorySegment struct, byte fieldValue) {
        struct.set(traffic_class$LAYOUT, traffic_class$OFFSET, fieldValue);
    }

    private static final OfShort pkey$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static final OfShort pkey$layout() {
        return pkey$LAYOUT;
    }

    private static final long pkey$OFFSET = 42;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static final long pkey$offset() {
        return pkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static short pkey(MemorySegment struct) {
        return struct.get(pkey$LAYOUT, pkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t pkey
     * }
     */
    public static void pkey(MemorySegment struct, short fieldValue) {
        struct.set(pkey$LAYOUT, pkey$OFFSET, fieldValue);
    }

    private static final OfByte rate_selector$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rate_selector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static final OfByte rate_selector$layout() {
        return rate_selector$LAYOUT;
    }

    private static final long rate_selector$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static final long rate_selector$offset() {
        return rate_selector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static byte rate_selector(MemorySegment struct) {
        return struct.get(rate_selector$LAYOUT, rate_selector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rate_selector
     * }
     */
    public static void rate_selector(MemorySegment struct, byte fieldValue) {
        struct.set(rate_selector$LAYOUT, rate_selector$OFFSET, fieldValue);
    }

    private static final OfByte rate$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static final OfByte rate$layout() {
        return rate$LAYOUT;
    }

    private static final long rate$OFFSET = 45;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static final long rate$offset() {
        return rate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static byte rate(MemorySegment struct) {
        return struct.get(rate$LAYOUT, rate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rate
     * }
     */
    public static void rate(MemorySegment struct, byte fieldValue) {
        struct.set(rate$LAYOUT, rate$OFFSET, fieldValue);
    }

    private static final OfByte packet_life_time_selector$LAYOUT = (OfByte)$LAYOUT.select(groupElement("packet_life_time_selector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static final OfByte packet_life_time_selector$layout() {
        return packet_life_time_selector$LAYOUT;
    }

    private static final long packet_life_time_selector$OFFSET = 46;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static final long packet_life_time_selector$offset() {
        return packet_life_time_selector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static byte packet_life_time_selector(MemorySegment struct) {
        return struct.get(packet_life_time_selector$LAYOUT, packet_life_time_selector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time_selector
     * }
     */
    public static void packet_life_time_selector(MemorySegment struct, byte fieldValue) {
        struct.set(packet_life_time_selector$LAYOUT, packet_life_time_selector$OFFSET, fieldValue);
    }

    private static final OfByte packet_life_time$LAYOUT = (OfByte)$LAYOUT.select(groupElement("packet_life_time"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static final OfByte packet_life_time$layout() {
        return packet_life_time$LAYOUT;
    }

    private static final long packet_life_time$OFFSET = 47;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static final long packet_life_time$offset() {
        return packet_life_time$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static byte packet_life_time(MemorySegment struct) {
        return struct.get(packet_life_time$LAYOUT, packet_life_time$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t packet_life_time
     * }
     */
    public static void packet_life_time(MemorySegment struct, byte fieldValue) {
        struct.set(packet_life_time$LAYOUT, packet_life_time$OFFSET, fieldValue);
    }

    private static final OfByte sl$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static final OfByte sl$layout() {
        return sl$LAYOUT;
    }

    private static final long sl$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static final long sl$offset() {
        return sl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static byte sl(MemorySegment struct) {
        return struct.get(sl$LAYOUT, sl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static void sl(MemorySegment struct, byte fieldValue) {
        struct.set(sl$LAYOUT, sl$OFFSET, fieldValue);
    }

    private static final OfInt flow_label$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flow_label"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static final OfInt flow_label$layout() {
        return flow_label$LAYOUT;
    }

    private static final long flow_label$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static final long flow_label$offset() {
        return flow_label$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static int flow_label(MemorySegment struct) {
        return struct.get(flow_label$LAYOUT, flow_label$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static void flow_label(MemorySegment struct, int fieldValue) {
        struct.set(flow_label$LAYOUT, flow_label$OFFSET, fieldValue);
    }

    private static final OfByte hop_limit$LAYOUT = (OfByte)$LAYOUT.select(groupElement("hop_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final OfByte hop_limit$layout() {
        return hop_limit$LAYOUT;
    }

    private static final long hop_limit$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final long hop_limit$offset() {
        return hop_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static byte hop_limit(MemorySegment struct) {
        return struct.get(hop_limit$LAYOUT, hop_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static void hop_limit(MemorySegment struct, byte fieldValue) {
        struct.set(hop_limit$LAYOUT, hop_limit$OFFSET, fieldValue);
    }

    private static final OfByte scope$LAYOUT = (OfByte)$LAYOUT.select(groupElement("scope"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t scope
     * }
     */
    public static final OfByte scope$layout() {
        return scope$LAYOUT;
    }

    private static final long scope$OFFSET = 57;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t scope
     * }
     */
    public static final long scope$offset() {
        return scope$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t scope
     * }
     */
    public static byte scope(MemorySegment struct) {
        return struct.get(scope$LAYOUT, scope$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t scope
     * }
     */
    public static void scope(MemorySegment struct, byte fieldValue) {
        struct.set(scope$LAYOUT, scope$OFFSET, fieldValue);
    }

    private static final OfByte join_state$LAYOUT = (OfByte)$LAYOUT.select(groupElement("join_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t join_state
     * }
     */
    public static final OfByte join_state$layout() {
        return join_state$LAYOUT;
    }

    private static final long join_state$OFFSET = 58;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t join_state
     * }
     */
    public static final long join_state$offset() {
        return join_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t join_state
     * }
     */
    public static byte join_state(MemorySegment struct) {
        return struct.get(join_state$LAYOUT, join_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t join_state
     * }
     */
    public static void join_state(MemorySegment struct, byte fieldValue) {
        struct.set(join_state$LAYOUT, join_state$OFFSET, fieldValue);
    }

    private static final OfInt proxy_join$LAYOUT = (OfInt)$LAYOUT.select(groupElement("proxy_join"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int proxy_join
     * }
     */
    public static final OfInt proxy_join$layout() {
        return proxy_join$LAYOUT;
    }

    private static final long proxy_join$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int proxy_join
     * }
     */
    public static final long proxy_join$offset() {
        return proxy_join$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int proxy_join
     * }
     */
    public static int proxy_join(MemorySegment struct) {
        return struct.get(proxy_join$LAYOUT, proxy_join$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int proxy_join
     * }
     */
    public static void proxy_join(MemorySegment struct, int fieldValue) {
        struct.set(proxy_join$LAYOUT, proxy_join$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

