// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_async_event {
 *     union {
 *         struct ibv_cq *cq;
 *         struct ibv_qp *qp;
 *         struct ibv_srq *srq;
 *         struct ibv_wq *wq;
 *         int port_num;
 *     } element;
 *     enum ibv_event_type event_type;
 * }
 * }
 */
public class ibv_async_event {

    ibv_async_event() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ibv_async_event.element.layout().withName("element"),
        RdmaCm.C_INT.withName("event_type"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_async_event");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    /**
     * {@snippet lang=c :
     * union {
     *     struct ibv_cq *cq;
     *     struct ibv_qp *qp;
     *     struct ibv_srq *srq;
     *     struct ibv_wq *wq;
     *     int port_num;
     * }
     * }
     */
    public static class element {

        element() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            RdmaCm.C_POINTER.withName("cq"),
            RdmaCm.C_POINTER.withName("qp"),
            RdmaCm.C_POINTER.withName("srq"),
            RdmaCm.C_POINTER.withName("wq"),
            RdmaCm.C_INT.withName("port_num")
        ).withName("$anon$473:2");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final AddressLayout cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cq"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct ibv_cq *cq
         * }
         */
        public static final AddressLayout cq$layout() {
            return cq$LAYOUT;
        }

        private static final long cq$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct ibv_cq *cq
         * }
         */
        public static final long cq$offset() {
            return cq$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct ibv_cq *cq
         * }
         */
        public static MemorySegment cq(MemorySegment union) {
            return union.get(cq$LAYOUT, cq$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct ibv_cq *cq
         * }
         */
        public static void cq(MemorySegment union, MemorySegment fieldValue) {
            union.set(cq$LAYOUT, cq$OFFSET, fieldValue);
        }

        private static final AddressLayout qp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("qp"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct ibv_qp *qp
         * }
         */
        public static final AddressLayout qp$layout() {
            return qp$LAYOUT;
        }

        private static final long qp$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct ibv_qp *qp
         * }
         */
        public static final long qp$offset() {
            return qp$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct ibv_qp *qp
         * }
         */
        public static MemorySegment qp(MemorySegment union) {
            return union.get(qp$LAYOUT, qp$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct ibv_qp *qp
         * }
         */
        public static void qp(MemorySegment union, MemorySegment fieldValue) {
            union.set(qp$LAYOUT, qp$OFFSET, fieldValue);
        }

        private static final AddressLayout srq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct ibv_srq *srq
         * }
         */
        public static final AddressLayout srq$layout() {
            return srq$LAYOUT;
        }

        private static final long srq$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct ibv_srq *srq
         * }
         */
        public static final long srq$offset() {
            return srq$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct ibv_srq *srq
         * }
         */
        public static MemorySegment srq(MemorySegment union) {
            return union.get(srq$LAYOUT, srq$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct ibv_srq *srq
         * }
         */
        public static void srq(MemorySegment union, MemorySegment fieldValue) {
            union.set(srq$LAYOUT, srq$OFFSET, fieldValue);
        }

        private static final AddressLayout wq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("wq"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct ibv_wq *wq
         * }
         */
        public static final AddressLayout wq$layout() {
            return wq$LAYOUT;
        }

        private static final long wq$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct ibv_wq *wq
         * }
         */
        public static final long wq$offset() {
            return wq$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct ibv_wq *wq
         * }
         */
        public static MemorySegment wq(MemorySegment union) {
            return union.get(wq$LAYOUT, wq$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct ibv_wq *wq
         * }
         */
        public static void wq(MemorySegment union, MemorySegment fieldValue) {
            union.set(wq$LAYOUT, wq$OFFSET, fieldValue);
        }

        private static final OfInt port_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("port_num"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * int port_num
         * }
         */
        public static final OfInt port_num$layout() {
            return port_num$LAYOUT;
        }

        private static final long port_num$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * int port_num
         * }
         */
        public static final long port_num$offset() {
            return port_num$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * int port_num
         * }
         */
        public static int port_num(MemorySegment union) {
            return union.get(port_num$LAYOUT, port_num$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * int port_num
         * }
         */
        public static void port_num(MemorySegment union, int fieldValue) {
            union.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout element$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("element"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     struct ibv_cq *cq;
     *     struct ibv_qp *qp;
     *     struct ibv_srq *srq;
     *     struct ibv_wq *wq;
     *     int port_num;
     * } element
     * }
     */
    public static final GroupLayout element$layout() {
        return element$LAYOUT;
    }

    private static final long element$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     struct ibv_cq *cq;
     *     struct ibv_qp *qp;
     *     struct ibv_srq *srq;
     *     struct ibv_wq *wq;
     *     int port_num;
     * } element
     * }
     */
    public static final long element$offset() {
        return element$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     struct ibv_cq *cq;
     *     struct ibv_qp *qp;
     *     struct ibv_srq *srq;
     *     struct ibv_wq *wq;
     *     int port_num;
     * } element
     * }
     */
    public static MemorySegment element(MemorySegment struct) {
        return struct.asSlice(element$OFFSET, element$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     struct ibv_cq *cq;
     *     struct ibv_qp *qp;
     *     struct ibv_srq *srq;
     *     struct ibv_wq *wq;
     *     int port_num;
     * } element
     * }
     */
    public static void element(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, element$OFFSET, element$LAYOUT.byteSize());
    }

    private static final OfInt event_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("event_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_event_type event_type
     * }
     */
    public static final OfInt event_type$layout() {
        return event_type$LAYOUT;
    }

    private static final long event_type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_event_type event_type
     * }
     */
    public static final long event_type$offset() {
        return event_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_event_type event_type
     * }
     */
    public static int event_type(MemorySegment struct) {
        return struct.get(event_type$LAYOUT, event_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_event_type event_type
     * }
     */
    public static void event_type(MemorySegment struct, int fieldValue) {
        struct.set(event_type$LAYOUT, event_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

