// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_flow_action_esp_attr {
 *     struct ib_uverbs_flow_action_esp *esp_attr;
 *     enum ib_uverbs_flow_action_esp_keymat keymat_proto;
 *     uint16_t keymat_len;
 *     void *keymat_ptr;
 *     enum ib_uverbs_flow_action_esp_replay replay_proto;
 *     uint16_t replay_len;
 *     void *replay_ptr;
 *     struct ib_uverbs_flow_action_esp_encap *esp_encap;
 *     uint32_t comp_mask;
 *     uint32_t esn;
 * }
 * }
 */
public class ibv_flow_action_esp_attr {

    ibv_flow_action_esp_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("esp_attr"),
        RdmaCm.C_INT.withName("keymat_proto"),
        RdmaCm.C_SHORT.withName("keymat_len"),
        MemoryLayout.paddingLayout(2),
        RdmaCm.C_POINTER.withName("keymat_ptr"),
        RdmaCm.C_INT.withName("replay_proto"),
        RdmaCm.C_SHORT.withName("replay_len"),
        MemoryLayout.paddingLayout(2),
        RdmaCm.C_POINTER.withName("replay_ptr"),
        RdmaCm.C_POINTER.withName("esp_encap"),
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_INT.withName("esn")
    ).withName("ibv_flow_action_esp_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout esp_attr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("esp_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp *esp_attr
     * }
     */
    public static final AddressLayout esp_attr$layout() {
        return esp_attr$LAYOUT;
    }

    private static final long esp_attr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp *esp_attr
     * }
     */
    public static final long esp_attr$offset() {
        return esp_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp *esp_attr
     * }
     */
    public static MemorySegment esp_attr(MemorySegment struct) {
        return struct.get(esp_attr$LAYOUT, esp_attr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp *esp_attr
     * }
     */
    public static void esp_attr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(esp_attr$LAYOUT, esp_attr$OFFSET, fieldValue);
    }

    private static final OfInt keymat_proto$LAYOUT = (OfInt)$LAYOUT.select(groupElement("keymat_proto"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_keymat keymat_proto
     * }
     */
    public static final OfInt keymat_proto$layout() {
        return keymat_proto$LAYOUT;
    }

    private static final long keymat_proto$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_keymat keymat_proto
     * }
     */
    public static final long keymat_proto$offset() {
        return keymat_proto$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_keymat keymat_proto
     * }
     */
    public static int keymat_proto(MemorySegment struct) {
        return struct.get(keymat_proto$LAYOUT, keymat_proto$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_keymat keymat_proto
     * }
     */
    public static void keymat_proto(MemorySegment struct, int fieldValue) {
        struct.set(keymat_proto$LAYOUT, keymat_proto$OFFSET, fieldValue);
    }

    private static final OfShort keymat_len$LAYOUT = (OfShort)$LAYOUT.select(groupElement("keymat_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t keymat_len
     * }
     */
    public static final OfShort keymat_len$layout() {
        return keymat_len$LAYOUT;
    }

    private static final long keymat_len$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t keymat_len
     * }
     */
    public static final long keymat_len$offset() {
        return keymat_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t keymat_len
     * }
     */
    public static short keymat_len(MemorySegment struct) {
        return struct.get(keymat_len$LAYOUT, keymat_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t keymat_len
     * }
     */
    public static void keymat_len(MemorySegment struct, short fieldValue) {
        struct.set(keymat_len$LAYOUT, keymat_len$OFFSET, fieldValue);
    }

    private static final AddressLayout keymat_ptr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("keymat_ptr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *keymat_ptr
     * }
     */
    public static final AddressLayout keymat_ptr$layout() {
        return keymat_ptr$LAYOUT;
    }

    private static final long keymat_ptr$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *keymat_ptr
     * }
     */
    public static final long keymat_ptr$offset() {
        return keymat_ptr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *keymat_ptr
     * }
     */
    public static MemorySegment keymat_ptr(MemorySegment struct) {
        return struct.get(keymat_ptr$LAYOUT, keymat_ptr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *keymat_ptr
     * }
     */
    public static void keymat_ptr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(keymat_ptr$LAYOUT, keymat_ptr$OFFSET, fieldValue);
    }

    private static final OfInt replay_proto$LAYOUT = (OfInt)$LAYOUT.select(groupElement("replay_proto"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_replay replay_proto
     * }
     */
    public static final OfInt replay_proto$layout() {
        return replay_proto$LAYOUT;
    }

    private static final long replay_proto$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_replay replay_proto
     * }
     */
    public static final long replay_proto$offset() {
        return replay_proto$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_replay replay_proto
     * }
     */
    public static int replay_proto(MemorySegment struct) {
        return struct.get(replay_proto$LAYOUT, replay_proto$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ib_uverbs_flow_action_esp_replay replay_proto
     * }
     */
    public static void replay_proto(MemorySegment struct, int fieldValue) {
        struct.set(replay_proto$LAYOUT, replay_proto$OFFSET, fieldValue);
    }

    private static final OfShort replay_len$LAYOUT = (OfShort)$LAYOUT.select(groupElement("replay_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t replay_len
     * }
     */
    public static final OfShort replay_len$layout() {
        return replay_len$LAYOUT;
    }

    private static final long replay_len$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t replay_len
     * }
     */
    public static final long replay_len$offset() {
        return replay_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t replay_len
     * }
     */
    public static short replay_len(MemorySegment struct) {
        return struct.get(replay_len$LAYOUT, replay_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t replay_len
     * }
     */
    public static void replay_len(MemorySegment struct, short fieldValue) {
        struct.set(replay_len$LAYOUT, replay_len$OFFSET, fieldValue);
    }

    private static final AddressLayout replay_ptr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("replay_ptr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *replay_ptr
     * }
     */
    public static final AddressLayout replay_ptr$layout() {
        return replay_ptr$LAYOUT;
    }

    private static final long replay_ptr$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *replay_ptr
     * }
     */
    public static final long replay_ptr$offset() {
        return replay_ptr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *replay_ptr
     * }
     */
    public static MemorySegment replay_ptr(MemorySegment struct) {
        return struct.get(replay_ptr$LAYOUT, replay_ptr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *replay_ptr
     * }
     */
    public static void replay_ptr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(replay_ptr$LAYOUT, replay_ptr$OFFSET, fieldValue);
    }

    private static final AddressLayout esp_encap$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("esp_encap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *esp_encap
     * }
     */
    public static final AddressLayout esp_encap$layout() {
        return esp_encap$LAYOUT;
    }

    private static final long esp_encap$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *esp_encap
     * }
     */
    public static final long esp_encap$offset() {
        return esp_encap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *esp_encap
     * }
     */
    public static MemorySegment esp_encap(MemorySegment struct) {
        return struct.get(esp_encap$LAYOUT, esp_encap$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_action_esp_encap *esp_encap
     * }
     */
    public static void esp_encap(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(esp_encap$LAYOUT, esp_encap$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt esn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("esn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t esn
     * }
     */
    public static final OfInt esn$layout() {
        return esn$LAYOUT;
    }

    private static final long esn$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t esn
     * }
     */
    public static final long esn$offset() {
        return esn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t esn
     * }
     */
    public static int esn(MemorySegment struct) {
        return struct.get(esn$LAYOUT, esn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t esn
     * }
     */
    public static void esn(MemorySegment struct, int fieldValue) {
        struct.set(esn$LAYOUT, esn$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

