// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_cq_init_attr_ex {
 *     uint32_t cqe;
 *     void *cq_context;
 *     struct ibv_comp_channel *channel;
 *     uint32_t comp_vector;
 *     uint64_t wc_flags;
 *     uint32_t comp_mask;
 *     uint32_t flags;
 *     struct ibv_pd *parent_domain;
 * }
 * }
 */
public class ibv_cq_init_attr_ex {

    ibv_cq_init_attr_ex() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("cqe"),
        MemoryLayout.paddingLayout(4),
        RdmaCm.C_POINTER.withName("cq_context"),
        RdmaCm.C_POINTER.withName("channel"),
        RdmaCm.C_INT.withName("comp_vector"),
        MemoryLayout.paddingLayout(4),
        RdmaCm.C_LONG.withName("wc_flags"),
        RdmaCm.C_INT.withName("comp_mask"),
        RdmaCm.C_INT.withName("flags"),
        RdmaCm.C_POINTER.withName("parent_domain")
    ).withName("ibv_cq_init_attr_ex");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cqe$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cqe"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t cqe
     * }
     */
    public static final OfInt cqe$layout() {
        return cqe$LAYOUT;
    }

    private static final long cqe$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t cqe
     * }
     */
    public static final long cqe$offset() {
        return cqe$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t cqe
     * }
     */
    public static int cqe(MemorySegment struct) {
        return struct.get(cqe$LAYOUT, cqe$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t cqe
     * }
     */
    public static void cqe(MemorySegment struct, int fieldValue) {
        struct.set(cqe$LAYOUT, cqe$OFFSET, fieldValue);
    }

    private static final AddressLayout cq_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cq_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static final AddressLayout cq_context$layout() {
        return cq_context$LAYOUT;
    }

    private static final long cq_context$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static final long cq_context$offset() {
        return cq_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static MemorySegment cq_context(MemorySegment struct) {
        return struct.get(cq_context$LAYOUT, cq_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static void cq_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cq_context$LAYOUT, cq_context$OFFSET, fieldValue);
    }

    private static final AddressLayout channel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("channel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static final AddressLayout channel$layout() {
        return channel$LAYOUT;
    }

    private static final long channel$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static final long channel$offset() {
        return channel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static MemorySegment channel(MemorySegment struct) {
        return struct.get(channel$LAYOUT, channel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static void channel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(channel$LAYOUT, channel$OFFSET, fieldValue);
    }

    private static final OfInt comp_vector$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_vector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_vector
     * }
     */
    public static final OfInt comp_vector$layout() {
        return comp_vector$LAYOUT;
    }

    private static final long comp_vector$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_vector
     * }
     */
    public static final long comp_vector$offset() {
        return comp_vector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_vector
     * }
     */
    public static int comp_vector(MemorySegment struct) {
        return struct.get(comp_vector$LAYOUT, comp_vector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_vector
     * }
     */
    public static void comp_vector(MemorySegment struct, int fieldValue) {
        struct.set(comp_vector$LAYOUT, comp_vector$OFFSET, fieldValue);
    }

    private static final OfLong wc_flags$LAYOUT = (OfLong)$LAYOUT.select(groupElement("wc_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t wc_flags
     * }
     */
    public static final OfLong wc_flags$layout() {
        return wc_flags$LAYOUT;
    }

    private static final long wc_flags$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t wc_flags
     * }
     */
    public static final long wc_flags$offset() {
        return wc_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t wc_flags
     * }
     */
    public static long wc_flags(MemorySegment struct) {
        return struct.get(wc_flags$LAYOUT, wc_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t wc_flags
     * }
     */
    public static void wc_flags(MemorySegment struct, long fieldValue) {
        struct.set(wc_flags$LAYOUT, wc_flags$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final AddressLayout parent_domain$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("parent_domain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *parent_domain
     * }
     */
    public static final AddressLayout parent_domain$layout() {
        return parent_domain$LAYOUT;
    }

    private static final long parent_domain$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *parent_domain
     * }
     */
    public static final long parent_domain$offset() {
        return parent_domain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *parent_domain
     * }
     */
    public static MemorySegment parent_domain(MemorySegment struct) {
        return struct.get(parent_domain$LAYOUT, parent_domain$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *parent_domain
     * }
     */
    public static void parent_domain(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(parent_domain$LAYOUT, parent_domain$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

