// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_qp_init_attr {
 *     void *qp_context;
 *     struct ibv_cq *send_cq;
 *     struct ibv_cq *recv_cq;
 *     struct ibv_srq *srq;
 *     struct ibv_qp_cap cap;
 *     enum ibv_qp_type qp_type;
 *     int sq_sig_all;
 * }
 * }
 */
public class ibv_qp_init_attr {

    ibv_qp_init_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("qp_context"),
        RdmaCm.C_POINTER.withName("send_cq"),
        RdmaCm.C_POINTER.withName("recv_cq"),
        RdmaCm.C_POINTER.withName("srq"),
        ibv_qp_cap.layout().withName("cap"),
        RdmaCm.C_INT.withName("qp_type"),
        RdmaCm.C_INT.withName("sq_sig_all"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_qp_init_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout qp_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("qp_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final AddressLayout qp_context$layout() {
        return qp_context$LAYOUT;
    }

    private static final long qp_context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final long qp_context$offset() {
        return qp_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static MemorySegment qp_context(MemorySegment struct) {
        return struct.get(qp_context$LAYOUT, qp_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static void qp_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(qp_context$LAYOUT, qp_context$OFFSET, fieldValue);
    }

    private static final AddressLayout send_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("send_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final AddressLayout send_cq$layout() {
        return send_cq$LAYOUT;
    }

    private static final long send_cq$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final long send_cq$offset() {
        return send_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static MemorySegment send_cq(MemorySegment struct) {
        return struct.get(send_cq$LAYOUT, send_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static void send_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(send_cq$LAYOUT, send_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout recv_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final AddressLayout recv_cq$layout() {
        return recv_cq$LAYOUT;
    }

    private static final long recv_cq$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final long recv_cq$offset() {
        return recv_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static MemorySegment recv_cq(MemorySegment struct) {
        return struct.get(recv_cq$LAYOUT, recv_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static void recv_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(recv_cq$LAYOUT, recv_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout srq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final AddressLayout srq$layout() {
        return srq$LAYOUT;
    }

    private static final long srq$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final long srq$offset() {
        return srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static MemorySegment srq(MemorySegment struct) {
        return struct.get(srq$LAYOUT, srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static void srq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srq$LAYOUT, srq$OFFSET, fieldValue);
    }

    private static final GroupLayout cap$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static final GroupLayout cap$layout() {
        return cap$LAYOUT;
    }

    private static final long cap$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static final long cap$offset() {
        return cap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static MemorySegment cap(MemorySegment struct) {
        return struct.asSlice(cap$OFFSET, cap$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static void cap(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cap$OFFSET, cap$LAYOUT.byteSize());
    }

    private static final OfInt qp_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final OfInt qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static int qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, int fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    private static final OfInt sq_sig_all$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sq_sig_all"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static final OfInt sq_sig_all$layout() {
        return sq_sig_all$LAYOUT;
    }

    private static final long sq_sig_all$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static final long sq_sig_all$offset() {
        return sq_sig_all$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static int sq_sig_all(MemorySegment struct) {
        return struct.get(sq_sig_all$LAYOUT, sq_sig_all$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int sq_sig_all
     * }
     */
    public static void sq_sig_all(MemorySegment struct, int fieldValue) {
        struct.set(sq_sig_all$LAYOUT, sq_sig_all$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

