// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_device_attr_ex {
 *     struct ibv_device_attr orig_attr;
 *     uint32_t comp_mask;
 *     struct ibv_odp_caps odp_caps;
 *     uint64_t completion_timestamp_mask;
 *     uint64_t hca_core_clock;
 *     uint64_t device_cap_flags_ex;
 *     struct ibv_tso_caps tso_caps;
 *     struct ibv_rss_caps rss_caps;
 *     uint32_t max_wq_type_rq;
 *     struct ibv_packet_pacing_caps packet_pacing_caps;
 *     uint32_t raw_packet_caps;
 *     struct ibv_tm_caps tm_caps;
 *     struct ibv_cq_moderation_caps cq_mod_caps;
 *     uint64_t max_dm_size;
 *     struct ibv_pci_atomic_caps pci_atomic_caps;
 *     uint32_t xrc_odp_caps;
 *     uint32_t phys_port_cnt_ex;
 * }
 * }
 */
public class ibv_device_attr_ex {

    ibv_device_attr_ex() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ibv_device_attr.layout().withName("orig_attr"),
        RdmaCm.C_INT.withName("comp_mask"),
        MemoryLayout.paddingLayout(4),
        ibv_odp_caps.layout().withName("odp_caps"),
        RdmaCm.C_LONG.withName("completion_timestamp_mask"),
        RdmaCm.C_LONG.withName("hca_core_clock"),
        RdmaCm.C_LONG.withName("device_cap_flags_ex"),
        ibv_tso_caps.layout().withName("tso_caps"),
        ibv_rss_caps.layout().withName("rss_caps"),
        RdmaCm.C_INT.withName("max_wq_type_rq"),
        ibv_packet_pacing_caps.layout().withName("packet_pacing_caps"),
        RdmaCm.C_INT.withName("raw_packet_caps"),
        ibv_tm_caps.layout().withName("tm_caps"),
        ibv_cq_moderation_caps.layout().withName("cq_mod_caps"),
        MemoryLayout.paddingLayout(4),
        RdmaCm.C_LONG.withName("max_dm_size"),
        ibv_pci_atomic_caps.layout().withName("pci_atomic_caps"),
        MemoryLayout.paddingLayout(2),
        RdmaCm.C_INT.withName("xrc_odp_caps"),
        RdmaCm.C_INT.withName("phys_port_cnt_ex")
    ).withName("ibv_device_attr_ex");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout orig_attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("orig_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_device_attr orig_attr
     * }
     */
    public static final GroupLayout orig_attr$layout() {
        return orig_attr$LAYOUT;
    }

    private static final long orig_attr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_device_attr orig_attr
     * }
     */
    public static final long orig_attr$offset() {
        return orig_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_device_attr orig_attr
     * }
     */
    public static MemorySegment orig_attr(MemorySegment struct) {
        return struct.asSlice(orig_attr$OFFSET, orig_attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_device_attr orig_attr
     * }
     */
    public static void orig_attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, orig_attr$OFFSET, orig_attr$LAYOUT.byteSize());
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 232;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final GroupLayout odp_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("odp_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_odp_caps odp_caps
     * }
     */
    public static final GroupLayout odp_caps$layout() {
        return odp_caps$LAYOUT;
    }

    private static final long odp_caps$OFFSET = 240;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_odp_caps odp_caps
     * }
     */
    public static final long odp_caps$offset() {
        return odp_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_odp_caps odp_caps
     * }
     */
    public static MemorySegment odp_caps(MemorySegment struct) {
        return struct.asSlice(odp_caps$OFFSET, odp_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_odp_caps odp_caps
     * }
     */
    public static void odp_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, odp_caps$OFFSET, odp_caps$LAYOUT.byteSize());
    }

    private static final OfLong completion_timestamp_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("completion_timestamp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t completion_timestamp_mask
     * }
     */
    public static final OfLong completion_timestamp_mask$layout() {
        return completion_timestamp_mask$LAYOUT;
    }

    private static final long completion_timestamp_mask$OFFSET = 264;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t completion_timestamp_mask
     * }
     */
    public static final long completion_timestamp_mask$offset() {
        return completion_timestamp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t completion_timestamp_mask
     * }
     */
    public static long completion_timestamp_mask(MemorySegment struct) {
        return struct.get(completion_timestamp_mask$LAYOUT, completion_timestamp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t completion_timestamp_mask
     * }
     */
    public static void completion_timestamp_mask(MemorySegment struct, long fieldValue) {
        struct.set(completion_timestamp_mask$LAYOUT, completion_timestamp_mask$OFFSET, fieldValue);
    }

    private static final OfLong hca_core_clock$LAYOUT = (OfLong)$LAYOUT.select(groupElement("hca_core_clock"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t hca_core_clock
     * }
     */
    public static final OfLong hca_core_clock$layout() {
        return hca_core_clock$LAYOUT;
    }

    private static final long hca_core_clock$OFFSET = 272;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t hca_core_clock
     * }
     */
    public static final long hca_core_clock$offset() {
        return hca_core_clock$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t hca_core_clock
     * }
     */
    public static long hca_core_clock(MemorySegment struct) {
        return struct.get(hca_core_clock$LAYOUT, hca_core_clock$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t hca_core_clock
     * }
     */
    public static void hca_core_clock(MemorySegment struct, long fieldValue) {
        struct.set(hca_core_clock$LAYOUT, hca_core_clock$OFFSET, fieldValue);
    }

    private static final OfLong device_cap_flags_ex$LAYOUT = (OfLong)$LAYOUT.select(groupElement("device_cap_flags_ex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t device_cap_flags_ex
     * }
     */
    public static final OfLong device_cap_flags_ex$layout() {
        return device_cap_flags_ex$LAYOUT;
    }

    private static final long device_cap_flags_ex$OFFSET = 280;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t device_cap_flags_ex
     * }
     */
    public static final long device_cap_flags_ex$offset() {
        return device_cap_flags_ex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t device_cap_flags_ex
     * }
     */
    public static long device_cap_flags_ex(MemorySegment struct) {
        return struct.get(device_cap_flags_ex$LAYOUT, device_cap_flags_ex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t device_cap_flags_ex
     * }
     */
    public static void device_cap_flags_ex(MemorySegment struct, long fieldValue) {
        struct.set(device_cap_flags_ex$LAYOUT, device_cap_flags_ex$OFFSET, fieldValue);
    }

    private static final GroupLayout tso_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("tso_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_tso_caps tso_caps
     * }
     */
    public static final GroupLayout tso_caps$layout() {
        return tso_caps$LAYOUT;
    }

    private static final long tso_caps$OFFSET = 288;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_tso_caps tso_caps
     * }
     */
    public static final long tso_caps$offset() {
        return tso_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_tso_caps tso_caps
     * }
     */
    public static MemorySegment tso_caps(MemorySegment struct) {
        return struct.asSlice(tso_caps$OFFSET, tso_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_tso_caps tso_caps
     * }
     */
    public static void tso_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tso_caps$OFFSET, tso_caps$LAYOUT.byteSize());
    }

    private static final GroupLayout rss_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("rss_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_rss_caps rss_caps
     * }
     */
    public static final GroupLayout rss_caps$layout() {
        return rss_caps$LAYOUT;
    }

    private static final long rss_caps$OFFSET = 296;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_rss_caps rss_caps
     * }
     */
    public static final long rss_caps$offset() {
        return rss_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_rss_caps rss_caps
     * }
     */
    public static MemorySegment rss_caps(MemorySegment struct) {
        return struct.asSlice(rss_caps$OFFSET, rss_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_rss_caps rss_caps
     * }
     */
    public static void rss_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, rss_caps$OFFSET, rss_caps$LAYOUT.byteSize());
    }

    private static final OfInt max_wq_type_rq$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wq_type_rq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_wq_type_rq
     * }
     */
    public static final OfInt max_wq_type_rq$layout() {
        return max_wq_type_rq$LAYOUT;
    }

    private static final long max_wq_type_rq$OFFSET = 328;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_wq_type_rq
     * }
     */
    public static final long max_wq_type_rq$offset() {
        return max_wq_type_rq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_wq_type_rq
     * }
     */
    public static int max_wq_type_rq(MemorySegment struct) {
        return struct.get(max_wq_type_rq$LAYOUT, max_wq_type_rq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_wq_type_rq
     * }
     */
    public static void max_wq_type_rq(MemorySegment struct, int fieldValue) {
        struct.set(max_wq_type_rq$LAYOUT, max_wq_type_rq$OFFSET, fieldValue);
    }

    private static final GroupLayout packet_pacing_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("packet_pacing_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_packet_pacing_caps packet_pacing_caps
     * }
     */
    public static final GroupLayout packet_pacing_caps$layout() {
        return packet_pacing_caps$LAYOUT;
    }

    private static final long packet_pacing_caps$OFFSET = 332;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_packet_pacing_caps packet_pacing_caps
     * }
     */
    public static final long packet_pacing_caps$offset() {
        return packet_pacing_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_packet_pacing_caps packet_pacing_caps
     * }
     */
    public static MemorySegment packet_pacing_caps(MemorySegment struct) {
        return struct.asSlice(packet_pacing_caps$OFFSET, packet_pacing_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_packet_pacing_caps packet_pacing_caps
     * }
     */
    public static void packet_pacing_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, packet_pacing_caps$OFFSET, packet_pacing_caps$LAYOUT.byteSize());
    }

    private static final OfInt raw_packet_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("raw_packet_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t raw_packet_caps
     * }
     */
    public static final OfInt raw_packet_caps$layout() {
        return raw_packet_caps$LAYOUT;
    }

    private static final long raw_packet_caps$OFFSET = 344;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t raw_packet_caps
     * }
     */
    public static final long raw_packet_caps$offset() {
        return raw_packet_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t raw_packet_caps
     * }
     */
    public static int raw_packet_caps(MemorySegment struct) {
        return struct.get(raw_packet_caps$LAYOUT, raw_packet_caps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t raw_packet_caps
     * }
     */
    public static void raw_packet_caps(MemorySegment struct, int fieldValue) {
        struct.set(raw_packet_caps$LAYOUT, raw_packet_caps$OFFSET, fieldValue);
    }

    private static final GroupLayout tm_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("tm_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_tm_caps tm_caps
     * }
     */
    public static final GroupLayout tm_caps$layout() {
        return tm_caps$LAYOUT;
    }

    private static final long tm_caps$OFFSET = 348;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_tm_caps tm_caps
     * }
     */
    public static final long tm_caps$offset() {
        return tm_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_tm_caps tm_caps
     * }
     */
    public static MemorySegment tm_caps(MemorySegment struct) {
        return struct.asSlice(tm_caps$OFFSET, tm_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_tm_caps tm_caps
     * }
     */
    public static void tm_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tm_caps$OFFSET, tm_caps$LAYOUT.byteSize());
    }

    private static final GroupLayout cq_mod_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cq_mod_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq_moderation_caps cq_mod_caps
     * }
     */
    public static final GroupLayout cq_mod_caps$layout() {
        return cq_mod_caps$LAYOUT;
    }

    private static final long cq_mod_caps$OFFSET = 368;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq_moderation_caps cq_mod_caps
     * }
     */
    public static final long cq_mod_caps$offset() {
        return cq_mod_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq_moderation_caps cq_mod_caps
     * }
     */
    public static MemorySegment cq_mod_caps(MemorySegment struct) {
        return struct.asSlice(cq_mod_caps$OFFSET, cq_mod_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq_moderation_caps cq_mod_caps
     * }
     */
    public static void cq_mod_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cq_mod_caps$OFFSET, cq_mod_caps$LAYOUT.byteSize());
    }

    private static final OfLong max_dm_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("max_dm_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t max_dm_size
     * }
     */
    public static final OfLong max_dm_size$layout() {
        return max_dm_size$LAYOUT;
    }

    private static final long max_dm_size$OFFSET = 376;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t max_dm_size
     * }
     */
    public static final long max_dm_size$offset() {
        return max_dm_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t max_dm_size
     * }
     */
    public static long max_dm_size(MemorySegment struct) {
        return struct.get(max_dm_size$LAYOUT, max_dm_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t max_dm_size
     * }
     */
    public static void max_dm_size(MemorySegment struct, long fieldValue) {
        struct.set(max_dm_size$LAYOUT, max_dm_size$OFFSET, fieldValue);
    }

    private static final GroupLayout pci_atomic_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("pci_atomic_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pci_atomic_caps pci_atomic_caps
     * }
     */
    public static final GroupLayout pci_atomic_caps$layout() {
        return pci_atomic_caps$LAYOUT;
    }

    private static final long pci_atomic_caps$OFFSET = 384;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pci_atomic_caps pci_atomic_caps
     * }
     */
    public static final long pci_atomic_caps$offset() {
        return pci_atomic_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pci_atomic_caps pci_atomic_caps
     * }
     */
    public static MemorySegment pci_atomic_caps(MemorySegment struct) {
        return struct.asSlice(pci_atomic_caps$OFFSET, pci_atomic_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pci_atomic_caps pci_atomic_caps
     * }
     */
    public static void pci_atomic_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, pci_atomic_caps$OFFSET, pci_atomic_caps$LAYOUT.byteSize());
    }

    private static final OfInt xrc_odp_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("xrc_odp_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t xrc_odp_caps
     * }
     */
    public static final OfInt xrc_odp_caps$layout() {
        return xrc_odp_caps$LAYOUT;
    }

    private static final long xrc_odp_caps$OFFSET = 392;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t xrc_odp_caps
     * }
     */
    public static final long xrc_odp_caps$offset() {
        return xrc_odp_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t xrc_odp_caps
     * }
     */
    public static int xrc_odp_caps(MemorySegment struct) {
        return struct.get(xrc_odp_caps$LAYOUT, xrc_odp_caps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t xrc_odp_caps
     * }
     */
    public static void xrc_odp_caps(MemorySegment struct, int fieldValue) {
        struct.set(xrc_odp_caps$LAYOUT, xrc_odp_caps$OFFSET, fieldValue);
    }

    private static final OfInt phys_port_cnt_ex$LAYOUT = (OfInt)$LAYOUT.select(groupElement("phys_port_cnt_ex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t phys_port_cnt_ex
     * }
     */
    public static final OfInt phys_port_cnt_ex$layout() {
        return phys_port_cnt_ex$LAYOUT;
    }

    private static final long phys_port_cnt_ex$OFFSET = 396;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t phys_port_cnt_ex
     * }
     */
    public static final long phys_port_cnt_ex$offset() {
        return phys_port_cnt_ex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t phys_port_cnt_ex
     * }
     */
    public static int phys_port_cnt_ex(MemorySegment struct) {
        return struct.get(phys_port_cnt_ex$LAYOUT, phys_port_cnt_ex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t phys_port_cnt_ex
     * }
     */
    public static void phys_port_cnt_ex(MemorySegment struct, int fieldValue) {
        struct.set(phys_port_cnt_ex$LAYOUT, phys_port_cnt_ex$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

