// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_global_route {
 *     union ibv_gid dgid;
 *     uint32_t flow_label;
 *     uint8_t sgid_index;
 *     uint8_t hop_limit;
 *     uint8_t traffic_class;
 * }
 * }
 */
public class ibv_global_route {

    ibv_global_route() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ibv_gid.layout().withName("dgid"),
        RdmaCm.C_INT.withName("flow_label"),
        RdmaCm.C_CHAR.withName("sgid_index"),
        RdmaCm.C_CHAR.withName("hop_limit"),
        RdmaCm.C_CHAR.withName("traffic_class"),
        MemoryLayout.paddingLayout(1)
    ).withName("ibv_global_route");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout dgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("dgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final GroupLayout dgid$layout() {
        return dgid$LAYOUT;
    }

    private static final long dgid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final long dgid$offset() {
        return dgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static MemorySegment dgid(MemorySegment struct) {
        return struct.asSlice(dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static void dgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    private static final OfInt flow_label$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flow_label"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static final OfInt flow_label$layout() {
        return flow_label$LAYOUT;
    }

    private static final long flow_label$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static final long flow_label$offset() {
        return flow_label$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static int flow_label(MemorySegment struct) {
        return struct.get(flow_label$LAYOUT, flow_label$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flow_label
     * }
     */
    public static void flow_label(MemorySegment struct, int fieldValue) {
        struct.set(flow_label$LAYOUT, flow_label$OFFSET, fieldValue);
    }

    private static final OfByte sgid_index$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sgid_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t sgid_index
     * }
     */
    public static final OfByte sgid_index$layout() {
        return sgid_index$LAYOUT;
    }

    private static final long sgid_index$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t sgid_index
     * }
     */
    public static final long sgid_index$offset() {
        return sgid_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t sgid_index
     * }
     */
    public static byte sgid_index(MemorySegment struct) {
        return struct.get(sgid_index$LAYOUT, sgid_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t sgid_index
     * }
     */
    public static void sgid_index(MemorySegment struct, byte fieldValue) {
        struct.set(sgid_index$LAYOUT, sgid_index$OFFSET, fieldValue);
    }

    private static final OfByte hop_limit$LAYOUT = (OfByte)$LAYOUT.select(groupElement("hop_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final OfByte hop_limit$layout() {
        return hop_limit$LAYOUT;
    }

    private static final long hop_limit$OFFSET = 21;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final long hop_limit$offset() {
        return hop_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static byte hop_limit(MemorySegment struct) {
        return struct.get(hop_limit$LAYOUT, hop_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static void hop_limit(MemorySegment struct, byte fieldValue) {
        struct.set(hop_limit$LAYOUT, hop_limit$OFFSET, fieldValue);
    }

    private static final OfByte traffic_class$LAYOUT = (OfByte)$LAYOUT.select(groupElement("traffic_class"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static final OfByte traffic_class$layout() {
        return traffic_class$LAYOUT;
    }

    private static final long traffic_class$OFFSET = 22;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static final long traffic_class$offset() {
        return traffic_class$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static byte traffic_class(MemorySegment struct) {
        return struct.get(traffic_class$LAYOUT, traffic_class$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t traffic_class
     * }
     */
    public static void traffic_class(MemorySegment struct, byte fieldValue) {
        struct.set(traffic_class$LAYOUT, traffic_class$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

