// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rdma_addrinfo {
 *     int ai_flags;
 *     int ai_family;
 *     int ai_qp_type;
 *     int ai_port_space;
 *     socklen_t ai_src_len;
 *     socklen_t ai_dst_len;
 *     struct sockaddr *ai_src_addr;
 *     struct sockaddr *ai_dst_addr;
 *     char *ai_src_canonname;
 *     char *ai_dst_canonname;
 *     size_t ai_route_len;
 *     void *ai_route;
 *     size_t ai_connect_len;
 *     void *ai_connect;
 *     struct rdma_addrinfo *ai_next;
 * }
 * }
 */
public class rdma_addrinfo {

    rdma_addrinfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_INT.withName("ai_flags"),
        RdmaCm.C_INT.withName("ai_family"),
        RdmaCm.C_INT.withName("ai_qp_type"),
        RdmaCm.C_INT.withName("ai_port_space"),
        RdmaCm.C_INT.withName("ai_src_len"),
        RdmaCm.C_INT.withName("ai_dst_len"),
        RdmaCm.C_POINTER.withName("ai_src_addr"),
        RdmaCm.C_POINTER.withName("ai_dst_addr"),
        RdmaCm.C_POINTER.withName("ai_src_canonname"),
        RdmaCm.C_POINTER.withName("ai_dst_canonname"),
        RdmaCm.C_LONG.withName("ai_route_len"),
        RdmaCm.C_POINTER.withName("ai_route"),
        RdmaCm.C_LONG.withName("ai_connect_len"),
        RdmaCm.C_POINTER.withName("ai_connect"),
        RdmaCm.C_POINTER.withName("ai_next")
    ).withName("rdma_addrinfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt ai_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ai_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int ai_flags
     * }
     */
    public static final OfInt ai_flags$layout() {
        return ai_flags$LAYOUT;
    }

    private static final long ai_flags$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int ai_flags
     * }
     */
    public static final long ai_flags$offset() {
        return ai_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int ai_flags
     * }
     */
    public static int ai_flags(MemorySegment struct) {
        return struct.get(ai_flags$LAYOUT, ai_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int ai_flags
     * }
     */
    public static void ai_flags(MemorySegment struct, int fieldValue) {
        struct.set(ai_flags$LAYOUT, ai_flags$OFFSET, fieldValue);
    }

    private static final OfInt ai_family$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ai_family"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int ai_family
     * }
     */
    public static final OfInt ai_family$layout() {
        return ai_family$LAYOUT;
    }

    private static final long ai_family$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int ai_family
     * }
     */
    public static final long ai_family$offset() {
        return ai_family$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int ai_family
     * }
     */
    public static int ai_family(MemorySegment struct) {
        return struct.get(ai_family$LAYOUT, ai_family$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int ai_family
     * }
     */
    public static void ai_family(MemorySegment struct, int fieldValue) {
        struct.set(ai_family$LAYOUT, ai_family$OFFSET, fieldValue);
    }

    private static final OfInt ai_qp_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ai_qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int ai_qp_type
     * }
     */
    public static final OfInt ai_qp_type$layout() {
        return ai_qp_type$LAYOUT;
    }

    private static final long ai_qp_type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int ai_qp_type
     * }
     */
    public static final long ai_qp_type$offset() {
        return ai_qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int ai_qp_type
     * }
     */
    public static int ai_qp_type(MemorySegment struct) {
        return struct.get(ai_qp_type$LAYOUT, ai_qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int ai_qp_type
     * }
     */
    public static void ai_qp_type(MemorySegment struct, int fieldValue) {
        struct.set(ai_qp_type$LAYOUT, ai_qp_type$OFFSET, fieldValue);
    }

    private static final OfInt ai_port_space$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ai_port_space"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int ai_port_space
     * }
     */
    public static final OfInt ai_port_space$layout() {
        return ai_port_space$LAYOUT;
    }

    private static final long ai_port_space$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int ai_port_space
     * }
     */
    public static final long ai_port_space$offset() {
        return ai_port_space$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int ai_port_space
     * }
     */
    public static int ai_port_space(MemorySegment struct) {
        return struct.get(ai_port_space$LAYOUT, ai_port_space$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int ai_port_space
     * }
     */
    public static void ai_port_space(MemorySegment struct, int fieldValue) {
        struct.set(ai_port_space$LAYOUT, ai_port_space$OFFSET, fieldValue);
    }

    private static final OfInt ai_src_len$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ai_src_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * socklen_t ai_src_len
     * }
     */
    public static final OfInt ai_src_len$layout() {
        return ai_src_len$LAYOUT;
    }

    private static final long ai_src_len$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * socklen_t ai_src_len
     * }
     */
    public static final long ai_src_len$offset() {
        return ai_src_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * socklen_t ai_src_len
     * }
     */
    public static int ai_src_len(MemorySegment struct) {
        return struct.get(ai_src_len$LAYOUT, ai_src_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * socklen_t ai_src_len
     * }
     */
    public static void ai_src_len(MemorySegment struct, int fieldValue) {
        struct.set(ai_src_len$LAYOUT, ai_src_len$OFFSET, fieldValue);
    }

    private static final OfInt ai_dst_len$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ai_dst_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * socklen_t ai_dst_len
     * }
     */
    public static final OfInt ai_dst_len$layout() {
        return ai_dst_len$LAYOUT;
    }

    private static final long ai_dst_len$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * socklen_t ai_dst_len
     * }
     */
    public static final long ai_dst_len$offset() {
        return ai_dst_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * socklen_t ai_dst_len
     * }
     */
    public static int ai_dst_len(MemorySegment struct) {
        return struct.get(ai_dst_len$LAYOUT, ai_dst_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * socklen_t ai_dst_len
     * }
     */
    public static void ai_dst_len(MemorySegment struct, int fieldValue) {
        struct.set(ai_dst_len$LAYOUT, ai_dst_len$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_src_addr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_src_addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_src_addr
     * }
     */
    public static final AddressLayout ai_src_addr$layout() {
        return ai_src_addr$LAYOUT;
    }

    private static final long ai_src_addr$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_src_addr
     * }
     */
    public static final long ai_src_addr$offset() {
        return ai_src_addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_src_addr
     * }
     */
    public static MemorySegment ai_src_addr(MemorySegment struct) {
        return struct.get(ai_src_addr$LAYOUT, ai_src_addr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_src_addr
     * }
     */
    public static void ai_src_addr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_src_addr$LAYOUT, ai_src_addr$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_dst_addr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_dst_addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_dst_addr
     * }
     */
    public static final AddressLayout ai_dst_addr$layout() {
        return ai_dst_addr$LAYOUT;
    }

    private static final long ai_dst_addr$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_dst_addr
     * }
     */
    public static final long ai_dst_addr$offset() {
        return ai_dst_addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_dst_addr
     * }
     */
    public static MemorySegment ai_dst_addr(MemorySegment struct) {
        return struct.get(ai_dst_addr$LAYOUT, ai_dst_addr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr *ai_dst_addr
     * }
     */
    public static void ai_dst_addr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_dst_addr$LAYOUT, ai_dst_addr$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_src_canonname$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_src_canonname"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *ai_src_canonname
     * }
     */
    public static final AddressLayout ai_src_canonname$layout() {
        return ai_src_canonname$LAYOUT;
    }

    private static final long ai_src_canonname$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *ai_src_canonname
     * }
     */
    public static final long ai_src_canonname$offset() {
        return ai_src_canonname$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *ai_src_canonname
     * }
     */
    public static MemorySegment ai_src_canonname(MemorySegment struct) {
        return struct.get(ai_src_canonname$LAYOUT, ai_src_canonname$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *ai_src_canonname
     * }
     */
    public static void ai_src_canonname(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_src_canonname$LAYOUT, ai_src_canonname$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_dst_canonname$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_dst_canonname"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *ai_dst_canonname
     * }
     */
    public static final AddressLayout ai_dst_canonname$layout() {
        return ai_dst_canonname$LAYOUT;
    }

    private static final long ai_dst_canonname$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *ai_dst_canonname
     * }
     */
    public static final long ai_dst_canonname$offset() {
        return ai_dst_canonname$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *ai_dst_canonname
     * }
     */
    public static MemorySegment ai_dst_canonname(MemorySegment struct) {
        return struct.get(ai_dst_canonname$LAYOUT, ai_dst_canonname$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *ai_dst_canonname
     * }
     */
    public static void ai_dst_canonname(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_dst_canonname$LAYOUT, ai_dst_canonname$OFFSET, fieldValue);
    }

    private static final OfLong ai_route_len$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ai_route_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t ai_route_len
     * }
     */
    public static final OfLong ai_route_len$layout() {
        return ai_route_len$LAYOUT;
    }

    private static final long ai_route_len$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t ai_route_len
     * }
     */
    public static final long ai_route_len$offset() {
        return ai_route_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t ai_route_len
     * }
     */
    public static long ai_route_len(MemorySegment struct) {
        return struct.get(ai_route_len$LAYOUT, ai_route_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t ai_route_len
     * }
     */
    public static void ai_route_len(MemorySegment struct, long fieldValue) {
        struct.set(ai_route_len$LAYOUT, ai_route_len$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_route$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_route"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *ai_route
     * }
     */
    public static final AddressLayout ai_route$layout() {
        return ai_route$LAYOUT;
    }

    private static final long ai_route$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *ai_route
     * }
     */
    public static final long ai_route$offset() {
        return ai_route$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *ai_route
     * }
     */
    public static MemorySegment ai_route(MemorySegment struct) {
        return struct.get(ai_route$LAYOUT, ai_route$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *ai_route
     * }
     */
    public static void ai_route(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_route$LAYOUT, ai_route$OFFSET, fieldValue);
    }

    private static final OfLong ai_connect_len$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ai_connect_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t ai_connect_len
     * }
     */
    public static final OfLong ai_connect_len$layout() {
        return ai_connect_len$LAYOUT;
    }

    private static final long ai_connect_len$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t ai_connect_len
     * }
     */
    public static final long ai_connect_len$offset() {
        return ai_connect_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t ai_connect_len
     * }
     */
    public static long ai_connect_len(MemorySegment struct) {
        return struct.get(ai_connect_len$LAYOUT, ai_connect_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t ai_connect_len
     * }
     */
    public static void ai_connect_len(MemorySegment struct, long fieldValue) {
        struct.set(ai_connect_len$LAYOUT, ai_connect_len$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_connect$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_connect"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *ai_connect
     * }
     */
    public static final AddressLayout ai_connect$layout() {
        return ai_connect$LAYOUT;
    }

    private static final long ai_connect$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *ai_connect
     * }
     */
    public static final long ai_connect$offset() {
        return ai_connect$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *ai_connect
     * }
     */
    public static MemorySegment ai_connect(MemorySegment struct) {
        return struct.get(ai_connect$LAYOUT, ai_connect$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *ai_connect
     * }
     */
    public static void ai_connect(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_connect$LAYOUT, ai_connect$OFFSET, fieldValue);
    }

    private static final AddressLayout ai_next$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ai_next"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct rdma_addrinfo *ai_next
     * }
     */
    public static final AddressLayout ai_next$layout() {
        return ai_next$LAYOUT;
    }

    private static final long ai_next$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct rdma_addrinfo *ai_next
     * }
     */
    public static final long ai_next$offset() {
        return ai_next$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct rdma_addrinfo *ai_next
     * }
     */
    public static MemorySegment ai_next(MemorySegment struct) {
        return struct.get(ai_next$LAYOUT, ai_next$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct rdma_addrinfo *ai_next
     * }
     */
    public static void ai_next(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ai_next$LAYOUT, ai_next$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

