// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rdma_addr {
 *     union {
 *         struct sockaddr src_addr;
 *         struct sockaddr_in src_sin;
 *         struct sockaddr_in6 src_sin6;
 *         struct sockaddr_storage src_storage;
 *     };
 *     union {
 *         struct sockaddr dst_addr;
 *         struct sockaddr_in dst_sin;
 *         struct sockaddr_in6 dst_sin6;
 *         struct sockaddr_storage dst_storage;
 *     };
 *     union {
 *         struct rdma_ib_addr ibaddr;
 *     } addr;
 * }
 * }
 */
public class rdma_addr {

    rdma_addr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            sockaddr.layout().withName("src_addr"),
            sockaddr_in.layout().withName("src_sin"),
            sockaddr_in6.layout().withName("src_sin6"),
            sockaddr_storage.layout().withName("src_storage")
        ).withName("$anon$95:2"),
        MemoryLayout.unionLayout(
            sockaddr.layout().withName("dst_addr"),
            sockaddr_in.layout().withName("dst_sin"),
            sockaddr_in6.layout().withName("dst_sin6"),
            sockaddr_storage.layout().withName("dst_storage")
        ).withName("$anon$101:2"),
        rdma_addr.addr.layout().withName("addr")
    ).withName("rdma_addr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout src_addr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$95:2"), groupElement("src_addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr src_addr
     * }
     */
    public static final GroupLayout src_addr$layout() {
        return src_addr$LAYOUT;
    }

    private static final long src_addr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr src_addr
     * }
     */
    public static final long src_addr$offset() {
        return src_addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr src_addr
     * }
     */
    public static MemorySegment src_addr(MemorySegment struct) {
        return struct.asSlice(src_addr$OFFSET, src_addr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr src_addr
     * }
     */
    public static void src_addr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, src_addr$OFFSET, src_addr$LAYOUT.byteSize());
    }

    private static final GroupLayout src_sin$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$95:2"), groupElement("src_sin"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_in src_sin
     * }
     */
    public static final GroupLayout src_sin$layout() {
        return src_sin$LAYOUT;
    }

    private static final long src_sin$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_in src_sin
     * }
     */
    public static final long src_sin$offset() {
        return src_sin$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_in src_sin
     * }
     */
    public static MemorySegment src_sin(MemorySegment struct) {
        return struct.asSlice(src_sin$OFFSET, src_sin$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_in src_sin
     * }
     */
    public static void src_sin(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, src_sin$OFFSET, src_sin$LAYOUT.byteSize());
    }

    private static final GroupLayout src_sin6$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$95:2"), groupElement("src_sin6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 src_sin6
     * }
     */
    public static final GroupLayout src_sin6$layout() {
        return src_sin6$LAYOUT;
    }

    private static final long src_sin6$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 src_sin6
     * }
     */
    public static final long src_sin6$offset() {
        return src_sin6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 src_sin6
     * }
     */
    public static MemorySegment src_sin6(MemorySegment struct) {
        return struct.asSlice(src_sin6$OFFSET, src_sin6$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 src_sin6
     * }
     */
    public static void src_sin6(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, src_sin6$OFFSET, src_sin6$LAYOUT.byteSize());
    }

    private static final GroupLayout src_storage$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$95:2"), groupElement("src_storage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_storage src_storage
     * }
     */
    public static final GroupLayout src_storage$layout() {
        return src_storage$LAYOUT;
    }

    private static final long src_storage$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_storage src_storage
     * }
     */
    public static final long src_storage$offset() {
        return src_storage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage src_storage
     * }
     */
    public static MemorySegment src_storage(MemorySegment struct) {
        return struct.asSlice(src_storage$OFFSET, src_storage$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage src_storage
     * }
     */
    public static void src_storage(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, src_storage$OFFSET, src_storage$LAYOUT.byteSize());
    }

    private static final GroupLayout dst_addr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$101:2"), groupElement("dst_addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr dst_addr
     * }
     */
    public static final GroupLayout dst_addr$layout() {
        return dst_addr$LAYOUT;
    }

    private static final long dst_addr$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr dst_addr
     * }
     */
    public static final long dst_addr$offset() {
        return dst_addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr dst_addr
     * }
     */
    public static MemorySegment dst_addr(MemorySegment struct) {
        return struct.asSlice(dst_addr$OFFSET, dst_addr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr dst_addr
     * }
     */
    public static void dst_addr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dst_addr$OFFSET, dst_addr$LAYOUT.byteSize());
    }

    private static final GroupLayout dst_sin$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$101:2"), groupElement("dst_sin"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_in dst_sin
     * }
     */
    public static final GroupLayout dst_sin$layout() {
        return dst_sin$LAYOUT;
    }

    private static final long dst_sin$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_in dst_sin
     * }
     */
    public static final long dst_sin$offset() {
        return dst_sin$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_in dst_sin
     * }
     */
    public static MemorySegment dst_sin(MemorySegment struct) {
        return struct.asSlice(dst_sin$OFFSET, dst_sin$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_in dst_sin
     * }
     */
    public static void dst_sin(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dst_sin$OFFSET, dst_sin$LAYOUT.byteSize());
    }

    private static final GroupLayout dst_sin6$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$101:2"), groupElement("dst_sin6"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 dst_sin6
     * }
     */
    public static final GroupLayout dst_sin6$layout() {
        return dst_sin6$LAYOUT;
    }

    private static final long dst_sin6$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 dst_sin6
     * }
     */
    public static final long dst_sin6$offset() {
        return dst_sin6$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 dst_sin6
     * }
     */
    public static MemorySegment dst_sin6(MemorySegment struct) {
        return struct.asSlice(dst_sin6$OFFSET, dst_sin6$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_in6 dst_sin6
     * }
     */
    public static void dst_sin6(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dst_sin6$OFFSET, dst_sin6$LAYOUT.byteSize());
    }

    private static final GroupLayout dst_storage$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$101:2"), groupElement("dst_storage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_storage dst_storage
     * }
     */
    public static final GroupLayout dst_storage$layout() {
        return dst_storage$LAYOUT;
    }

    private static final long dst_storage$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_storage dst_storage
     * }
     */
    public static final long dst_storage$offset() {
        return dst_storage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage dst_storage
     * }
     */
    public static MemorySegment dst_storage(MemorySegment struct) {
        return struct.asSlice(dst_storage$OFFSET, dst_storage$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage dst_storage
     * }
     */
    public static void dst_storage(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dst_storage$OFFSET, dst_storage$LAYOUT.byteSize());
    }

    /**
     * {@snippet lang=c :
     * union {
     *     struct rdma_ib_addr ibaddr;
     * }
     * }
     */
    public static class addr {

        addr() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            rdma_ib_addr.layout().withName("ibaddr")
        ).withName("$anon$107:2");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final GroupLayout ibaddr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ibaddr"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct rdma_ib_addr ibaddr
         * }
         */
        public static final GroupLayout ibaddr$layout() {
            return ibaddr$LAYOUT;
        }

        private static final long ibaddr$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct rdma_ib_addr ibaddr
         * }
         */
        public static final long ibaddr$offset() {
            return ibaddr$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct rdma_ib_addr ibaddr
         * }
         */
        public static MemorySegment ibaddr(MemorySegment union) {
            return union.asSlice(ibaddr$OFFSET, ibaddr$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct rdma_ib_addr ibaddr
         * }
         */
        public static void ibaddr(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, ibaddr$OFFSET, ibaddr$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout addr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_ib_addr ibaddr;
     * } addr
     * }
     */
    public static final GroupLayout addr$layout() {
        return addr$LAYOUT;
    }

    private static final long addr$OFFSET = 256;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_ib_addr ibaddr;
     * } addr
     * }
     */
    public static final long addr$offset() {
        return addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_ib_addr ibaddr;
     * } addr
     * }
     */
    public static MemorySegment addr(MemorySegment struct) {
        return struct.asSlice(addr$OFFSET, addr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_ib_addr ibaddr;
     * } addr
     * }
     */
    public static void addr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, addr$OFFSET, addr$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

