// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rdma_conn_param {
 *     const void *private_data;
 *     uint8_t private_data_len;
 *     uint8_t responder_resources;
 *     uint8_t initiator_depth;
 *     uint8_t flow_control;
 *     uint8_t retry_count;
 *     uint8_t rnr_retry_count;
 *     uint8_t srq;
 *     uint32_t qp_num;
 * }
 * }
 */
public class rdma_conn_param {

    rdma_conn_param() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("private_data"),
        RdmaCm.C_CHAR.withName("private_data_len"),
        RdmaCm.C_CHAR.withName("responder_resources"),
        RdmaCm.C_CHAR.withName("initiator_depth"),
        RdmaCm.C_CHAR.withName("flow_control"),
        RdmaCm.C_CHAR.withName("retry_count"),
        RdmaCm.C_CHAR.withName("rnr_retry_count"),
        RdmaCm.C_CHAR.withName("srq"),
        MemoryLayout.paddingLayout(1),
        RdmaCm.C_INT.withName("qp_num"),
        MemoryLayout.paddingLayout(4)
    ).withName("rdma_conn_param");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout private_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("private_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static final AddressLayout private_data$layout() {
        return private_data$LAYOUT;
    }

    private static final long private_data$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static final long private_data$offset() {
        return private_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static MemorySegment private_data(MemorySegment struct) {
        return struct.get(private_data$LAYOUT, private_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static void private_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(private_data$LAYOUT, private_data$OFFSET, fieldValue);
    }

    private static final OfByte private_data_len$LAYOUT = (OfByte)$LAYOUT.select(groupElement("private_data_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static final OfByte private_data_len$layout() {
        return private_data_len$LAYOUT;
    }

    private static final long private_data_len$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static final long private_data_len$offset() {
        return private_data_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static byte private_data_len(MemorySegment struct) {
        return struct.get(private_data_len$LAYOUT, private_data_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static void private_data_len(MemorySegment struct, byte fieldValue) {
        struct.set(private_data_len$LAYOUT, private_data_len$OFFSET, fieldValue);
    }

    private static final OfByte responder_resources$LAYOUT = (OfByte)$LAYOUT.select(groupElement("responder_resources"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t responder_resources
     * }
     */
    public static final OfByte responder_resources$layout() {
        return responder_resources$LAYOUT;
    }

    private static final long responder_resources$OFFSET = 9;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t responder_resources
     * }
     */
    public static final long responder_resources$offset() {
        return responder_resources$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t responder_resources
     * }
     */
    public static byte responder_resources(MemorySegment struct) {
        return struct.get(responder_resources$LAYOUT, responder_resources$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t responder_resources
     * }
     */
    public static void responder_resources(MemorySegment struct, byte fieldValue) {
        struct.set(responder_resources$LAYOUT, responder_resources$OFFSET, fieldValue);
    }

    private static final OfByte initiator_depth$LAYOUT = (OfByte)$LAYOUT.select(groupElement("initiator_depth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t initiator_depth
     * }
     */
    public static final OfByte initiator_depth$layout() {
        return initiator_depth$LAYOUT;
    }

    private static final long initiator_depth$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t initiator_depth
     * }
     */
    public static final long initiator_depth$offset() {
        return initiator_depth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t initiator_depth
     * }
     */
    public static byte initiator_depth(MemorySegment struct) {
        return struct.get(initiator_depth$LAYOUT, initiator_depth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t initiator_depth
     * }
     */
    public static void initiator_depth(MemorySegment struct, byte fieldValue) {
        struct.set(initiator_depth$LAYOUT, initiator_depth$OFFSET, fieldValue);
    }

    private static final OfByte flow_control$LAYOUT = (OfByte)$LAYOUT.select(groupElement("flow_control"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t flow_control
     * }
     */
    public static final OfByte flow_control$layout() {
        return flow_control$LAYOUT;
    }

    private static final long flow_control$OFFSET = 11;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t flow_control
     * }
     */
    public static final long flow_control$offset() {
        return flow_control$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t flow_control
     * }
     */
    public static byte flow_control(MemorySegment struct) {
        return struct.get(flow_control$LAYOUT, flow_control$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t flow_control
     * }
     */
    public static void flow_control(MemorySegment struct, byte fieldValue) {
        struct.set(flow_control$LAYOUT, flow_control$OFFSET, fieldValue);
    }

    private static final OfByte retry_count$LAYOUT = (OfByte)$LAYOUT.select(groupElement("retry_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t retry_count
     * }
     */
    public static final OfByte retry_count$layout() {
        return retry_count$LAYOUT;
    }

    private static final long retry_count$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t retry_count
     * }
     */
    public static final long retry_count$offset() {
        return retry_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t retry_count
     * }
     */
    public static byte retry_count(MemorySegment struct) {
        return struct.get(retry_count$LAYOUT, retry_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t retry_count
     * }
     */
    public static void retry_count(MemorySegment struct, byte fieldValue) {
        struct.set(retry_count$LAYOUT, retry_count$OFFSET, fieldValue);
    }

    private static final OfByte rnr_retry_count$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rnr_retry_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry_count
     * }
     */
    public static final OfByte rnr_retry_count$layout() {
        return rnr_retry_count$LAYOUT;
    }

    private static final long rnr_retry_count$OFFSET = 13;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry_count
     * }
     */
    public static final long rnr_retry_count$offset() {
        return rnr_retry_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry_count
     * }
     */
    public static byte rnr_retry_count(MemorySegment struct) {
        return struct.get(rnr_retry_count$LAYOUT, rnr_retry_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry_count
     * }
     */
    public static void rnr_retry_count(MemorySegment struct, byte fieldValue) {
        struct.set(rnr_retry_count$LAYOUT, rnr_retry_count$OFFSET, fieldValue);
    }

    private static final OfByte srq$LAYOUT = (OfByte)$LAYOUT.select(groupElement("srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t srq
     * }
     */
    public static final OfByte srq$layout() {
        return srq$LAYOUT;
    }

    private static final long srq$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t srq
     * }
     */
    public static final long srq$offset() {
        return srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t srq
     * }
     */
    public static byte srq(MemorySegment struct) {
        return struct.get(srq$LAYOUT, srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t srq
     * }
     */
    public static void srq(MemorySegment struct, byte fieldValue) {
        struct.set(srq$LAYOUT, srq$OFFSET, fieldValue);
    }

    private static final OfInt qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final OfInt qp_num$layout() {
        return qp_num$LAYOUT;
    }

    private static final long qp_num$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final long qp_num$offset() {
        return qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static int qp_num(MemorySegment struct) {
        return struct.get(qp_num$LAYOUT, qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static void qp_num(MemorySegment struct, int fieldValue) {
        struct.set(qp_num$LAYOUT, qp_num$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

