// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rdma_cm_event {
 *     struct rdma_cm_id *id;
 *     struct rdma_cm_id *listen_id;
 *     enum rdma_cm_event_type event;
 *     int status;
 *     union {
 *         struct rdma_conn_param conn;
 *         struct rdma_ud_param ud;
 *     } param;
 * }
 * }
 */
public class rdma_cm_event {

    rdma_cm_event() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("id"),
        RdmaCm.C_POINTER.withName("listen_id"),
        RdmaCm.C_INT.withName("event"),
        RdmaCm.C_INT.withName("status"),
        rdma_cm_event.param.layout().withName("param")
    ).withName("rdma_cm_event");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout id$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *id
     * }
     */
    public static final AddressLayout id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *id
     * }
     */
    public static MemorySegment id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *id
     * }
     */
    public static void id(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final AddressLayout listen_id$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("listen_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *listen_id
     * }
     */
    public static final AddressLayout listen_id$layout() {
        return listen_id$LAYOUT;
    }

    private static final long listen_id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *listen_id
     * }
     */
    public static final long listen_id$offset() {
        return listen_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *listen_id
     * }
     */
    public static MemorySegment listen_id(MemorySegment struct) {
        return struct.get(listen_id$LAYOUT, listen_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct rdma_cm_id *listen_id
     * }
     */
    public static void listen_id(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(listen_id$LAYOUT, listen_id$OFFSET, fieldValue);
    }

    private static final OfInt event$LAYOUT = (OfInt)$LAYOUT.select(groupElement("event"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum rdma_cm_event_type event
     * }
     */
    public static final OfInt event$layout() {
        return event$LAYOUT;
    }

    private static final long event$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum rdma_cm_event_type event
     * }
     */
    public static final long event$offset() {
        return event$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum rdma_cm_event_type event
     * }
     */
    public static int event(MemorySegment struct) {
        return struct.get(event$LAYOUT, event$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum rdma_cm_event_type event
     * }
     */
    public static void event(MemorySegment struct, int fieldValue) {
        struct.set(event$LAYOUT, event$OFFSET, fieldValue);
    }

    private static final OfInt status$LAYOUT = (OfInt)$LAYOUT.select(groupElement("status"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int status
     * }
     */
    public static final OfInt status$layout() {
        return status$LAYOUT;
    }

    private static final long status$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int status
     * }
     */
    public static final long status$offset() {
        return status$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int status
     * }
     */
    public static int status(MemorySegment struct) {
        return struct.get(status$LAYOUT, status$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int status
     * }
     */
    public static void status(MemorySegment struct, int fieldValue) {
        struct.set(status$LAYOUT, status$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union {
     *     struct rdma_conn_param conn;
     *     struct rdma_ud_param ud;
     * }
     * }
     */
    public static class param {

        param() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            rdma_conn_param.layout().withName("conn"),
            rdma_ud_param.layout().withName("ud")
        ).withName("$anon$171:2");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final GroupLayout conn$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("conn"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct rdma_conn_param conn
         * }
         */
        public static final GroupLayout conn$layout() {
            return conn$LAYOUT;
        }

        private static final long conn$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct rdma_conn_param conn
         * }
         */
        public static final long conn$offset() {
            return conn$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct rdma_conn_param conn
         * }
         */
        public static MemorySegment conn(MemorySegment union) {
            return union.asSlice(conn$OFFSET, conn$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct rdma_conn_param conn
         * }
         */
        public static void conn(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, conn$OFFSET, conn$LAYOUT.byteSize());
        }

        private static final GroupLayout ud$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ud"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct rdma_ud_param ud
         * }
         */
        public static final GroupLayout ud$layout() {
            return ud$LAYOUT;
        }

        private static final long ud$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct rdma_ud_param ud
         * }
         */
        public static final long ud$offset() {
            return ud$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct rdma_ud_param ud
         * }
         */
        public static MemorySegment ud(MemorySegment union) {
            return union.asSlice(ud$OFFSET, ud$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct rdma_ud_param ud
         * }
         */
        public static void ud(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, ud$OFFSET, ud$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout param$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("param"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_conn_param conn;
     *     struct rdma_ud_param ud;
     * } param
     * }
     */
    public static final GroupLayout param$layout() {
        return param$LAYOUT;
    }

    private static final long param$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_conn_param conn;
     *     struct rdma_ud_param ud;
     * } param
     * }
     */
    public static final long param$offset() {
        return param$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_conn_param conn;
     *     struct rdma_ud_param ud;
     * } param
     * }
     */
    public static MemorySegment param(MemorySegment struct) {
        return struct.asSlice(param$OFFSET, param$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     struct rdma_conn_param conn;
     *     struct rdma_ud_param ud;
     * } param
     * }
     */
    public static void param(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, param$OFFSET, param$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

