// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rdma_cm_id {
 *     struct ibv_context *verbs;
 *     struct rdma_event_channel *channel;
 *     void *context;
 *     struct ibv_qp *qp;
 *     struct rdma_route route;
 *     enum rdma_port_space ps;
 *     uint8_t port_num;
 *     struct rdma_cm_event *event;
 *     struct ibv_comp_channel *send_cq_channel;
 *     struct ibv_cq *send_cq;
 *     struct ibv_comp_channel *recv_cq_channel;
 *     struct ibv_cq *recv_cq;
 *     struct ibv_srq *srq;
 *     struct ibv_pd *pd;
 *     enum ibv_qp_type qp_type;
 * }
 * }
 */
public class rdma_cm_id {

    rdma_cm_id() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("verbs"),
        RdmaCm.C_POINTER.withName("channel"),
        RdmaCm.C_POINTER.withName("context"),
        RdmaCm.C_POINTER.withName("qp"),
        rdma_route.layout().withName("route"),
        RdmaCm.C_INT.withName("ps"),
        RdmaCm.C_CHAR.withName("port_num"),
        MemoryLayout.paddingLayout(3),
        RdmaCm.C_POINTER.withName("event"),
        RdmaCm.C_POINTER.withName("send_cq_channel"),
        RdmaCm.C_POINTER.withName("send_cq"),
        RdmaCm.C_POINTER.withName("recv_cq_channel"),
        RdmaCm.C_POINTER.withName("recv_cq"),
        RdmaCm.C_POINTER.withName("srq"),
        RdmaCm.C_POINTER.withName("pd"),
        RdmaCm.C_INT.withName("qp_type"),
        MemoryLayout.paddingLayout(4)
    ).withName("rdma_cm_id");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout verbs$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("verbs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context *verbs
     * }
     */
    public static final AddressLayout verbs$layout() {
        return verbs$LAYOUT;
    }

    private static final long verbs$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context *verbs
     * }
     */
    public static final long verbs$offset() {
        return verbs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context *verbs
     * }
     */
    public static MemorySegment verbs(MemorySegment struct) {
        return struct.get(verbs$LAYOUT, verbs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context *verbs
     * }
     */
    public static void verbs(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(verbs$LAYOUT, verbs$OFFSET, fieldValue);
    }

    private static final AddressLayout channel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("channel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct rdma_event_channel *channel
     * }
     */
    public static final AddressLayout channel$layout() {
        return channel$LAYOUT;
    }

    private static final long channel$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct rdma_event_channel *channel
     * }
     */
    public static final long channel$offset() {
        return channel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct rdma_event_channel *channel
     * }
     */
    public static MemorySegment channel(MemorySegment struct) {
        return struct.get(channel$LAYOUT, channel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct rdma_event_channel *channel
     * }
     */
    public static void channel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(channel$LAYOUT, channel$OFFSET, fieldValue);
    }

    private static final AddressLayout context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *context
     * }
     */
    public static final AddressLayout context$layout() {
        return context$LAYOUT;
    }

    private static final long context$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *context
     * }
     */
    public static final long context$offset() {
        return context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *context
     * }
     */
    public static MemorySegment context(MemorySegment struct) {
        return struct.get(context$LAYOUT, context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *context
     * }
     */
    public static void context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(context$LAYOUT, context$OFFSET, fieldValue);
    }

    private static final AddressLayout qp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("qp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_qp *qp
     * }
     */
    public static final AddressLayout qp$layout() {
        return qp$LAYOUT;
    }

    private static final long qp$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_qp *qp
     * }
     */
    public static final long qp$offset() {
        return qp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_qp *qp
     * }
     */
    public static MemorySegment qp(MemorySegment struct) {
        return struct.get(qp$LAYOUT, qp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_qp *qp
     * }
     */
    public static void qp(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(qp$LAYOUT, qp$OFFSET, fieldValue);
    }

    private static final GroupLayout route$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("route"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct rdma_route route
     * }
     */
    public static final GroupLayout route$layout() {
        return route$LAYOUT;
    }

    private static final long route$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct rdma_route route
     * }
     */
    public static final long route$offset() {
        return route$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct rdma_route route
     * }
     */
    public static MemorySegment route(MemorySegment struct) {
        return struct.asSlice(route$OFFSET, route$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct rdma_route route
     * }
     */
    public static void route(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, route$OFFSET, route$LAYOUT.byteSize());
    }

    private static final OfInt ps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum rdma_port_space ps
     * }
     */
    public static final OfInt ps$layout() {
        return ps$LAYOUT;
    }

    private static final long ps$OFFSET = 344;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum rdma_port_space ps
     * }
     */
    public static final long ps$offset() {
        return ps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum rdma_port_space ps
     * }
     */
    public static int ps(MemorySegment struct) {
        return struct.get(ps$LAYOUT, ps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum rdma_port_space ps
     * }
     */
    public static void ps(MemorySegment struct, int fieldValue) {
        struct.set(ps$LAYOUT, ps$OFFSET, fieldValue);
    }

    private static final OfByte port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static final OfByte port_num$layout() {
        return port_num$LAYOUT;
    }

    private static final long port_num$OFFSET = 348;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static final long port_num$offset() {
        return port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static byte port_num(MemorySegment struct) {
        return struct.get(port_num$LAYOUT, port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static void port_num(MemorySegment struct, byte fieldValue) {
        struct.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
    }

    private static final AddressLayout event$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("event"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct rdma_cm_event *event
     * }
     */
    public static final AddressLayout event$layout() {
        return event$LAYOUT;
    }

    private static final long event$OFFSET = 352;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct rdma_cm_event *event
     * }
     */
    public static final long event$offset() {
        return event$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct rdma_cm_event *event
     * }
     */
    public static MemorySegment event(MemorySegment struct) {
        return struct.get(event$LAYOUT, event$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct rdma_cm_event *event
     * }
     */
    public static void event(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(event$LAYOUT, event$OFFSET, fieldValue);
    }

    private static final AddressLayout send_cq_channel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("send_cq_channel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *send_cq_channel
     * }
     */
    public static final AddressLayout send_cq_channel$layout() {
        return send_cq_channel$LAYOUT;
    }

    private static final long send_cq_channel$OFFSET = 360;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *send_cq_channel
     * }
     */
    public static final long send_cq_channel$offset() {
        return send_cq_channel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *send_cq_channel
     * }
     */
    public static MemorySegment send_cq_channel(MemorySegment struct) {
        return struct.get(send_cq_channel$LAYOUT, send_cq_channel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *send_cq_channel
     * }
     */
    public static void send_cq_channel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(send_cq_channel$LAYOUT, send_cq_channel$OFFSET, fieldValue);
    }

    private static final AddressLayout send_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("send_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final AddressLayout send_cq$layout() {
        return send_cq$LAYOUT;
    }

    private static final long send_cq$OFFSET = 368;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final long send_cq$offset() {
        return send_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static MemorySegment send_cq(MemorySegment struct) {
        return struct.get(send_cq$LAYOUT, send_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static void send_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(send_cq$LAYOUT, send_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout recv_cq_channel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_cq_channel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *recv_cq_channel
     * }
     */
    public static final AddressLayout recv_cq_channel$layout() {
        return recv_cq_channel$LAYOUT;
    }

    private static final long recv_cq_channel$OFFSET = 376;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *recv_cq_channel
     * }
     */
    public static final long recv_cq_channel$offset() {
        return recv_cq_channel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *recv_cq_channel
     * }
     */
    public static MemorySegment recv_cq_channel(MemorySegment struct) {
        return struct.get(recv_cq_channel$LAYOUT, recv_cq_channel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *recv_cq_channel
     * }
     */
    public static void recv_cq_channel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(recv_cq_channel$LAYOUT, recv_cq_channel$OFFSET, fieldValue);
    }

    private static final AddressLayout recv_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final AddressLayout recv_cq$layout() {
        return recv_cq$LAYOUT;
    }

    private static final long recv_cq$OFFSET = 384;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final long recv_cq$offset() {
        return recv_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static MemorySegment recv_cq(MemorySegment struct) {
        return struct.get(recv_cq$LAYOUT, recv_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static void recv_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(recv_cq$LAYOUT, recv_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout srq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final AddressLayout srq$layout() {
        return srq$LAYOUT;
    }

    private static final long srq$OFFSET = 392;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final long srq$offset() {
        return srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static MemorySegment srq(MemorySegment struct) {
        return struct.get(srq$LAYOUT, srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static void srq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srq$LAYOUT, srq$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 400;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final OfInt qp_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final OfInt qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 408;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static int qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, int fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

