// Generated by jextract

package io.surfworks.warpforge.io.ffi.rdmacm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rdma_ud_param {
 *     const void *private_data;
 *     uint8_t private_data_len;
 *     struct ibv_ah_attr ah_attr;
 *     uint32_t qp_num;
 *     uint32_t qkey;
 * }
 * }
 */
public class rdma_ud_param {

    rdma_ud_param() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        RdmaCm.C_POINTER.withName("private_data"),
        RdmaCm.C_CHAR.withName("private_data_len"),
        MemoryLayout.paddingLayout(7),
        ibv_ah_attr.layout().withName("ah_attr"),
        RdmaCm.C_INT.withName("qp_num"),
        RdmaCm.C_INT.withName("qkey")
    ).withName("rdma_ud_param");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout private_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("private_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static final AddressLayout private_data$layout() {
        return private_data$LAYOUT;
    }

    private static final long private_data$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static final long private_data$offset() {
        return private_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static MemorySegment private_data(MemorySegment struct) {
        return struct.get(private_data$LAYOUT, private_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *private_data
     * }
     */
    public static void private_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(private_data$LAYOUT, private_data$OFFSET, fieldValue);
    }

    private static final OfByte private_data_len$LAYOUT = (OfByte)$LAYOUT.select(groupElement("private_data_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static final OfByte private_data_len$layout() {
        return private_data_len$LAYOUT;
    }

    private static final long private_data_len$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static final long private_data_len$offset() {
        return private_data_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static byte private_data_len(MemorySegment struct) {
        return struct.get(private_data_len$LAYOUT, private_data_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t private_data_len
     * }
     */
    public static void private_data_len(MemorySegment struct, byte fieldValue) {
        struct.set(private_data_len$LAYOUT, private_data_len$OFFSET, fieldValue);
    }

    private static final GroupLayout ah_attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ah_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static final GroupLayout ah_attr$layout() {
        return ah_attr$LAYOUT;
    }

    private static final long ah_attr$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static final long ah_attr$offset() {
        return ah_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static MemorySegment ah_attr(MemorySegment struct) {
        return struct.asSlice(ah_attr$OFFSET, ah_attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static void ah_attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ah_attr$OFFSET, ah_attr$LAYOUT.byteSize());
    }

    private static final OfInt qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final OfInt qp_num$layout() {
        return qp_num$LAYOUT;
    }

    private static final long qp_num$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final long qp_num$offset() {
        return qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static int qp_num(MemorySegment struct) {
        return struct.get(qp_num$LAYOUT, qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static void qp_num(MemorySegment struct, int fieldValue) {
        struct.set(qp_num$LAYOUT, qp_num$OFFSET, fieldValue);
    }

    private static final OfInt qkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static final OfInt qkey$layout() {
        return qkey$LAYOUT;
    }

    private static final long qkey$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static final long qkey$offset() {
        return qkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static int qkey(MemorySegment struct) {
        return struct.get(qkey$LAYOUT, qkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static void qkey(MemorySegment struct, int fieldValue) {
        struct.set(qkey$LAYOUT, qkey$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

