// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_mem_map_params {
 *     uint64_t field_mask;
 *     void *address;
 *     size_t length;
 *     unsigned int flags;
 *     unsigned int prot;
 *     ucs_memory_type_t memory_type;
 *     const void *exported_memh_buffer;
 * }
 * }
 */
public class ucp_mem_map_params {

    ucp_mem_map_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_POINTER.withName("address"),
        Ucx.C_LONG.withName("length"),
        Ucx.C_INT.withName("flags"),
        Ucx.C_INT.withName("prot"),
        Ucx.C_INT.withName("memory_type"),
        MemoryLayout.paddingLayout(4),
        Ucx.C_POINTER.withName("exported_memh_buffer")
    ).withName("ucp_mem_map_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final AddressLayout address$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("address"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *address
     * }
     */
    public static final AddressLayout address$layout() {
        return address$LAYOUT;
    }

    private static final long address$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *address
     * }
     */
    public static final long address$offset() {
        return address$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *address
     * }
     */
    public static MemorySegment address(MemorySegment struct) {
        return struct.get(address$LAYOUT, address$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *address
     * }
     */
    public static void address(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(address$LAYOUT, address$OFFSET, fieldValue);
    }

    private static final OfLong length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t length
     * }
     */
    public static final OfLong length$layout() {
        return length$LAYOUT;
    }

    private static final long length$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t length
     * }
     */
    public static final long length$offset() {
        return length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t length
     * }
     */
    public static long length(MemorySegment struct) {
        return struct.get(length$LAYOUT, length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t length
     * }
     */
    public static void length(MemorySegment struct, long fieldValue) {
        struct.set(length$LAYOUT, length$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt prot$LAYOUT = (OfInt)$LAYOUT.select(groupElement("prot"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int prot
     * }
     */
    public static final OfInt prot$layout() {
        return prot$LAYOUT;
    }

    private static final long prot$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int prot
     * }
     */
    public static final long prot$offset() {
        return prot$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int prot
     * }
     */
    public static int prot(MemorySegment struct) {
        return struct.get(prot$LAYOUT, prot$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int prot
     * }
     */
    public static void prot(MemorySegment struct, int fieldValue) {
        struct.set(prot$LAYOUT, prot$OFFSET, fieldValue);
    }

    private static final OfInt memory_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("memory_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static final OfInt memory_type$layout() {
        return memory_type$LAYOUT;
    }

    private static final long memory_type$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static final long memory_type$offset() {
        return memory_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static int memory_type(MemorySegment struct) {
        return struct.get(memory_type$LAYOUT, memory_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static void memory_type(MemorySegment struct, int fieldValue) {
        struct.set(memory_type$LAYOUT, memory_type$OFFSET, fieldValue);
    }

    private static final AddressLayout exported_memh_buffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("exported_memh_buffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *exported_memh_buffer
     * }
     */
    public static final AddressLayout exported_memh_buffer$layout() {
        return exported_memh_buffer$LAYOUT;
    }

    private static final long exported_memh_buffer$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *exported_memh_buffer
     * }
     */
    public static final long exported_memh_buffer$offset() {
        return exported_memh_buffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *exported_memh_buffer
     * }
     */
    public static MemorySegment exported_memh_buffer(MemorySegment struct) {
        return struct.get(exported_memh_buffer$LAYOUT, exported_memh_buffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *exported_memh_buffer
     * }
     */
    public static void exported_memh_buffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(exported_memh_buffer$LAYOUT, exported_memh_buffer$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

