// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     uint64_t field_mask;
 *     char *debug_string;
 *     size_t debug_string_size;
 *     ucs_status_t status;
 *     ucs_memory_type_t mem_type;
 * }
 * }
 */
public class ucp_request_attr_t {

    ucp_request_attr_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_POINTER.withName("debug_string"),
        Ucx.C_LONG.withName("debug_string_size"),
        Ucx.C_INT.withName("status"),
        MemoryLayout.paddingLayout(3),
        Ucx.C_INT.withName("mem_type")
    ).withName("$anon$1855:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final AddressLayout debug_string$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("debug_string"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *debug_string
     * }
     */
    public static final AddressLayout debug_string$layout() {
        return debug_string$LAYOUT;
    }

    private static final long debug_string$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *debug_string
     * }
     */
    public static final long debug_string$offset() {
        return debug_string$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *debug_string
     * }
     */
    public static MemorySegment debug_string(MemorySegment struct) {
        return struct.get(debug_string$LAYOUT, debug_string$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *debug_string
     * }
     */
    public static void debug_string(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(debug_string$LAYOUT, debug_string$OFFSET, fieldValue);
    }

    private static final OfLong debug_string_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("debug_string_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t debug_string_size
     * }
     */
    public static final OfLong debug_string_size$layout() {
        return debug_string_size$LAYOUT;
    }

    private static final long debug_string_size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t debug_string_size
     * }
     */
    public static final long debug_string_size$offset() {
        return debug_string_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t debug_string_size
     * }
     */
    public static long debug_string_size(MemorySegment struct) {
        return struct.get(debug_string_size$LAYOUT, debug_string_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t debug_string_size
     * }
     */
    public static void debug_string_size(MemorySegment struct, long fieldValue) {
        struct.set(debug_string_size$LAYOUT, debug_string_size$OFFSET, fieldValue);
    }

    private static final OfInt status$LAYOUT = (OfInt)$LAYOUT.select(groupElement("status"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_status_t status
     * }
     */
    public static final OfInt status$layout() {
        return status$LAYOUT;
    }

    private static final long status$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_status_t status
     * }
     */
    public static final long status$offset() {
        return status$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_status_t status
     * }
     */
    public static int status(MemorySegment struct) {
        return struct.get(status$LAYOUT, status$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_status_t status
     * }
     */
    public static void status(MemorySegment struct, int fieldValue) {
        struct.set(status$LAYOUT, status$OFFSET, fieldValue);
    }

    private static final OfInt mem_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("mem_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_memory_type_t mem_type
     * }
     */
    public static final OfInt mem_type$layout() {
        return mem_type$LAYOUT;
    }

    private static final long mem_type$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_memory_type_t mem_type
     * }
     */
    public static final long mem_type$offset() {
        return mem_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_memory_type_t mem_type
     * }
     */
    public static int mem_type(MemorySegment struct) {
        return struct.get(mem_type$LAYOUT, mem_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_memory_type_t mem_type
     * }
     */
    public static void mem_type(MemorySegment struct, int fieldValue) {
        struct.set(mem_type$LAYOUT, mem_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

