// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_ep_params {
 *     uint64_t field_mask;
 *     const ucp_address_t *address;
 *     ucp_err_handling_mode_t err_mode;
 *     ucp_err_handler_t err_handler;
 *     void *user_data;
 *     unsigned int flags;
 *     ucs_sock_addr_t sockaddr;
 *     ucp_conn_request_h conn_request;
 *     const char *name;
 *     ucs_sock_addr_t local_sockaddr;
 * }
 * }
 */
public class ucp_ep_params {

    ucp_ep_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_POINTER.withName("address"),
        Ucx.C_INT.withName("err_mode"),
        MemoryLayout.paddingLayout(4),
        ucp_err_handler.layout().withName("err_handler"),
        Ucx.C_POINTER.withName("user_data"),
        Ucx.C_INT.withName("flags"),
        MemoryLayout.paddingLayout(4),
        ucs_sock_addr.layout().withName("sockaddr"),
        Ucx.C_POINTER.withName("conn_request"),
        Ucx.C_POINTER.withName("name"),
        ucs_sock_addr.layout().withName("local_sockaddr")
    ).withName("ucp_ep_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final AddressLayout address$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("address"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const ucp_address_t *address
     * }
     */
    public static final AddressLayout address$layout() {
        return address$LAYOUT;
    }

    private static final long address$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const ucp_address_t *address
     * }
     */
    public static final long address$offset() {
        return address$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const ucp_address_t *address
     * }
     */
    public static MemorySegment address(MemorySegment struct) {
        return struct.get(address$LAYOUT, address$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const ucp_address_t *address
     * }
     */
    public static void address(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(address$LAYOUT, address$OFFSET, fieldValue);
    }

    private static final OfInt err_mode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("err_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_err_handling_mode_t err_mode
     * }
     */
    public static final OfInt err_mode$layout() {
        return err_mode$LAYOUT;
    }

    private static final long err_mode$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_err_handling_mode_t err_mode
     * }
     */
    public static final long err_mode$offset() {
        return err_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_err_handling_mode_t err_mode
     * }
     */
    public static int err_mode(MemorySegment struct) {
        return struct.get(err_mode$LAYOUT, err_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_err_handling_mode_t err_mode
     * }
     */
    public static void err_mode(MemorySegment struct, int fieldValue) {
        struct.set(err_mode$LAYOUT, err_mode$OFFSET, fieldValue);
    }

    private static final GroupLayout err_handler$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("err_handler"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_err_handler_t err_handler
     * }
     */
    public static final GroupLayout err_handler$layout() {
        return err_handler$LAYOUT;
    }

    private static final long err_handler$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_err_handler_t err_handler
     * }
     */
    public static final long err_handler$offset() {
        return err_handler$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_err_handler_t err_handler
     * }
     */
    public static MemorySegment err_handler(MemorySegment struct) {
        return struct.asSlice(err_handler$OFFSET, err_handler$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_err_handler_t err_handler
     * }
     */
    public static void err_handler(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, err_handler$OFFSET, err_handler$LAYOUT.byteSize());
    }

    private static final AddressLayout user_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("user_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final AddressLayout user_data$layout() {
        return user_data$LAYOUT;
    }

    private static final long user_data$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final long user_data$offset() {
        return user_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static MemorySegment user_data(MemorySegment struct) {
        return struct.get(user_data$LAYOUT, user_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static void user_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(user_data$LAYOUT, user_data$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final GroupLayout sockaddr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("sockaddr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t sockaddr
     * }
     */
    public static final GroupLayout sockaddr$layout() {
        return sockaddr$LAYOUT;
    }

    private static final long sockaddr$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t sockaddr
     * }
     */
    public static final long sockaddr$offset() {
        return sockaddr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t sockaddr
     * }
     */
    public static MemorySegment sockaddr(MemorySegment struct) {
        return struct.asSlice(sockaddr$OFFSET, sockaddr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t sockaddr
     * }
     */
    public static void sockaddr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, sockaddr$OFFSET, sockaddr$LAYOUT.byteSize());
    }

    private static final AddressLayout conn_request$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("conn_request"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_conn_request_h conn_request
     * }
     */
    public static final AddressLayout conn_request$layout() {
        return conn_request$LAYOUT;
    }

    private static final long conn_request$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_conn_request_h conn_request
     * }
     */
    public static final long conn_request$offset() {
        return conn_request$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_conn_request_h conn_request
     * }
     */
    public static MemorySegment conn_request(MemorySegment struct) {
        return struct.get(conn_request$LAYOUT, conn_request$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_conn_request_h conn_request
     * }
     */
    public static void conn_request(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(conn_request$LAYOUT, conn_request$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final GroupLayout local_sockaddr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("local_sockaddr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t local_sockaddr
     * }
     */
    public static final GroupLayout local_sockaddr$layout() {
        return local_sockaddr$LAYOUT;
    }

    private static final long local_sockaddr$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t local_sockaddr
     * }
     */
    public static final long local_sockaddr$offset() {
        return local_sockaddr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t local_sockaddr
     * }
     */
    public static MemorySegment local_sockaddr(MemorySegment struct) {
        return struct.asSlice(local_sockaddr$OFFSET, local_sockaddr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_sock_addr_t local_sockaddr
     * }
     */
    public static void local_sockaddr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, local_sockaddr$OFFSET, local_sockaddr$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

