// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_ep_attr {
 *     uint64_t field_mask;
 *     char name[32];
 *     struct sockaddr_storage local_sockaddr;
 *     struct sockaddr_storage remote_sockaddr;
 *     ucp_transports_t transports;
 *     void *user_data;
 * }
 * }
 */
public class ucp_ep_attr {

    ucp_ep_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        MemoryLayout.sequenceLayout(32, Ucx.C_CHAR).withName("name"),
        sockaddr_storage.layout().withName("local_sockaddr"),
        sockaddr_storage.layout().withName("remote_sockaddr"),
        ucp_transports_t.layout().withName("transports"),
        Ucx.C_POINTER.withName("user_data")
    ).withName("ucp_ep_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final SequenceLayout name$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static final SequenceLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.asSlice(name$OFFSET, name$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, name$OFFSET, name$LAYOUT.byteSize());
    }

    private static long[] name$DIMS = { 32 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static long[] name$dimensions() {
        return name$DIMS;
    }
    private static final VarHandle name$ELEM_HANDLE = name$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static byte name(MemorySegment struct, long index0) {
        return (byte)name$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static void name(MemorySegment struct, long index0, byte fieldValue) {
        name$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final GroupLayout local_sockaddr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("local_sockaddr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_storage local_sockaddr
     * }
     */
    public static final GroupLayout local_sockaddr$layout() {
        return local_sockaddr$LAYOUT;
    }

    private static final long local_sockaddr$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_storage local_sockaddr
     * }
     */
    public static final long local_sockaddr$offset() {
        return local_sockaddr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage local_sockaddr
     * }
     */
    public static MemorySegment local_sockaddr(MemorySegment struct) {
        return struct.asSlice(local_sockaddr$OFFSET, local_sockaddr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage local_sockaddr
     * }
     */
    public static void local_sockaddr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, local_sockaddr$OFFSET, local_sockaddr$LAYOUT.byteSize());
    }

    private static final GroupLayout remote_sockaddr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("remote_sockaddr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct sockaddr_storage remote_sockaddr
     * }
     */
    public static final GroupLayout remote_sockaddr$layout() {
        return remote_sockaddr$LAYOUT;
    }

    private static final long remote_sockaddr$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct sockaddr_storage remote_sockaddr
     * }
     */
    public static final long remote_sockaddr$offset() {
        return remote_sockaddr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage remote_sockaddr
     * }
     */
    public static MemorySegment remote_sockaddr(MemorySegment struct) {
        return struct.asSlice(remote_sockaddr$OFFSET, remote_sockaddr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct sockaddr_storage remote_sockaddr
     * }
     */
    public static void remote_sockaddr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, remote_sockaddr$OFFSET, remote_sockaddr$LAYOUT.byteSize());
    }

    private static final GroupLayout transports$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("transports"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_transports_t transports
     * }
     */
    public static final GroupLayout transports$layout() {
        return transports$LAYOUT;
    }

    private static final long transports$OFFSET = 296;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_transports_t transports
     * }
     */
    public static final long transports$offset() {
        return transports$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_transports_t transports
     * }
     */
    public static MemorySegment transports(MemorySegment struct) {
        return struct.asSlice(transports$OFFSET, transports$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_transports_t transports
     * }
     */
    public static void transports(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, transports$OFFSET, transports$LAYOUT.byteSize());
    }

    private static final AddressLayout user_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("user_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final AddressLayout user_data$layout() {
        return user_data$LAYOUT;
    }

    private static final long user_data$OFFSET = 320;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final long user_data$offset() {
        return user_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static MemorySegment user_data(MemorySegment struct) {
        return struct.get(user_data$LAYOUT, user_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static void user_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(user_data$LAYOUT, user_data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

