// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     uint32_t op_attr_mask;
 *     uint32_t flags;
 *     void *request;
 *     union {
 *         ucp_send_nbx_callback_t send;
 *         ucp_tag_recv_nbx_callback_t recv;
 *         ucp_stream_recv_nbx_callback_t recv_stream;
 *         ucp_am_recv_data_nbx_callback_t recv_am;
 *     } cb;
 *     ucp_datatype_t datatype;
 *     void *user_data;
 *     void *reply_buffer;
 *     ucs_memory_type_t memory_type;
 *     union {
 *         size_t *length;
 *         ucp_tag_recv_info_t *tag_info;
 *     } recv_info;
 *     ucp_mem_h memh;
 * }
 * }
 */
public class ucp_request_param_t {

    ucp_request_param_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_INT.withName("op_attr_mask"),
        Ucx.C_INT.withName("flags"),
        Ucx.C_POINTER.withName("request"),
        ucp_request_param_t.cb.layout().withName("cb"),
        Ucx.C_LONG.withName("datatype"),
        Ucx.C_POINTER.withName("user_data"),
        Ucx.C_POINTER.withName("reply_buffer"),
        Ucx.C_INT.withName("memory_type"),
        MemoryLayout.paddingLayout(4),
        ucp_request_param_t.recv_info.layout().withName("recv_info"),
        Ucx.C_POINTER.withName("memh")
    ).withName("$anon$1767:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt op_attr_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("op_attr_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t op_attr_mask
     * }
     */
    public static final OfInt op_attr_mask$layout() {
        return op_attr_mask$LAYOUT;
    }

    private static final long op_attr_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t op_attr_mask
     * }
     */
    public static final long op_attr_mask$offset() {
        return op_attr_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t op_attr_mask
     * }
     */
    public static int op_attr_mask(MemorySegment struct) {
        return struct.get(op_attr_mask$LAYOUT, op_attr_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t op_attr_mask
     * }
     */
    public static void op_attr_mask(MemorySegment struct, int fieldValue) {
        struct.set(op_attr_mask$LAYOUT, op_attr_mask$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final AddressLayout request$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("request"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *request
     * }
     */
    public static final AddressLayout request$layout() {
        return request$LAYOUT;
    }

    private static final long request$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *request
     * }
     */
    public static final long request$offset() {
        return request$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *request
     * }
     */
    public static MemorySegment request(MemorySegment struct) {
        return struct.get(request$LAYOUT, request$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *request
     * }
     */
    public static void request(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(request$LAYOUT, request$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union {
     *     ucp_send_nbx_callback_t send;
     *     ucp_tag_recv_nbx_callback_t recv;
     *     ucp_stream_recv_nbx_callback_t recv_stream;
     *     ucp_am_recv_data_nbx_callback_t recv_am;
     * }
     * }
     */
    public static class cb {

        cb() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            Ucx.C_POINTER.withName("send"),
            Ucx.C_POINTER.withName("recv"),
            Ucx.C_POINTER.withName("recv_stream"),
            Ucx.C_POINTER.withName("recv_am")
        ).withName("$anon$1790:5");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final AddressLayout send$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("send"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ucp_send_nbx_callback_t send
         * }
         */
        public static final AddressLayout send$layout() {
            return send$LAYOUT;
        }

        private static final long send$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ucp_send_nbx_callback_t send
         * }
         */
        public static final long send$offset() {
            return send$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ucp_send_nbx_callback_t send
         * }
         */
        public static MemorySegment send(MemorySegment union) {
            return union.get(send$LAYOUT, send$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ucp_send_nbx_callback_t send
         * }
         */
        public static void send(MemorySegment union, MemorySegment fieldValue) {
            union.set(send$LAYOUT, send$OFFSET, fieldValue);
        }

        private static final AddressLayout recv$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ucp_tag_recv_nbx_callback_t recv
         * }
         */
        public static final AddressLayout recv$layout() {
            return recv$LAYOUT;
        }

        private static final long recv$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ucp_tag_recv_nbx_callback_t recv
         * }
         */
        public static final long recv$offset() {
            return recv$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ucp_tag_recv_nbx_callback_t recv
         * }
         */
        public static MemorySegment recv(MemorySegment union) {
            return union.get(recv$LAYOUT, recv$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ucp_tag_recv_nbx_callback_t recv
         * }
         */
        public static void recv(MemorySegment union, MemorySegment fieldValue) {
            union.set(recv$LAYOUT, recv$OFFSET, fieldValue);
        }

        private static final AddressLayout recv_stream$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_stream"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ucp_stream_recv_nbx_callback_t recv_stream
         * }
         */
        public static final AddressLayout recv_stream$layout() {
            return recv_stream$LAYOUT;
        }

        private static final long recv_stream$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ucp_stream_recv_nbx_callback_t recv_stream
         * }
         */
        public static final long recv_stream$offset() {
            return recv_stream$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ucp_stream_recv_nbx_callback_t recv_stream
         * }
         */
        public static MemorySegment recv_stream(MemorySegment union) {
            return union.get(recv_stream$LAYOUT, recv_stream$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ucp_stream_recv_nbx_callback_t recv_stream
         * }
         */
        public static void recv_stream(MemorySegment union, MemorySegment fieldValue) {
            union.set(recv_stream$LAYOUT, recv_stream$OFFSET, fieldValue);
        }

        private static final AddressLayout recv_am$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_am"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ucp_am_recv_data_nbx_callback_t recv_am
         * }
         */
        public static final AddressLayout recv_am$layout() {
            return recv_am$LAYOUT;
        }

        private static final long recv_am$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ucp_am_recv_data_nbx_callback_t recv_am
         * }
         */
        public static final long recv_am$offset() {
            return recv_am$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ucp_am_recv_data_nbx_callback_t recv_am
         * }
         */
        public static MemorySegment recv_am(MemorySegment union) {
            return union.get(recv_am$LAYOUT, recv_am$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ucp_am_recv_data_nbx_callback_t recv_am
         * }
         */
        public static void recv_am(MemorySegment union, MemorySegment fieldValue) {
            union.set(recv_am$LAYOUT, recv_am$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout cb$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cb"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     ucp_send_nbx_callback_t send;
     *     ucp_tag_recv_nbx_callback_t recv;
     *     ucp_stream_recv_nbx_callback_t recv_stream;
     *     ucp_am_recv_data_nbx_callback_t recv_am;
     * } cb
     * }
     */
    public static final GroupLayout cb$layout() {
        return cb$LAYOUT;
    }

    private static final long cb$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     ucp_send_nbx_callback_t send;
     *     ucp_tag_recv_nbx_callback_t recv;
     *     ucp_stream_recv_nbx_callback_t recv_stream;
     *     ucp_am_recv_data_nbx_callback_t recv_am;
     * } cb
     * }
     */
    public static final long cb$offset() {
        return cb$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     ucp_send_nbx_callback_t send;
     *     ucp_tag_recv_nbx_callback_t recv;
     *     ucp_stream_recv_nbx_callback_t recv_stream;
     *     ucp_am_recv_data_nbx_callback_t recv_am;
     * } cb
     * }
     */
    public static MemorySegment cb(MemorySegment struct) {
        return struct.asSlice(cb$OFFSET, cb$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     ucp_send_nbx_callback_t send;
     *     ucp_tag_recv_nbx_callback_t recv;
     *     ucp_stream_recv_nbx_callback_t recv_stream;
     *     ucp_am_recv_data_nbx_callback_t recv_am;
     * } cb
     * }
     */
    public static void cb(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cb$OFFSET, cb$LAYOUT.byteSize());
    }

    private static final OfLong datatype$LAYOUT = (OfLong)$LAYOUT.select(groupElement("datatype"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_datatype_t datatype
     * }
     */
    public static final OfLong datatype$layout() {
        return datatype$LAYOUT;
    }

    private static final long datatype$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_datatype_t datatype
     * }
     */
    public static final long datatype$offset() {
        return datatype$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_datatype_t datatype
     * }
     */
    public static long datatype(MemorySegment struct) {
        return struct.get(datatype$LAYOUT, datatype$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_datatype_t datatype
     * }
     */
    public static void datatype(MemorySegment struct, long fieldValue) {
        struct.set(datatype$LAYOUT, datatype$OFFSET, fieldValue);
    }

    private static final AddressLayout user_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("user_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final AddressLayout user_data$layout() {
        return user_data$LAYOUT;
    }

    private static final long user_data$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final long user_data$offset() {
        return user_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static MemorySegment user_data(MemorySegment struct) {
        return struct.get(user_data$LAYOUT, user_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static void user_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(user_data$LAYOUT, user_data$OFFSET, fieldValue);
    }

    private static final AddressLayout reply_buffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("reply_buffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *reply_buffer
     * }
     */
    public static final AddressLayout reply_buffer$layout() {
        return reply_buffer$LAYOUT;
    }

    private static final long reply_buffer$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *reply_buffer
     * }
     */
    public static final long reply_buffer$offset() {
        return reply_buffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *reply_buffer
     * }
     */
    public static MemorySegment reply_buffer(MemorySegment struct) {
        return struct.get(reply_buffer$LAYOUT, reply_buffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *reply_buffer
     * }
     */
    public static void reply_buffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(reply_buffer$LAYOUT, reply_buffer$OFFSET, fieldValue);
    }

    private static final OfInt memory_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("memory_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static final OfInt memory_type$layout() {
        return memory_type$LAYOUT;
    }

    private static final long memory_type$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static final long memory_type$offset() {
        return memory_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static int memory_type(MemorySegment struct) {
        return struct.get(memory_type$LAYOUT, memory_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_memory_type_t memory_type
     * }
     */
    public static void memory_type(MemorySegment struct, int fieldValue) {
        struct.set(memory_type$LAYOUT, memory_type$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union {
     *     size_t *length;
     *     ucp_tag_recv_info_t *tag_info;
     * }
     * }
     */
    public static class recv_info {

        recv_info() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            Ucx.C_POINTER.withName("length"),
            Ucx.C_POINTER.withName("tag_info")
        ).withName("$anon$1830:5");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final AddressLayout length$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("length"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * size_t *length
         * }
         */
        public static final AddressLayout length$layout() {
            return length$LAYOUT;
        }

        private static final long length$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * size_t *length
         * }
         */
        public static final long length$offset() {
            return length$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * size_t *length
         * }
         */
        public static MemorySegment length(MemorySegment union) {
            return union.get(length$LAYOUT, length$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * size_t *length
         * }
         */
        public static void length(MemorySegment union, MemorySegment fieldValue) {
            union.set(length$LAYOUT, length$OFFSET, fieldValue);
        }

        private static final AddressLayout tag_info$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("tag_info"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ucp_tag_recv_info_t *tag_info
         * }
         */
        public static final AddressLayout tag_info$layout() {
            return tag_info$LAYOUT;
        }

        private static final long tag_info$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ucp_tag_recv_info_t *tag_info
         * }
         */
        public static final long tag_info$offset() {
            return tag_info$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ucp_tag_recv_info_t *tag_info
         * }
         */
        public static MemorySegment tag_info(MemorySegment union) {
            return union.get(tag_info$LAYOUT, tag_info$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ucp_tag_recv_info_t *tag_info
         * }
         */
        public static void tag_info(MemorySegment union, MemorySegment fieldValue) {
            union.set(tag_info$LAYOUT, tag_info$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout recv_info$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("recv_info"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     size_t *length;
     *     ucp_tag_recv_info_t *tag_info;
     * } recv_info
     * }
     */
    public static final GroupLayout recv_info$layout() {
        return recv_info$LAYOUT;
    }

    private static final long recv_info$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     size_t *length;
     *     ucp_tag_recv_info_t *tag_info;
     * } recv_info
     * }
     */
    public static final long recv_info$offset() {
        return recv_info$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     size_t *length;
     *     ucp_tag_recv_info_t *tag_info;
     * } recv_info
     * }
     */
    public static MemorySegment recv_info(MemorySegment struct) {
        return struct.asSlice(recv_info$OFFSET, recv_info$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     size_t *length;
     *     ucp_tag_recv_info_t *tag_info;
     * } recv_info
     * }
     */
    public static void recv_info(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, recv_info$OFFSET, recv_info$LAYOUT.byteSize());
    }

    private static final AddressLayout memh$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("memh"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_mem_h memh
     * }
     */
    public static final AddressLayout memh$layout() {
        return memh$LAYOUT;
    }

    private static final long memh$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_mem_h memh
     * }
     */
    public static final long memh$offset() {
        return memh$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_mem_h memh
     * }
     */
    public static MemorySegment memh(MemorySegment struct) {
        return struct.get(memh$LAYOUT, memh$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_mem_h memh
     * }
     */
    public static void memh(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(memh$LAYOUT, memh$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

