// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_worker_attr {
 *     uint64_t field_mask;
 *     ucs_thread_mode_t thread_mode;
 *     uint32_t address_flags;
 *     ucp_address_t *address;
 *     size_t address_length;
 *     size_t max_am_header;
 *     char name[32];
 *     size_t max_debug_string;
 * }
 * }
 */
public class ucp_worker_attr {

    ucp_worker_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_INT.withName("thread_mode"),
        Ucx.C_INT.withName("address_flags"),
        Ucx.C_POINTER.withName("address"),
        Ucx.C_LONG.withName("address_length"),
        Ucx.C_LONG.withName("max_am_header"),
        MemoryLayout.sequenceLayout(32, Ucx.C_CHAR).withName("name"),
        Ucx.C_LONG.withName("max_debug_string")
    ).withName("ucp_worker_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final OfInt thread_mode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("thread_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static final OfInt thread_mode$layout() {
        return thread_mode$LAYOUT;
    }

    private static final long thread_mode$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static final long thread_mode$offset() {
        return thread_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static int thread_mode(MemorySegment struct) {
        return struct.get(thread_mode$LAYOUT, thread_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static void thread_mode(MemorySegment struct, int fieldValue) {
        struct.set(thread_mode$LAYOUT, thread_mode$OFFSET, fieldValue);
    }

    private static final OfInt address_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("address_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t address_flags
     * }
     */
    public static final OfInt address_flags$layout() {
        return address_flags$LAYOUT;
    }

    private static final long address_flags$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t address_flags
     * }
     */
    public static final long address_flags$offset() {
        return address_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t address_flags
     * }
     */
    public static int address_flags(MemorySegment struct) {
        return struct.get(address_flags$LAYOUT, address_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t address_flags
     * }
     */
    public static void address_flags(MemorySegment struct, int fieldValue) {
        struct.set(address_flags$LAYOUT, address_flags$OFFSET, fieldValue);
    }

    private static final AddressLayout address$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("address"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_address_t *address
     * }
     */
    public static final AddressLayout address$layout() {
        return address$LAYOUT;
    }

    private static final long address$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_address_t *address
     * }
     */
    public static final long address$offset() {
        return address$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_address_t *address
     * }
     */
    public static MemorySegment address(MemorySegment struct) {
        return struct.get(address$LAYOUT, address$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_address_t *address
     * }
     */
    public static void address(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(address$LAYOUT, address$OFFSET, fieldValue);
    }

    private static final OfLong address_length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("address_length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t address_length
     * }
     */
    public static final OfLong address_length$layout() {
        return address_length$LAYOUT;
    }

    private static final long address_length$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t address_length
     * }
     */
    public static final long address_length$offset() {
        return address_length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t address_length
     * }
     */
    public static long address_length(MemorySegment struct) {
        return struct.get(address_length$LAYOUT, address_length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t address_length
     * }
     */
    public static void address_length(MemorySegment struct, long fieldValue) {
        struct.set(address_length$LAYOUT, address_length$OFFSET, fieldValue);
    }

    private static final OfLong max_am_header$LAYOUT = (OfLong)$LAYOUT.select(groupElement("max_am_header"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t max_am_header
     * }
     */
    public static final OfLong max_am_header$layout() {
        return max_am_header$LAYOUT;
    }

    private static final long max_am_header$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t max_am_header
     * }
     */
    public static final long max_am_header$offset() {
        return max_am_header$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t max_am_header
     * }
     */
    public static long max_am_header(MemorySegment struct) {
        return struct.get(max_am_header$LAYOUT, max_am_header$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t max_am_header
     * }
     */
    public static void max_am_header(MemorySegment struct, long fieldValue) {
        struct.set(max_am_header$LAYOUT, max_am_header$OFFSET, fieldValue);
    }

    private static final SequenceLayout name$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static final SequenceLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.asSlice(name$OFFSET, name$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, name$OFFSET, name$LAYOUT.byteSize());
    }

    private static long[] name$DIMS = { 32 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static long[] name$dimensions() {
        return name$DIMS;
    }
    private static final VarHandle name$ELEM_HANDLE = name$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static byte name(MemorySegment struct, long index0) {
        return (byte)name$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static void name(MemorySegment struct, long index0, byte fieldValue) {
        name$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfLong max_debug_string$LAYOUT = (OfLong)$LAYOUT.select(groupElement("max_debug_string"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t max_debug_string
     * }
     */
    public static final OfLong max_debug_string$layout() {
        return max_debug_string$LAYOUT;
    }

    private static final long max_debug_string$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t max_debug_string
     * }
     */
    public static final long max_debug_string$offset() {
        return max_debug_string$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t max_debug_string
     * }
     */
    public static long max_debug_string(MemorySegment struct) {
        return struct.get(max_debug_string$LAYOUT, max_debug_string$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t max_debug_string
     * }
     */
    public static void max_debug_string(MemorySegment struct, long fieldValue) {
        struct.set(max_debug_string$LAYOUT, max_debug_string$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

