// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_context_attr {
 *     uint64_t field_mask;
 *     size_t request_size;
 *     ucs_thread_mode_t thread_mode;
 *     uint64_t memory_types;
 *     char name[32];
 *     size_t device_counter_size;
 * }
 * }
 */
public class ucp_context_attr {

    ucp_context_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_LONG.withName("request_size"),
        Ucx.C_INT.withName("thread_mode"),
        MemoryLayout.paddingLayout(4),
        Ucx.C_LONG.withName("memory_types"),
        MemoryLayout.sequenceLayout(32, Ucx.C_CHAR).withName("name"),
        Ucx.C_LONG.withName("device_counter_size")
    ).withName("ucp_context_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final OfLong request_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("request_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static final OfLong request_size$layout() {
        return request_size$LAYOUT;
    }

    private static final long request_size$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static final long request_size$offset() {
        return request_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static long request_size(MemorySegment struct) {
        return struct.get(request_size$LAYOUT, request_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static void request_size(MemorySegment struct, long fieldValue) {
        struct.set(request_size$LAYOUT, request_size$OFFSET, fieldValue);
    }

    private static final OfInt thread_mode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("thread_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static final OfInt thread_mode$layout() {
        return thread_mode$LAYOUT;
    }

    private static final long thread_mode$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static final long thread_mode$offset() {
        return thread_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static int thread_mode(MemorySegment struct) {
        return struct.get(thread_mode$LAYOUT, thread_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static void thread_mode(MemorySegment struct, int fieldValue) {
        struct.set(thread_mode$LAYOUT, thread_mode$OFFSET, fieldValue);
    }

    private static final OfLong memory_types$LAYOUT = (OfLong)$LAYOUT.select(groupElement("memory_types"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t memory_types
     * }
     */
    public static final OfLong memory_types$layout() {
        return memory_types$LAYOUT;
    }

    private static final long memory_types$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t memory_types
     * }
     */
    public static final long memory_types$offset() {
        return memory_types$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t memory_types
     * }
     */
    public static long memory_types(MemorySegment struct) {
        return struct.get(memory_types$LAYOUT, memory_types$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t memory_types
     * }
     */
    public static void memory_types(MemorySegment struct, long fieldValue) {
        struct.set(memory_types$LAYOUT, memory_types$OFFSET, fieldValue);
    }

    private static final SequenceLayout name$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static final SequenceLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.asSlice(name$OFFSET, name$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, name$OFFSET, name$LAYOUT.byteSize());
    }

    private static long[] name$DIMS = { 32 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static long[] name$dimensions() {
        return name$DIMS;
    }
    private static final VarHandle name$ELEM_HANDLE = name$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static byte name(MemorySegment struct, long index0) {
        return (byte)name$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char name[32]
     * }
     */
    public static void name(MemorySegment struct, long index0, byte fieldValue) {
        name$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfLong device_counter_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("device_counter_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t device_counter_size
     * }
     */
    public static final OfLong device_counter_size$layout() {
        return device_counter_size$LAYOUT;
    }

    private static final long device_counter_size$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t device_counter_size
     * }
     */
    public static final long device_counter_size$offset() {
        return device_counter_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t device_counter_size
     * }
     */
    public static long device_counter_size(MemorySegment struct) {
        return struct.get(device_counter_size$LAYOUT, device_counter_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t device_counter_size
     * }
     */
    public static void device_counter_size(MemorySegment struct, long fieldValue) {
        struct.set(device_counter_size$LAYOUT, device_counter_size$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

