// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_worker_params {
 *     uint64_t field_mask;
 *     ucs_thread_mode_t thread_mode;
 *     ucs_cpu_set_t cpu_mask;
 *     unsigned int events;
 *     void *user_data;
 *     int event_fd;
 *     uint64_t flags;
 *     const char *name;
 *     size_t am_alignment;
 *     uint64_t client_id;
 * }
 * }
 */
public class ucp_worker_params {

    ucp_worker_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_INT.withName("thread_mode"),
        MemoryLayout.paddingLayout(4),
        ucs_cpu_set_t.layout().withName("cpu_mask"),
        Ucx.C_INT.withName("events"),
        MemoryLayout.paddingLayout(4),
        Ucx.C_POINTER.withName("user_data"),
        Ucx.C_INT.withName("event_fd"),
        MemoryLayout.paddingLayout(4),
        Ucx.C_LONG.withName("flags"),
        Ucx.C_POINTER.withName("name"),
        Ucx.C_LONG.withName("am_alignment"),
        Ucx.C_LONG.withName("client_id")
    ).withName("ucp_worker_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final OfInt thread_mode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("thread_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static final OfInt thread_mode$layout() {
        return thread_mode$LAYOUT;
    }

    private static final long thread_mode$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static final long thread_mode$offset() {
        return thread_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static int thread_mode(MemorySegment struct) {
        return struct.get(thread_mode$LAYOUT, thread_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_thread_mode_t thread_mode
     * }
     */
    public static void thread_mode(MemorySegment struct, int fieldValue) {
        struct.set(thread_mode$LAYOUT, thread_mode$OFFSET, fieldValue);
    }

    private static final GroupLayout cpu_mask$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cpu_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucs_cpu_set_t cpu_mask
     * }
     */
    public static final GroupLayout cpu_mask$layout() {
        return cpu_mask$LAYOUT;
    }

    private static final long cpu_mask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucs_cpu_set_t cpu_mask
     * }
     */
    public static final long cpu_mask$offset() {
        return cpu_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucs_cpu_set_t cpu_mask
     * }
     */
    public static MemorySegment cpu_mask(MemorySegment struct) {
        return struct.asSlice(cpu_mask$OFFSET, cpu_mask$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucs_cpu_set_t cpu_mask
     * }
     */
    public static void cpu_mask(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cpu_mask$OFFSET, cpu_mask$LAYOUT.byteSize());
    }

    private static final OfInt events$LAYOUT = (OfInt)$LAYOUT.select(groupElement("events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int events
     * }
     */
    public static final OfInt events$layout() {
        return events$LAYOUT;
    }

    private static final long events$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int events
     * }
     */
    public static final long events$offset() {
        return events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int events
     * }
     */
    public static int events(MemorySegment struct) {
        return struct.get(events$LAYOUT, events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int events
     * }
     */
    public static void events(MemorySegment struct, int fieldValue) {
        struct.set(events$LAYOUT, events$OFFSET, fieldValue);
    }

    private static final AddressLayout user_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("user_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final AddressLayout user_data$layout() {
        return user_data$LAYOUT;
    }

    private static final long user_data$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static final long user_data$offset() {
        return user_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static MemorySegment user_data(MemorySegment struct) {
        return struct.get(user_data$LAYOUT, user_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *user_data
     * }
     */
    public static void user_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(user_data$LAYOUT, user_data$OFFSET, fieldValue);
    }

    private static final OfInt event_fd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("event_fd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int event_fd
     * }
     */
    public static final OfInt event_fd$layout() {
        return event_fd$LAYOUT;
    }

    private static final long event_fd$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int event_fd
     * }
     */
    public static final long event_fd$offset() {
        return event_fd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int event_fd
     * }
     */
    public static int event_fd(MemorySegment struct) {
        return struct.get(event_fd$LAYOUT, event_fd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int event_fd
     * }
     */
    public static void event_fd(MemorySegment struct, int fieldValue) {
        struct.set(event_fd$LAYOUT, event_fd$OFFSET, fieldValue);
    }

    private static final OfLong flags$LAYOUT = (OfLong)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static final OfLong flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static long flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static void flags(MemorySegment struct, long fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final OfLong am_alignment$LAYOUT = (OfLong)$LAYOUT.select(groupElement("am_alignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t am_alignment
     * }
     */
    public static final OfLong am_alignment$layout() {
        return am_alignment$LAYOUT;
    }

    private static final long am_alignment$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t am_alignment
     * }
     */
    public static final long am_alignment$offset() {
        return am_alignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t am_alignment
     * }
     */
    public static long am_alignment(MemorySegment struct) {
        return struct.get(am_alignment$LAYOUT, am_alignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t am_alignment
     * }
     */
    public static void am_alignment(MemorySegment struct, long fieldValue) {
        struct.set(am_alignment$LAYOUT, am_alignment$OFFSET, fieldValue);
    }

    private static final OfLong client_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("client_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static final OfLong client_id$layout() {
        return client_id$LAYOUT;
    }

    private static final long client_id$OFFSET = 192;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static final long client_id$offset() {
        return client_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static long client_id(MemorySegment struct) {
        return struct.get(client_id$LAYOUT, client_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static void client_id(MemorySegment struct, long fieldValue) {
        struct.set(client_id$LAYOUT, client_id$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

