// Generated by jextract

package io.surfworks.warpforge.io.ffi.ucx;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ucp_params {
 *     uint64_t field_mask;
 *     uint64_t features;
 *     size_t request_size;
 *     ucp_request_init_callback_t request_init;
 *     ucp_request_cleanup_callback_t request_cleanup;
 *     uint64_t tag_sender_mask;
 *     int mt_workers_shared;
 *     size_t estimated_num_eps;
 *     size_t estimated_num_ppn;
 *     const char *name;
 *     size_t node_local_id;
 * }
 * }
 */
public class ucp_params {

    ucp_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ucx.C_LONG.withName("field_mask"),
        Ucx.C_LONG.withName("features"),
        Ucx.C_LONG.withName("request_size"),
        Ucx.C_POINTER.withName("request_init"),
        Ucx.C_POINTER.withName("request_cleanup"),
        Ucx.C_LONG.withName("tag_sender_mask"),
        Ucx.C_INT.withName("mt_workers_shared"),
        MemoryLayout.paddingLayout(4),
        Ucx.C_LONG.withName("estimated_num_eps"),
        Ucx.C_LONG.withName("estimated_num_ppn"),
        Ucx.C_POINTER.withName("name"),
        Ucx.C_LONG.withName("node_local_id")
    ).withName("ucp_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong field_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("field_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final OfLong field_mask$layout() {
        return field_mask$LAYOUT;
    }

    private static final long field_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static final long field_mask$offset() {
        return field_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static long field_mask(MemorySegment struct) {
        return struct.get(field_mask$LAYOUT, field_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t field_mask
     * }
     */
    public static void field_mask(MemorySegment struct, long fieldValue) {
        struct.set(field_mask$LAYOUT, field_mask$OFFSET, fieldValue);
    }

    private static final OfLong features$LAYOUT = (OfLong)$LAYOUT.select(groupElement("features"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t features
     * }
     */
    public static final OfLong features$layout() {
        return features$LAYOUT;
    }

    private static final long features$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t features
     * }
     */
    public static final long features$offset() {
        return features$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t features
     * }
     */
    public static long features(MemorySegment struct) {
        return struct.get(features$LAYOUT, features$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t features
     * }
     */
    public static void features(MemorySegment struct, long fieldValue) {
        struct.set(features$LAYOUT, features$OFFSET, fieldValue);
    }

    private static final OfLong request_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("request_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static final OfLong request_size$layout() {
        return request_size$LAYOUT;
    }

    private static final long request_size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static final long request_size$offset() {
        return request_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static long request_size(MemorySegment struct) {
        return struct.get(request_size$LAYOUT, request_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t request_size
     * }
     */
    public static void request_size(MemorySegment struct, long fieldValue) {
        struct.set(request_size$LAYOUT, request_size$OFFSET, fieldValue);
    }

    private static final AddressLayout request_init$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("request_init"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_request_init_callback_t request_init
     * }
     */
    public static final AddressLayout request_init$layout() {
        return request_init$LAYOUT;
    }

    private static final long request_init$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_request_init_callback_t request_init
     * }
     */
    public static final long request_init$offset() {
        return request_init$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_request_init_callback_t request_init
     * }
     */
    public static MemorySegment request_init(MemorySegment struct) {
        return struct.get(request_init$LAYOUT, request_init$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_request_init_callback_t request_init
     * }
     */
    public static void request_init(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(request_init$LAYOUT, request_init$OFFSET, fieldValue);
    }

    private static final AddressLayout request_cleanup$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("request_cleanup"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ucp_request_cleanup_callback_t request_cleanup
     * }
     */
    public static final AddressLayout request_cleanup$layout() {
        return request_cleanup$LAYOUT;
    }

    private static final long request_cleanup$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ucp_request_cleanup_callback_t request_cleanup
     * }
     */
    public static final long request_cleanup$offset() {
        return request_cleanup$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ucp_request_cleanup_callback_t request_cleanup
     * }
     */
    public static MemorySegment request_cleanup(MemorySegment struct) {
        return struct.get(request_cleanup$LAYOUT, request_cleanup$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ucp_request_cleanup_callback_t request_cleanup
     * }
     */
    public static void request_cleanup(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(request_cleanup$LAYOUT, request_cleanup$OFFSET, fieldValue);
    }

    private static final OfLong tag_sender_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("tag_sender_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t tag_sender_mask
     * }
     */
    public static final OfLong tag_sender_mask$layout() {
        return tag_sender_mask$LAYOUT;
    }

    private static final long tag_sender_mask$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t tag_sender_mask
     * }
     */
    public static final long tag_sender_mask$offset() {
        return tag_sender_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t tag_sender_mask
     * }
     */
    public static long tag_sender_mask(MemorySegment struct) {
        return struct.get(tag_sender_mask$LAYOUT, tag_sender_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t tag_sender_mask
     * }
     */
    public static void tag_sender_mask(MemorySegment struct, long fieldValue) {
        struct.set(tag_sender_mask$LAYOUT, tag_sender_mask$OFFSET, fieldValue);
    }

    private static final OfInt mt_workers_shared$LAYOUT = (OfInt)$LAYOUT.select(groupElement("mt_workers_shared"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int mt_workers_shared
     * }
     */
    public static final OfInt mt_workers_shared$layout() {
        return mt_workers_shared$LAYOUT;
    }

    private static final long mt_workers_shared$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int mt_workers_shared
     * }
     */
    public static final long mt_workers_shared$offset() {
        return mt_workers_shared$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int mt_workers_shared
     * }
     */
    public static int mt_workers_shared(MemorySegment struct) {
        return struct.get(mt_workers_shared$LAYOUT, mt_workers_shared$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int mt_workers_shared
     * }
     */
    public static void mt_workers_shared(MemorySegment struct, int fieldValue) {
        struct.set(mt_workers_shared$LAYOUT, mt_workers_shared$OFFSET, fieldValue);
    }

    private static final OfLong estimated_num_eps$LAYOUT = (OfLong)$LAYOUT.select(groupElement("estimated_num_eps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t estimated_num_eps
     * }
     */
    public static final OfLong estimated_num_eps$layout() {
        return estimated_num_eps$LAYOUT;
    }

    private static final long estimated_num_eps$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t estimated_num_eps
     * }
     */
    public static final long estimated_num_eps$offset() {
        return estimated_num_eps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t estimated_num_eps
     * }
     */
    public static long estimated_num_eps(MemorySegment struct) {
        return struct.get(estimated_num_eps$LAYOUT, estimated_num_eps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t estimated_num_eps
     * }
     */
    public static void estimated_num_eps(MemorySegment struct, long fieldValue) {
        struct.set(estimated_num_eps$LAYOUT, estimated_num_eps$OFFSET, fieldValue);
    }

    private static final OfLong estimated_num_ppn$LAYOUT = (OfLong)$LAYOUT.select(groupElement("estimated_num_ppn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t estimated_num_ppn
     * }
     */
    public static final OfLong estimated_num_ppn$layout() {
        return estimated_num_ppn$LAYOUT;
    }

    private static final long estimated_num_ppn$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t estimated_num_ppn
     * }
     */
    public static final long estimated_num_ppn$offset() {
        return estimated_num_ppn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t estimated_num_ppn
     * }
     */
    public static long estimated_num_ppn(MemorySegment struct) {
        return struct.get(estimated_num_ppn$LAYOUT, estimated_num_ppn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t estimated_num_ppn
     * }
     */
    public static void estimated_num_ppn(MemorySegment struct, long fieldValue) {
        struct.set(estimated_num_ppn$LAYOUT, estimated_num_ppn$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final OfLong node_local_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("node_local_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t node_local_id
     * }
     */
    public static final OfLong node_local_id$layout() {
        return node_local_id$LAYOUT;
    }

    private static final long node_local_id$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t node_local_id
     * }
     */
    public static final long node_local_id$offset() {
        return node_local_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t node_local_id
     * }
     */
    public static long node_local_id(MemorySegment struct) {
        return struct.get(node_local_id$LAYOUT, node_local_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t node_local_id
     * }
     */
    public static void node_local_id(MemorySegment struct, long fieldValue) {
        struct.set(node_local_id$LAYOUT, node_local_id$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

