// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ah_attr {
 *     struct ib_uverbs_global_route grh;
 *     __u16 dlid;
 *     __u8 sl;
 *     __u8 src_path_bits;
 *     __u8 static_rate;
 *     __u8 is_global;
 *     __u8 port_num;
 *     __u8 reserved;
 * }
 * }
 */
public class ib_uverbs_ah_attr {

    ib_uverbs_ah_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ib_uverbs_global_route.layout().withName("grh"),
        Ibverbs.C_SHORT.withName("dlid"),
        Ibverbs.C_CHAR.withName("sl"),
        Ibverbs.C_CHAR.withName("src_path_bits"),
        Ibverbs.C_CHAR.withName("static_rate"),
        Ibverbs.C_CHAR.withName("is_global"),
        Ibverbs.C_CHAR.withName("port_num"),
        Ibverbs.C_CHAR.withName("reserved")
    ).withName("ib_uverbs_ah_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout grh$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("grh"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_global_route grh
     * }
     */
    public static final GroupLayout grh$layout() {
        return grh$LAYOUT;
    }

    private static final long grh$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_global_route grh
     * }
     */
    public static final long grh$offset() {
        return grh$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_global_route grh
     * }
     */
    public static MemorySegment grh(MemorySegment struct) {
        return struct.asSlice(grh$OFFSET, grh$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_global_route grh
     * }
     */
    public static void grh(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, grh$OFFSET, grh$LAYOUT.byteSize());
    }

    private static final OfShort dlid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("dlid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static final OfShort dlid$layout() {
        return dlid$LAYOUT;
    }

    private static final long dlid$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static final long dlid$offset() {
        return dlid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static short dlid(MemorySegment struct) {
        return struct.get(dlid$LAYOUT, dlid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 dlid
     * }
     */
    public static void dlid(MemorySegment struct, short fieldValue) {
        struct.set(dlid$LAYOUT, dlid$OFFSET, fieldValue);
    }

    private static final OfByte sl$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static final OfByte sl$layout() {
        return sl$LAYOUT;
    }

    private static final long sl$OFFSET = 26;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static final long sl$offset() {
        return sl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static byte sl(MemorySegment struct) {
        return struct.get(sl$LAYOUT, sl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 sl
     * }
     */
    public static void sl(MemorySegment struct, byte fieldValue) {
        struct.set(sl$LAYOUT, sl$OFFSET, fieldValue);
    }

    private static final OfByte src_path_bits$LAYOUT = (OfByte)$LAYOUT.select(groupElement("src_path_bits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static final OfByte src_path_bits$layout() {
        return src_path_bits$LAYOUT;
    }

    private static final long src_path_bits$OFFSET = 27;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static final long src_path_bits$offset() {
        return src_path_bits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static byte src_path_bits(MemorySegment struct) {
        return struct.get(src_path_bits$LAYOUT, src_path_bits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 src_path_bits
     * }
     */
    public static void src_path_bits(MemorySegment struct, byte fieldValue) {
        struct.set(src_path_bits$LAYOUT, src_path_bits$OFFSET, fieldValue);
    }

    private static final OfByte static_rate$LAYOUT = (OfByte)$LAYOUT.select(groupElement("static_rate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static final OfByte static_rate$layout() {
        return static_rate$LAYOUT;
    }

    private static final long static_rate$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static final long static_rate$offset() {
        return static_rate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static byte static_rate(MemorySegment struct) {
        return struct.get(static_rate$LAYOUT, static_rate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 static_rate
     * }
     */
    public static void static_rate(MemorySegment struct, byte fieldValue) {
        struct.set(static_rate$LAYOUT, static_rate$OFFSET, fieldValue);
    }

    private static final OfByte is_global$LAYOUT = (OfByte)$LAYOUT.select(groupElement("is_global"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static final OfByte is_global$layout() {
        return is_global$LAYOUT;
    }

    private static final long is_global$OFFSET = 29;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static final long is_global$offset() {
        return is_global$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static byte is_global(MemorySegment struct) {
        return struct.get(is_global$LAYOUT, is_global$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 is_global
     * }
     */
    public static void is_global(MemorySegment struct, byte fieldValue) {
        struct.set(is_global$LAYOUT, is_global$OFFSET, fieldValue);
    }

    private static final OfByte port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static final OfByte port_num$layout() {
        return port_num$LAYOUT;
    }

    private static final long port_num$OFFSET = 30;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static final long port_num$offset() {
        return port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static byte port_num(MemorySegment struct) {
        return struct.get(port_num$LAYOUT, port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 port_num
     * }
     */
    public static void port_num(MemorySegment struct, byte fieldValue) {
        struct.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
    }

    private static final OfByte reserved$LAYOUT = (OfByte)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static final OfByte reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 31;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static byte reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 reserved
     * }
     */
    public static void reserved(MemorySegment struct, byte fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

