// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_reg_mr {
 *     __u64 response;
 *     __u64 start;
 *     __u64 length;
 *     __u64 hca_va;
 *     __u32 pd_handle;
 *     __u32 access_flags;
 *     __u64 driver_data[0];
 * }
 * }
 */
public class ib_uverbs_reg_mr {

    ib_uverbs_reg_mr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG_LONG.withName("response"),
        Ibverbs.C_LONG_LONG.withName("start"),
        Ibverbs.C_LONG_LONG.withName("length"),
        Ibverbs.C_LONG_LONG.withName("hca_va"),
        Ibverbs.C_INT.withName("pd_handle"),
        Ibverbs.C_INT.withName("access_flags"),
        MemoryLayout.sequenceLayout(0, Ibverbs.C_LONG_LONG).withName("driver_data")
    ).withName("ib_uverbs_reg_mr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong response$LAYOUT = (OfLong)$LAYOUT.select(groupElement("response"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final OfLong response$layout() {
        return response$LAYOUT;
    }

    private static final long response$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final long response$offset() {
        return response$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static long response(MemorySegment struct) {
        return struct.get(response$LAYOUT, response$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static void response(MemorySegment struct, long fieldValue) {
        struct.set(response$LAYOUT, response$OFFSET, fieldValue);
    }

    private static final OfLong start$LAYOUT = (OfLong)$LAYOUT.select(groupElement("start"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 start
     * }
     */
    public static final OfLong start$layout() {
        return start$LAYOUT;
    }

    private static final long start$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 start
     * }
     */
    public static final long start$offset() {
        return start$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 start
     * }
     */
    public static long start(MemorySegment struct) {
        return struct.get(start$LAYOUT, start$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 start
     * }
     */
    public static void start(MemorySegment struct, long fieldValue) {
        struct.set(start$LAYOUT, start$OFFSET, fieldValue);
    }

    private static final OfLong length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 length
     * }
     */
    public static final OfLong length$layout() {
        return length$LAYOUT;
    }

    private static final long length$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 length
     * }
     */
    public static final long length$offset() {
        return length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 length
     * }
     */
    public static long length(MemorySegment struct) {
        return struct.get(length$LAYOUT, length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 length
     * }
     */
    public static void length(MemorySegment struct, long fieldValue) {
        struct.set(length$LAYOUT, length$OFFSET, fieldValue);
    }

    private static final OfLong hca_va$LAYOUT = (OfLong)$LAYOUT.select(groupElement("hca_va"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 hca_va
     * }
     */
    public static final OfLong hca_va$layout() {
        return hca_va$LAYOUT;
    }

    private static final long hca_va$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 hca_va
     * }
     */
    public static final long hca_va$offset() {
        return hca_va$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 hca_va
     * }
     */
    public static long hca_va(MemorySegment struct) {
        return struct.get(hca_va$LAYOUT, hca_va$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 hca_va
     * }
     */
    public static void hca_va(MemorySegment struct, long fieldValue) {
        struct.set(hca_va$LAYOUT, hca_va$OFFSET, fieldValue);
    }

    private static final OfInt pd_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pd_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final OfInt pd_handle$layout() {
        return pd_handle$LAYOUT;
    }

    private static final long pd_handle$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final long pd_handle$offset() {
        return pd_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static int pd_handle(MemorySegment struct) {
        return struct.get(pd_handle$LAYOUT, pd_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static void pd_handle(MemorySegment struct, int fieldValue) {
        struct.set(pd_handle$LAYOUT, pd_handle$OFFSET, fieldValue);
    }

    private static final OfInt access_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("access_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 access_flags
     * }
     */
    public static final OfInt access_flags$layout() {
        return access_flags$LAYOUT;
    }

    private static final long access_flags$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 access_flags
     * }
     */
    public static final long access_flags$offset() {
        return access_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 access_flags
     * }
     */
    public static int access_flags(MemorySegment struct) {
        return struct.get(access_flags$LAYOUT, access_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 access_flags
     * }
     */
    public static void access_flags(MemorySegment struct, int fieldValue) {
        struct.set(access_flags$LAYOUT, access_flags$OFFSET, fieldValue);
    }

    private static final SequenceLayout driver_data$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("driver_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final SequenceLayout driver_data$layout() {
        return driver_data$LAYOUT;
    }

    private static final long driver_data$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final long driver_data$offset() {
        return driver_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static MemorySegment driver_data(MemorySegment struct) {
        return struct.asSlice(driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    private static long[] driver_data$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long[] driver_data$dimensions() {
        return driver_data$DIMS;
    }
    private static final VarHandle driver_data$ELEM_HANDLE = driver_data$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long driver_data(MemorySegment struct, long index0) {
        return (long)driver_data$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, long index0, long fieldValue) {
        driver_data$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

