// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_open_qp {
 *     __u64 response;
 *     __u64 user_handle;
 *     __u32 pd_handle;
 *     __u32 qpn;
 *     __u8 qp_type;
 *     __u8 reserved[7];
 *     __u64 driver_data[0];
 * }
 * }
 */
public class ib_uverbs_open_qp {

    ib_uverbs_open_qp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG_LONG.withName("response"),
        Ibverbs.C_LONG_LONG.withName("user_handle"),
        Ibverbs.C_INT.withName("pd_handle"),
        Ibverbs.C_INT.withName("qpn"),
        Ibverbs.C_CHAR.withName("qp_type"),
        MemoryLayout.sequenceLayout(7, Ibverbs.C_CHAR).withName("reserved"),
        MemoryLayout.sequenceLayout(0, Ibverbs.C_LONG_LONG).withName("driver_data")
    ).withName("ib_uverbs_open_qp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong response$LAYOUT = (OfLong)$LAYOUT.select(groupElement("response"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final OfLong response$layout() {
        return response$LAYOUT;
    }

    private static final long response$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final long response$offset() {
        return response$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static long response(MemorySegment struct) {
        return struct.get(response$LAYOUT, response$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static void response(MemorySegment struct, long fieldValue) {
        struct.set(response$LAYOUT, response$OFFSET, fieldValue);
    }

    private static final OfLong user_handle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("user_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final OfLong user_handle$layout() {
        return user_handle$LAYOUT;
    }

    private static final long user_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final long user_handle$offset() {
        return user_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static long user_handle(MemorySegment struct) {
        return struct.get(user_handle$LAYOUT, user_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static void user_handle(MemorySegment struct, long fieldValue) {
        struct.set(user_handle$LAYOUT, user_handle$OFFSET, fieldValue);
    }

    private static final OfInt pd_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pd_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final OfInt pd_handle$layout() {
        return pd_handle$LAYOUT;
    }

    private static final long pd_handle$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static final long pd_handle$offset() {
        return pd_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static int pd_handle(MemorySegment struct) {
        return struct.get(pd_handle$LAYOUT, pd_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 pd_handle
     * }
     */
    public static void pd_handle(MemorySegment struct, int fieldValue) {
        struct.set(pd_handle$LAYOUT, pd_handle$OFFSET, fieldValue);
    }

    private static final OfInt qpn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qpn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static final OfInt qpn$layout() {
        return qpn$LAYOUT;
    }

    private static final long qpn$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static final long qpn$offset() {
        return qpn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static int qpn(MemorySegment struct) {
        return struct.get(qpn$LAYOUT, qpn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qpn
     * }
     */
    public static void qpn(MemorySegment struct, int fieldValue) {
        struct.set(qpn$LAYOUT, qpn$OFFSET, fieldValue);
    }

    private static final OfByte qp_type$LAYOUT = (OfByte)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static final OfByte qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static byte qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, byte fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    private static final SequenceLayout reserved$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static final SequenceLayout reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 25;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static MemorySegment reserved(MemorySegment struct) {
        return struct.asSlice(reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static void reserved(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, reserved$OFFSET, reserved$LAYOUT.byteSize());
    }

    private static long[] reserved$DIMS = { 7 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static long[] reserved$dimensions() {
        return reserved$DIMS;
    }
    private static final VarHandle reserved$ELEM_HANDLE = reserved$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static byte reserved(MemorySegment struct, long index0) {
        return (byte)reserved$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u8 reserved[7]
     * }
     */
    public static void reserved(MemorySegment struct, long index0, byte fieldValue) {
        reserved$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout driver_data$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("driver_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final SequenceLayout driver_data$layout() {
        return driver_data$LAYOUT;
    }

    private static final long driver_data$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final long driver_data$offset() {
        return driver_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static MemorySegment driver_data(MemorySegment struct) {
        return struct.asSlice(driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    private static long[] driver_data$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long[] driver_data$dimensions() {
        return driver_data$DIMS;
    }
    private static final VarHandle driver_data$ELEM_HANDLE = driver_data$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long driver_data(MemorySegment struct, long index0) {
        return (long)driver_data$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, long index0, long fieldValue) {
        driver_data$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

