// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ex_create_cq {
 *     __u64 user_handle;
 *     __u32 cqe;
 *     __u32 comp_vector;
 *     __s32 comp_channel;
 *     __u32 comp_mask;
 *     __u32 flags;
 *     __u32 reserved;
 * }
 * }
 */
public class ib_uverbs_ex_create_cq {

    ib_uverbs_ex_create_cq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG_LONG.withName("user_handle"),
        Ibverbs.C_INT.withName("cqe"),
        Ibverbs.C_INT.withName("comp_vector"),
        Ibverbs.C_INT.withName("comp_channel"),
        Ibverbs.C_INT.withName("comp_mask"),
        Ibverbs.C_INT.withName("flags"),
        Ibverbs.C_INT.withName("reserved")
    ).withName("ib_uverbs_ex_create_cq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong user_handle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("user_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final OfLong user_handle$layout() {
        return user_handle$LAYOUT;
    }

    private static final long user_handle$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static final long user_handle$offset() {
        return user_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static long user_handle(MemorySegment struct) {
        return struct.get(user_handle$LAYOUT, user_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 user_handle
     * }
     */
    public static void user_handle(MemorySegment struct, long fieldValue) {
        struct.set(user_handle$LAYOUT, user_handle$OFFSET, fieldValue);
    }

    private static final OfInt cqe$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cqe"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 cqe
     * }
     */
    public static final OfInt cqe$layout() {
        return cqe$LAYOUT;
    }

    private static final long cqe$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 cqe
     * }
     */
    public static final long cqe$offset() {
        return cqe$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 cqe
     * }
     */
    public static int cqe(MemorySegment struct) {
        return struct.get(cqe$LAYOUT, cqe$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 cqe
     * }
     */
    public static void cqe(MemorySegment struct, int fieldValue) {
        struct.set(cqe$LAYOUT, cqe$OFFSET, fieldValue);
    }

    private static final OfInt comp_vector$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_vector"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 comp_vector
     * }
     */
    public static final OfInt comp_vector$layout() {
        return comp_vector$LAYOUT;
    }

    private static final long comp_vector$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 comp_vector
     * }
     */
    public static final long comp_vector$offset() {
        return comp_vector$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 comp_vector
     * }
     */
    public static int comp_vector(MemorySegment struct) {
        return struct.get(comp_vector$LAYOUT, comp_vector$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 comp_vector
     * }
     */
    public static void comp_vector(MemorySegment struct, int fieldValue) {
        struct.set(comp_vector$LAYOUT, comp_vector$OFFSET, fieldValue);
    }

    private static final OfInt comp_channel$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_channel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __s32 comp_channel
     * }
     */
    public static final OfInt comp_channel$layout() {
        return comp_channel$LAYOUT;
    }

    private static final long comp_channel$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __s32 comp_channel
     * }
     */
    public static final long comp_channel$offset() {
        return comp_channel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __s32 comp_channel
     * }
     */
    public static int comp_channel(MemorySegment struct) {
        return struct.get(comp_channel$LAYOUT, comp_channel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __s32 comp_channel
     * }
     */
    public static void comp_channel(MemorySegment struct, int fieldValue) {
        struct.set(comp_channel$LAYOUT, comp_channel$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final OfInt reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static int reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 reserved
     * }
     */
    public static void reserved(MemorySegment struct, int fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

