// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ex_create_wq_resp {
 *     __u32 comp_mask;
 *     __u32 response_length;
 *     __u32 wq_handle;
 *     __u32 max_wr;
 *     __u32 max_sge;
 *     __u32 wqn;
 * }
 * }
 */
public class ib_uverbs_ex_create_wq_resp {

    ib_uverbs_ex_create_wq_resp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("comp_mask"),
        Ibverbs.C_INT.withName("response_length"),
        Ibverbs.C_INT.withName("wq_handle"),
        Ibverbs.C_INT.withName("max_wr"),
        Ibverbs.C_INT.withName("max_sge"),
        Ibverbs.C_INT.withName("wqn")
    ).withName("ib_uverbs_ex_create_wq_resp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt response_length$LAYOUT = (OfInt)$LAYOUT.select(groupElement("response_length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static final OfInt response_length$layout() {
        return response_length$LAYOUT;
    }

    private static final long response_length$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static final long response_length$offset() {
        return response_length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static int response_length(MemorySegment struct) {
        return struct.get(response_length$LAYOUT, response_length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 response_length
     * }
     */
    public static void response_length(MemorySegment struct, int fieldValue) {
        struct.set(response_length$LAYOUT, response_length$OFFSET, fieldValue);
    }

    private static final OfInt wq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static final OfInt wq_handle$layout() {
        return wq_handle$LAYOUT;
    }

    private static final long wq_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static final long wq_handle$offset() {
        return wq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static int wq_handle(MemorySegment struct) {
        return struct.get(wq_handle$LAYOUT, wq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static void wq_handle(MemorySegment struct, int fieldValue) {
        struct.set(wq_handle$LAYOUT, wq_handle$OFFSET, fieldValue);
    }

    private static final OfInt max_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final OfInt max_wr$layout() {
        return max_wr$LAYOUT;
    }

    private static final long max_wr$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final long max_wr$offset() {
        return max_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static int max_wr(MemorySegment struct) {
        return struct.get(max_wr$LAYOUT, max_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static void max_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_wr$LAYOUT, max_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static final OfInt max_sge$layout() {
        return max_sge$LAYOUT;
    }

    private static final long max_sge$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static final long max_sge$offset() {
        return max_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static int max_sge(MemorySegment struct) {
        return struct.get(max_sge$LAYOUT, max_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_sge
     * }
     */
    public static void max_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_sge$LAYOUT, max_sge$OFFSET, fieldValue);
    }

    private static final OfInt wqn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wqn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wqn
     * }
     */
    public static final OfInt wqn$layout() {
        return wqn$LAYOUT;
    }

    private static final long wqn$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wqn
     * }
     */
    public static final long wqn$offset() {
        return wqn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wqn
     * }
     */
    public static int wqn(MemorySegment struct) {
        return struct.get(wqn$LAYOUT, wqn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wqn
     * }
     */
    public static void wqn(MemorySegment struct, int fieldValue) {
        struct.set(wqn$LAYOUT, wqn$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

