// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_ex_modify_wq {
 *     __u32 attr_mask;
 *     __u32 wq_handle;
 *     __u32 wq_state;
 *     __u32 curr_wq_state;
 *     __u32 flags;
 *     __u32 flags_mask;
 * }
 * }
 */
public class ib_uverbs_ex_modify_wq {

    ib_uverbs_ex_modify_wq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("attr_mask"),
        Ibverbs.C_INT.withName("wq_handle"),
        Ibverbs.C_INT.withName("wq_state"),
        Ibverbs.C_INT.withName("curr_wq_state"),
        Ibverbs.C_INT.withName("flags"),
        Ibverbs.C_INT.withName("flags_mask")
    ).withName("ib_uverbs_ex_modify_wq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt attr_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("attr_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static final OfInt attr_mask$layout() {
        return attr_mask$LAYOUT;
    }

    private static final long attr_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static final long attr_mask$offset() {
        return attr_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static int attr_mask(MemorySegment struct) {
        return struct.get(attr_mask$LAYOUT, attr_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static void attr_mask(MemorySegment struct, int fieldValue) {
        struct.set(attr_mask$LAYOUT, attr_mask$OFFSET, fieldValue);
    }

    private static final OfInt wq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static final OfInt wq_handle$layout() {
        return wq_handle$LAYOUT;
    }

    private static final long wq_handle$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static final long wq_handle$offset() {
        return wq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static int wq_handle(MemorySegment struct) {
        return struct.get(wq_handle$LAYOUT, wq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wq_handle
     * }
     */
    public static void wq_handle(MemorySegment struct, int fieldValue) {
        struct.set(wq_handle$LAYOUT, wq_handle$OFFSET, fieldValue);
    }

    private static final OfInt wq_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wq_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wq_state
     * }
     */
    public static final OfInt wq_state$layout() {
        return wq_state$LAYOUT;
    }

    private static final long wq_state$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wq_state
     * }
     */
    public static final long wq_state$offset() {
        return wq_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wq_state
     * }
     */
    public static int wq_state(MemorySegment struct) {
        return struct.get(wq_state$LAYOUT, wq_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wq_state
     * }
     */
    public static void wq_state(MemorySegment struct, int fieldValue) {
        struct.set(wq_state$LAYOUT, wq_state$OFFSET, fieldValue);
    }

    private static final OfInt curr_wq_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("curr_wq_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 curr_wq_state
     * }
     */
    public static final OfInt curr_wq_state$layout() {
        return curr_wq_state$LAYOUT;
    }

    private static final long curr_wq_state$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 curr_wq_state
     * }
     */
    public static final long curr_wq_state$offset() {
        return curr_wq_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 curr_wq_state
     * }
     */
    public static int curr_wq_state(MemorySegment struct) {
        return struct.get(curr_wq_state$LAYOUT, curr_wq_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 curr_wq_state
     * }
     */
    public static void curr_wq_state(MemorySegment struct, int fieldValue) {
        struct.set(curr_wq_state$LAYOUT, curr_wq_state$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt flags_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags_mask
     * }
     */
    public static final OfInt flags_mask$layout() {
        return flags_mask$LAYOUT;
    }

    private static final long flags_mask$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags_mask
     * }
     */
    public static final long flags_mask$offset() {
        return flags_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags_mask
     * }
     */
    public static int flags_mask(MemorySegment struct) {
        return struct.get(flags_mask$LAYOUT, flags_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags_mask
     * }
     */
    public static void flags_mask(MemorySegment struct, int fieldValue) {
        struct.set(flags_mask$LAYOUT, flags_mask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

