// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_modify_srq {
 *     __u32 srq_handle;
 *     __u32 attr_mask;
 *     __u32 max_wr;
 *     __u32 srq_limit;
 *     __u64 driver_data[0];
 * }
 * }
 */
public class ib_uverbs_modify_srq {

    ib_uverbs_modify_srq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("srq_handle"),
        Ibverbs.C_INT.withName("attr_mask"),
        Ibverbs.C_INT.withName("max_wr"),
        Ibverbs.C_INT.withName("srq_limit"),
        MemoryLayout.sequenceLayout(0, Ibverbs.C_LONG_LONG).withName("driver_data")
    ).withName("ib_uverbs_modify_srq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt srq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static final OfInt srq_handle$layout() {
        return srq_handle$LAYOUT;
    }

    private static final long srq_handle$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static final long srq_handle$offset() {
        return srq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static int srq_handle(MemorySegment struct) {
        return struct.get(srq_handle$LAYOUT, srq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static void srq_handle(MemorySegment struct, int fieldValue) {
        struct.set(srq_handle$LAYOUT, srq_handle$OFFSET, fieldValue);
    }

    private static final OfInt attr_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("attr_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static final OfInt attr_mask$layout() {
        return attr_mask$LAYOUT;
    }

    private static final long attr_mask$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static final long attr_mask$offset() {
        return attr_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static int attr_mask(MemorySegment struct) {
        return struct.get(attr_mask$LAYOUT, attr_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 attr_mask
     * }
     */
    public static void attr_mask(MemorySegment struct, int fieldValue) {
        struct.set(attr_mask$LAYOUT, attr_mask$OFFSET, fieldValue);
    }

    private static final OfInt max_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final OfInt max_wr$layout() {
        return max_wr$LAYOUT;
    }

    private static final long max_wr$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static final long max_wr$offset() {
        return max_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static int max_wr(MemorySegment struct) {
        return struct.get(max_wr$LAYOUT, max_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 max_wr
     * }
     */
    public static void max_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_wr$LAYOUT, max_wr$OFFSET, fieldValue);
    }

    private static final OfInt srq_limit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static final OfInt srq_limit$layout() {
        return srq_limit$LAYOUT;
    }

    private static final long srq_limit$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static final long srq_limit$offset() {
        return srq_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static int srq_limit(MemorySegment struct) {
        return struct.get(srq_limit$LAYOUT, srq_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 srq_limit
     * }
     */
    public static void srq_limit(MemorySegment struct, int fieldValue) {
        struct.set(srq_limit$LAYOUT, srq_limit$OFFSET, fieldValue);
    }

    private static final SequenceLayout driver_data$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("driver_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final SequenceLayout driver_data$layout() {
        return driver_data$LAYOUT;
    }

    private static final long driver_data$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final long driver_data$offset() {
        return driver_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static MemorySegment driver_data(MemorySegment struct) {
        return struct.asSlice(driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    private static long[] driver_data$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long[] driver_data$dimensions() {
        return driver_data$DIMS;
    }
    private static final VarHandle driver_data$ELEM_HANDLE = driver_data$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long driver_data(MemorySegment struct, long index0) {
        return (long)driver_data$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, long index0, long fieldValue) {
        driver_data$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

