// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_attach_mcast {
 *     __u8 gid[16];
 *     __u32 qp_handle;
 *     __u16 mlid;
 *     __u16 reserved;
 *     __u64 driver_data[0];
 * }
 * }
 */
public class ib_uverbs_attach_mcast {

    ib_uverbs_attach_mcast() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(16, Ibverbs.C_CHAR).withName("gid"),
        Ibverbs.C_INT.withName("qp_handle"),
        Ibverbs.C_SHORT.withName("mlid"),
        Ibverbs.C_SHORT.withName("reserved"),
        MemoryLayout.sequenceLayout(0, Ibverbs.C_LONG_LONG).withName("driver_data")
    ).withName("ib_uverbs_attach_mcast");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout gid$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("gid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static final SequenceLayout gid$layout() {
        return gid$LAYOUT;
    }

    private static final long gid$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static final long gid$offset() {
        return gid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static MemorySegment gid(MemorySegment struct) {
        return struct.asSlice(gid$OFFSET, gid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static void gid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, gid$OFFSET, gid$LAYOUT.byteSize());
    }

    private static long[] gid$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static long[] gid$dimensions() {
        return gid$DIMS;
    }
    private static final VarHandle gid$ELEM_HANDLE = gid$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static byte gid(MemorySegment struct, long index0) {
        return (byte)gid$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u8 gid[16]
     * }
     */
    public static void gid(MemorySegment struct, long index0, byte fieldValue) {
        gid$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt qp_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static final OfInt qp_handle$layout() {
        return qp_handle$LAYOUT;
    }

    private static final long qp_handle$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static final long qp_handle$offset() {
        return qp_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static int qp_handle(MemorySegment struct) {
        return struct.get(qp_handle$LAYOUT, qp_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 qp_handle
     * }
     */
    public static void qp_handle(MemorySegment struct, int fieldValue) {
        struct.set(qp_handle$LAYOUT, qp_handle$OFFSET, fieldValue);
    }

    private static final OfShort mlid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("mlid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 mlid
     * }
     */
    public static final OfShort mlid$layout() {
        return mlid$LAYOUT;
    }

    private static final long mlid$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 mlid
     * }
     */
    public static final long mlid$offset() {
        return mlid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 mlid
     * }
     */
    public static short mlid(MemorySegment struct) {
        return struct.get(mlid$LAYOUT, mlid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 mlid
     * }
     */
    public static void mlid(MemorySegment struct, short fieldValue) {
        struct.set(mlid$LAYOUT, mlid$OFFSET, fieldValue);
    }

    private static final OfShort reserved$LAYOUT = (OfShort)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static final OfShort reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 22;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static short reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static void reserved(MemorySegment struct, short fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    private static final SequenceLayout driver_data$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("driver_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final SequenceLayout driver_data$layout() {
        return driver_data$LAYOUT;
    }

    private static final long driver_data$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static final long driver_data$offset() {
        return driver_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static MemorySegment driver_data(MemorySegment struct) {
        return struct.asSlice(driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, driver_data$OFFSET, driver_data$LAYOUT.byteSize());
    }

    private static long[] driver_data$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long[] driver_data$dimensions() {
        return driver_data$DIMS;
    }
    private static final VarHandle driver_data$ELEM_HANDLE = driver_data$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static long driver_data(MemorySegment struct, long index0) {
        return (long)driver_data$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u64 driver_data[0]
     * }
     */
    public static void driver_data(MemorySegment struct, long index0, long fieldValue) {
        driver_data$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

