// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_post_srq_recv {
 *     __u64 response;
 *     __u32 srq_handle;
 *     __u32 wr_count;
 *     __u32 sge_count;
 *     __u32 wqe_size;
 *     struct ib_uverbs_recv_wr recv[0];
 * }
 * }
 */
public class ib_uverbs_post_srq_recv {

    ib_uverbs_post_srq_recv() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG_LONG.withName("response"),
        Ibverbs.C_INT.withName("srq_handle"),
        Ibverbs.C_INT.withName("wr_count"),
        Ibverbs.C_INT.withName("sge_count"),
        Ibverbs.C_INT.withName("wqe_size"),
        MemoryLayout.sequenceLayout(0, ib_uverbs_recv_wr.layout()).withName("recv")
    ).withName("ib_uverbs_post_srq_recv");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong response$LAYOUT = (OfLong)$LAYOUT.select(groupElement("response"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final OfLong response$layout() {
        return response$LAYOUT;
    }

    private static final long response$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static final long response$offset() {
        return response$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static long response(MemorySegment struct) {
        return struct.get(response$LAYOUT, response$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 response
     * }
     */
    public static void response(MemorySegment struct, long fieldValue) {
        struct.set(response$LAYOUT, response$OFFSET, fieldValue);
    }

    private static final OfInt srq_handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static final OfInt srq_handle$layout() {
        return srq_handle$LAYOUT;
    }

    private static final long srq_handle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static final long srq_handle$offset() {
        return srq_handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static int srq_handle(MemorySegment struct) {
        return struct.get(srq_handle$LAYOUT, srq_handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 srq_handle
     * }
     */
    public static void srq_handle(MemorySegment struct, int fieldValue) {
        struct.set(srq_handle$LAYOUT, srq_handle$OFFSET, fieldValue);
    }

    private static final OfInt wr_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wr_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static final OfInt wr_count$layout() {
        return wr_count$LAYOUT;
    }

    private static final long wr_count$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static final long wr_count$offset() {
        return wr_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static int wr_count(MemorySegment struct) {
        return struct.get(wr_count$LAYOUT, wr_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wr_count
     * }
     */
    public static void wr_count(MemorySegment struct, int fieldValue) {
        struct.set(wr_count$LAYOUT, wr_count$OFFSET, fieldValue);
    }

    private static final OfInt sge_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sge_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static final OfInt sge_count$layout() {
        return sge_count$LAYOUT;
    }

    private static final long sge_count$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static final long sge_count$offset() {
        return sge_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static int sge_count(MemorySegment struct) {
        return struct.get(sge_count$LAYOUT, sge_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 sge_count
     * }
     */
    public static void sge_count(MemorySegment struct, int fieldValue) {
        struct.set(sge_count$LAYOUT, sge_count$OFFSET, fieldValue);
    }

    private static final OfInt wqe_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wqe_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static final OfInt wqe_size$layout() {
        return wqe_size$LAYOUT;
    }

    private static final long wqe_size$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static final long wqe_size$offset() {
        return wqe_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static int wqe_size(MemorySegment struct) {
        return struct.get(wqe_size$LAYOUT, wqe_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 wqe_size
     * }
     */
    public static void wqe_size(MemorySegment struct, int fieldValue) {
        struct.set(wqe_size$LAYOUT, wqe_size$OFFSET, fieldValue);
    }

    private static final SequenceLayout recv$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("recv"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static final SequenceLayout recv$layout() {
        return recv$LAYOUT;
    }

    private static final long recv$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static final long recv$offset() {
        return recv$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static MemorySegment recv(MemorySegment struct) {
        return struct.asSlice(recv$OFFSET, recv$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static void recv(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, recv$OFFSET, recv$LAYOUT.byteSize());
    }

    private static long[] recv$DIMS = { 0 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static long[] recv$dimensions() {
        return recv$DIMS;
    }
    private static final MethodHandle recv$ELEM_HANDLE = recv$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static MemorySegment recv(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)recv$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_recv_wr recv[0]
     * }
     */
    public static void recv(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, recv(struct, index0), 0L, ib_uverbs_recv_wr.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

