// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ib_uverbs_flow_spec_ipv4 {
 *     union {
 *         struct ib_uverbs_flow_spec_hdr hdr;
 *         struct {
 *             __u32 type;
 *             __u16 size;
 *             __u16 reserved;
 *         };
 *     };
 *     struct ib_uverbs_flow_ipv4_filter val;
 *     struct ib_uverbs_flow_ipv4_filter mask;
 * }
 * }
 */
public class ib_uverbs_flow_spec_ipv4 {

    ib_uverbs_flow_spec_ipv4() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            ib_uverbs_flow_spec_hdr.layout().withName("hdr"),
            MemoryLayout.structLayout(
                Ibverbs.C_INT.withName("type"),
                Ibverbs.C_SHORT.withName("size"),
                Ibverbs.C_SHORT.withName("reserved")
            ).withName("$anon$940:3")
        ).withName("$anon$938:2"),
        ib_uverbs_flow_ipv4_filter.layout().withName("val"),
        ib_uverbs_flow_ipv4_filter.layout().withName("mask")
    ).withName("ib_uverbs_flow_spec_ipv4");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout hdr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$938:2"), groupElement("hdr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr hdr
     * }
     */
    public static final GroupLayout hdr$layout() {
        return hdr$LAYOUT;
    }

    private static final long hdr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr hdr
     * }
     */
    public static final long hdr$offset() {
        return hdr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr hdr
     * }
     */
    public static MemorySegment hdr(MemorySegment struct) {
        return struct.asSlice(hdr$OFFSET, hdr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_spec_hdr hdr
     * }
     */
    public static void hdr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, hdr$OFFSET, hdr$LAYOUT.byteSize());
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$938:2"), groupElement("$anon$940:3"), groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfShort size$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$938:2"), groupElement("$anon$940:3"), groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static final OfShort size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static short size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 size
     * }
     */
    public static void size(MemorySegment struct, short fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final OfShort reserved$LAYOUT = (OfShort)$LAYOUT.select(groupElement("$anon$938:2"), groupElement("$anon$940:3"), groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static final OfShort reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static short reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u16 reserved
     * }
     */
    public static void reserved(MemorySegment struct, short fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    private static final GroupLayout val$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("val"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter val
     * }
     */
    public static final GroupLayout val$layout() {
        return val$LAYOUT;
    }

    private static final long val$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter val
     * }
     */
    public static final long val$offset() {
        return val$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter val
     * }
     */
    public static MemorySegment val(MemorySegment struct) {
        return struct.asSlice(val$OFFSET, val$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter val
     * }
     */
    public static void val(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, val$OFFSET, val$LAYOUT.byteSize());
    }

    private static final GroupLayout mask$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter mask
     * }
     */
    public static final GroupLayout mask$layout() {
        return mask$LAYOUT;
    }

    private static final long mask$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter mask
     * }
     */
    public static final long mask$offset() {
        return mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter mask
     * }
     */
    public static MemorySegment mask(MemorySegment struct) {
        return struct.asSlice(mask$OFFSET, mask$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ib_uverbs_flow_ipv4_filter mask
     * }
     */
    public static void mask(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mask$OFFSET, mask$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

