// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_flow_ipv4_ext_filter {
 *     uint32_t src_ip;
 *     uint32_t dst_ip;
 *     uint8_t proto;
 *     uint8_t tos;
 *     uint8_t ttl;
 *     uint8_t flags;
 * }
 * }
 */
public class ibv_flow_ipv4_ext_filter {

    ibv_flow_ipv4_ext_filter() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("src_ip"),
        Ibverbs.C_INT.withName("dst_ip"),
        Ibverbs.C_CHAR.withName("proto"),
        Ibverbs.C_CHAR.withName("tos"),
        Ibverbs.C_CHAR.withName("ttl"),
        Ibverbs.C_CHAR.withName("flags")
    ).withName("ibv_flow_ipv4_ext_filter");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt src_ip$LAYOUT = (OfInt)$LAYOUT.select(groupElement("src_ip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t src_ip
     * }
     */
    public static final OfInt src_ip$layout() {
        return src_ip$LAYOUT;
    }

    private static final long src_ip$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t src_ip
     * }
     */
    public static final long src_ip$offset() {
        return src_ip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t src_ip
     * }
     */
    public static int src_ip(MemorySegment struct) {
        return struct.get(src_ip$LAYOUT, src_ip$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t src_ip
     * }
     */
    public static void src_ip(MemorySegment struct, int fieldValue) {
        struct.set(src_ip$LAYOUT, src_ip$OFFSET, fieldValue);
    }

    private static final OfInt dst_ip$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dst_ip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t dst_ip
     * }
     */
    public static final OfInt dst_ip$layout() {
        return dst_ip$LAYOUT;
    }

    private static final long dst_ip$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t dst_ip
     * }
     */
    public static final long dst_ip$offset() {
        return dst_ip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t dst_ip
     * }
     */
    public static int dst_ip(MemorySegment struct) {
        return struct.get(dst_ip$LAYOUT, dst_ip$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t dst_ip
     * }
     */
    public static void dst_ip(MemorySegment struct, int fieldValue) {
        struct.set(dst_ip$LAYOUT, dst_ip$OFFSET, fieldValue);
    }

    private static final OfByte proto$LAYOUT = (OfByte)$LAYOUT.select(groupElement("proto"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t proto
     * }
     */
    public static final OfByte proto$layout() {
        return proto$LAYOUT;
    }

    private static final long proto$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t proto
     * }
     */
    public static final long proto$offset() {
        return proto$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t proto
     * }
     */
    public static byte proto(MemorySegment struct) {
        return struct.get(proto$LAYOUT, proto$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t proto
     * }
     */
    public static void proto(MemorySegment struct, byte fieldValue) {
        struct.set(proto$LAYOUT, proto$OFFSET, fieldValue);
    }

    private static final OfByte tos$LAYOUT = (OfByte)$LAYOUT.select(groupElement("tos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t tos
     * }
     */
    public static final OfByte tos$layout() {
        return tos$LAYOUT;
    }

    private static final long tos$OFFSET = 9;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t tos
     * }
     */
    public static final long tos$offset() {
        return tos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t tos
     * }
     */
    public static byte tos(MemorySegment struct) {
        return struct.get(tos$LAYOUT, tos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t tos
     * }
     */
    public static void tos(MemorySegment struct, byte fieldValue) {
        struct.set(tos$LAYOUT, tos$OFFSET, fieldValue);
    }

    private static final OfByte ttl$LAYOUT = (OfByte)$LAYOUT.select(groupElement("ttl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t ttl
     * }
     */
    public static final OfByte ttl$layout() {
        return ttl$LAYOUT;
    }

    private static final long ttl$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t ttl
     * }
     */
    public static final long ttl$offset() {
        return ttl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t ttl
     * }
     */
    public static byte ttl(MemorySegment struct) {
        return struct.get(ttl$LAYOUT, ttl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t ttl
     * }
     */
    public static void ttl(MemorySegment struct, byte fieldValue) {
        struct.set(ttl$LAYOUT, ttl$OFFSET, fieldValue);
    }

    private static final OfByte flags$LAYOUT = (OfByte)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t flags
     * }
     */
    public static final OfByte flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 11;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t flags
     * }
     */
    public static byte flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t flags
     * }
     */
    public static void flags(MemorySegment struct, byte fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

