// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_send_wr {
 *     uint64_t wr_id;
 *     struct ibv_send_wr *next;
 *     struct ibv_sge *sg_list;
 *     int num_sge;
 *     enum ibv_wr_opcode opcode;
 *     unsigned int send_flags;
 *     union {
 *         __be32 imm_data;
 *         uint32_t invalidate_rkey;
 *     };
 *     union {
 *         struct {
 *             uint64_t remote_addr;
 *             uint32_t rkey;
 *         } rdma;
 *         struct {
 *             uint64_t remote_addr;
 *             uint64_t compare_add;
 *             uint64_t swap;
 *             uint32_t rkey;
 *         } atomic;
 *         struct {
 *             struct ibv_ah *ah;
 *             uint32_t remote_qpn;
 *             uint32_t remote_qkey;
 *         } ud;
 *     } wr;
 *     union {
 *         struct {
 *             uint32_t remote_srqn;
 *         } xrc;
 *     } qp_type;
 *     union {
 *         struct {
 *             struct ibv_mw *mw;
 *             uint32_t rkey;
 *             struct ibv_mw_bind_info bind_info;
 *         } bind_mw;
 *         struct {
 *             void *hdr;
 *             uint16_t hdr_sz;
 *             uint16_t mss;
 *         } tso;
 *     };
 * }
 * }
 */
public class ibv_send_wr {

    ibv_send_wr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG.withName("wr_id"),
        Ibverbs.C_POINTER.withName("next"),
        Ibverbs.C_POINTER.withName("sg_list"),
        Ibverbs.C_INT.withName("num_sge"),
        Ibverbs.C_INT.withName("opcode"),
        Ibverbs.C_INT.withName("send_flags"),
        MemoryLayout.unionLayout(
            Ibverbs.C_INT.withName("imm_data"),
            Ibverbs.C_INT.withName("invalidate_rkey")
        ).withName("$anon$1130:2"),
        ibv_send_wr.wr.layout().withName("wr"),
        ibv_send_wr.qp_type.layout().withName("qp_type"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            ibv_send_wr.bind_mw.layout().withName("bind_mw"),
            ibv_send_wr.tso.layout().withName("tso")
        ).withName("$anon$1156:2")
    ).withName("ibv_send_wr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong wr_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("wr_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static final OfLong wr_id$layout() {
        return wr_id$LAYOUT;
    }

    private static final long wr_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static final long wr_id$offset() {
        return wr_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static long wr_id(MemorySegment struct) {
        return struct.get(wr_id$LAYOUT, wr_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static void wr_id(MemorySegment struct, long fieldValue) {
        struct.set(wr_id$LAYOUT, wr_id$OFFSET, fieldValue);
    }

    private static final AddressLayout next$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("next"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_send_wr *next
     * }
     */
    public static final AddressLayout next$layout() {
        return next$LAYOUT;
    }

    private static final long next$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_send_wr *next
     * }
     */
    public static final long next$offset() {
        return next$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_send_wr *next
     * }
     */
    public static MemorySegment next(MemorySegment struct) {
        return struct.get(next$LAYOUT, next$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_send_wr *next
     * }
     */
    public static void next(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(next$LAYOUT, next$OFFSET, fieldValue);
    }

    private static final AddressLayout sg_list$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sg_list"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_sge *sg_list
     * }
     */
    public static final AddressLayout sg_list$layout() {
        return sg_list$LAYOUT;
    }

    private static final long sg_list$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_sge *sg_list
     * }
     */
    public static final long sg_list$offset() {
        return sg_list$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_sge *sg_list
     * }
     */
    public static MemorySegment sg_list(MemorySegment struct) {
        return struct.get(sg_list$LAYOUT, sg_list$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_sge *sg_list
     * }
     */
    public static void sg_list(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sg_list$LAYOUT, sg_list$OFFSET, fieldValue);
    }

    private static final OfInt num_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("num_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int num_sge
     * }
     */
    public static final OfInt num_sge$layout() {
        return num_sge$LAYOUT;
    }

    private static final long num_sge$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int num_sge
     * }
     */
    public static final long num_sge$offset() {
        return num_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int num_sge
     * }
     */
    public static int num_sge(MemorySegment struct) {
        return struct.get(num_sge$LAYOUT, num_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int num_sge
     * }
     */
    public static void num_sge(MemorySegment struct, int fieldValue) {
        struct.set(num_sge$LAYOUT, num_sge$OFFSET, fieldValue);
    }

    private static final OfInt opcode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("opcode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_wr_opcode opcode
     * }
     */
    public static final OfInt opcode$layout() {
        return opcode$LAYOUT;
    }

    private static final long opcode$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_wr_opcode opcode
     * }
     */
    public static final long opcode$offset() {
        return opcode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_wr_opcode opcode
     * }
     */
    public static int opcode(MemorySegment struct) {
        return struct.get(opcode$LAYOUT, opcode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_wr_opcode opcode
     * }
     */
    public static void opcode(MemorySegment struct, int fieldValue) {
        struct.set(opcode$LAYOUT, opcode$OFFSET, fieldValue);
    }

    private static final OfInt send_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("send_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int send_flags
     * }
     */
    public static final OfInt send_flags$layout() {
        return send_flags$LAYOUT;
    }

    private static final long send_flags$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int send_flags
     * }
     */
    public static final long send_flags$offset() {
        return send_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int send_flags
     * }
     */
    public static int send_flags(MemorySegment struct) {
        return struct.get(send_flags$LAYOUT, send_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int send_flags
     * }
     */
    public static void send_flags(MemorySegment struct, int fieldValue) {
        struct.set(send_flags$LAYOUT, send_flags$OFFSET, fieldValue);
    }

    private static final OfInt imm_data$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$1130:2"), groupElement("imm_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static final OfInt imm_data$layout() {
        return imm_data$LAYOUT;
    }

    private static final long imm_data$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static final long imm_data$offset() {
        return imm_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static int imm_data(MemorySegment struct) {
        return struct.get(imm_data$LAYOUT, imm_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static void imm_data(MemorySegment struct, int fieldValue) {
        struct.set(imm_data$LAYOUT, imm_data$OFFSET, fieldValue);
    }

    private static final OfInt invalidate_rkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$1130:2"), groupElement("invalidate_rkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t invalidate_rkey
     * }
     */
    public static final OfInt invalidate_rkey$layout() {
        return invalidate_rkey$LAYOUT;
    }

    private static final long invalidate_rkey$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t invalidate_rkey
     * }
     */
    public static final long invalidate_rkey$offset() {
        return invalidate_rkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t invalidate_rkey
     * }
     */
    public static int invalidate_rkey(MemorySegment struct) {
        return struct.get(invalidate_rkey$LAYOUT, invalidate_rkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t invalidate_rkey
     * }
     */
    public static void invalidate_rkey(MemorySegment struct, int fieldValue) {
        struct.set(invalidate_rkey$LAYOUT, invalidate_rkey$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint64_t remote_addr;
     *         uint32_t rkey;
     *     } rdma;
     *     struct {
     *         uint64_t remote_addr;
     *         uint64_t compare_add;
     *         uint64_t swap;
     *         uint32_t rkey;
     *     } atomic;
     *     struct {
     *         struct ibv_ah *ah;
     *         uint32_t remote_qpn;
     *         uint32_t remote_qkey;
     *     } ud;
     * }
     * }
     */
    public static class wr {

        wr() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            ibv_send_wr.wr.rdma.layout().withName("rdma"),
            ibv_send_wr.wr.atomic.layout().withName("atomic"),
            ibv_send_wr.wr.ud.layout().withName("ud")
        ).withName("$anon$1134:2");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint32_t rkey;
         * }
         * }
         */
        public static class rdma {

            rdma() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                Ibverbs.C_LONG.withName("remote_addr"),
                Ibverbs.C_INT.withName("rkey"),
                MemoryLayout.paddingLayout(4)
            ).withName("$anon$1135:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final OfLong remote_addr$LAYOUT = (OfLong)$LAYOUT.select(groupElement("remote_addr"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static final OfLong remote_addr$layout() {
                return remote_addr$LAYOUT;
            }

            private static final long remote_addr$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static final long remote_addr$offset() {
                return remote_addr$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static long remote_addr(MemorySegment struct) {
                return struct.get(remote_addr$LAYOUT, remote_addr$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static void remote_addr(MemorySegment struct, long fieldValue) {
                struct.set(remote_addr$LAYOUT, remote_addr$OFFSET, fieldValue);
            }

            private static final OfInt rkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rkey"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static final OfInt rkey$layout() {
                return rkey$LAYOUT;
            }

            private static final long rkey$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static final long rkey$offset() {
                return rkey$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static int rkey(MemorySegment struct) {
                return struct.get(rkey$LAYOUT, rkey$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static void rkey(MemorySegment struct, int fieldValue) {
                struct.set(rkey$LAYOUT, rkey$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout rdma$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("rdma"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint32_t rkey;
         * } rdma
         * }
         */
        public static final GroupLayout rdma$layout() {
            return rdma$LAYOUT;
        }

        private static final long rdma$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint32_t rkey;
         * } rdma
         * }
         */
        public static final long rdma$offset() {
            return rdma$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint32_t rkey;
         * } rdma
         * }
         */
        public static MemorySegment rdma(MemorySegment union) {
            return union.asSlice(rdma$OFFSET, rdma$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint32_t rkey;
         * } rdma
         * }
         */
        public static void rdma(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, rdma$OFFSET, rdma$LAYOUT.byteSize());
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint64_t compare_add;
         *     uint64_t swap;
         *     uint32_t rkey;
         * }
         * }
         */
        public static class atomic {

            atomic() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                Ibverbs.C_LONG.withName("remote_addr"),
                Ibverbs.C_LONG.withName("compare_add"),
                Ibverbs.C_LONG.withName("swap"),
                Ibverbs.C_INT.withName("rkey"),
                MemoryLayout.paddingLayout(4)
            ).withName("$anon$1139:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final OfLong remote_addr$LAYOUT = (OfLong)$LAYOUT.select(groupElement("remote_addr"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static final OfLong remote_addr$layout() {
                return remote_addr$LAYOUT;
            }

            private static final long remote_addr$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static final long remote_addr$offset() {
                return remote_addr$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static long remote_addr(MemorySegment struct) {
                return struct.get(remote_addr$LAYOUT, remote_addr$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t remote_addr
             * }
             */
            public static void remote_addr(MemorySegment struct, long fieldValue) {
                struct.set(remote_addr$LAYOUT, remote_addr$OFFSET, fieldValue);
            }

            private static final OfLong compare_add$LAYOUT = (OfLong)$LAYOUT.select(groupElement("compare_add"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t compare_add
             * }
             */
            public static final OfLong compare_add$layout() {
                return compare_add$LAYOUT;
            }

            private static final long compare_add$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t compare_add
             * }
             */
            public static final long compare_add$offset() {
                return compare_add$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t compare_add
             * }
             */
            public static long compare_add(MemorySegment struct) {
                return struct.get(compare_add$LAYOUT, compare_add$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t compare_add
             * }
             */
            public static void compare_add(MemorySegment struct, long fieldValue) {
                struct.set(compare_add$LAYOUT, compare_add$OFFSET, fieldValue);
            }

            private static final OfLong swap$LAYOUT = (OfLong)$LAYOUT.select(groupElement("swap"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t swap
             * }
             */
            public static final OfLong swap$layout() {
                return swap$LAYOUT;
            }

            private static final long swap$OFFSET = 16;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t swap
             * }
             */
            public static final long swap$offset() {
                return swap$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t swap
             * }
             */
            public static long swap(MemorySegment struct) {
                return struct.get(swap$LAYOUT, swap$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t swap
             * }
             */
            public static void swap(MemorySegment struct, long fieldValue) {
                struct.set(swap$LAYOUT, swap$OFFSET, fieldValue);
            }

            private static final OfInt rkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rkey"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static final OfInt rkey$layout() {
                return rkey$LAYOUT;
            }

            private static final long rkey$OFFSET = 24;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static final long rkey$offset() {
                return rkey$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static int rkey(MemorySegment struct) {
                return struct.get(rkey$LAYOUT, rkey$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint32_t rkey
             * }
             */
            public static void rkey(MemorySegment struct, int fieldValue) {
                struct.set(rkey$LAYOUT, rkey$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout atomic$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("atomic"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint64_t compare_add;
         *     uint64_t swap;
         *     uint32_t rkey;
         * } atomic
         * }
         */
        public static final GroupLayout atomic$layout() {
            return atomic$LAYOUT;
        }

        private static final long atomic$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint64_t compare_add;
         *     uint64_t swap;
         *     uint32_t rkey;
         * } atomic
         * }
         */
        public static final long atomic$offset() {
            return atomic$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint64_t compare_add;
         *     uint64_t swap;
         *     uint32_t rkey;
         * } atomic
         * }
         */
        public static MemorySegment atomic(MemorySegment union) {
            return union.asSlice(atomic$OFFSET, atomic$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t remote_addr;
         *     uint64_t compare_add;
         *     uint64_t swap;
         *     uint32_t rkey;
         * } atomic
         * }
         */
        public static void atomic(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, atomic$OFFSET, atomic$LAYOUT.byteSize());
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     struct ibv_ah *ah;
         *     uint32_t remote_qpn;
         *     uint32_t remote_qkey;
         * }
         * }
         */
        public static class ud {

            ud() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                Ibverbs.C_POINTER.withName("ah"),
                Ibverbs.C_INT.withName("remote_qpn"),
                Ibverbs.C_INT.withName("remote_qkey")
            ).withName("$anon$1145:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final AddressLayout ah$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ah"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * struct ibv_ah *ah
             * }
             */
            public static final AddressLayout ah$layout() {
                return ah$LAYOUT;
            }

            private static final long ah$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * struct ibv_ah *ah
             * }
             */
            public static final long ah$offset() {
                return ah$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * struct ibv_ah *ah
             * }
             */
            public static MemorySegment ah(MemorySegment struct) {
                return struct.get(ah$LAYOUT, ah$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * struct ibv_ah *ah
             * }
             */
            public static void ah(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(ah$LAYOUT, ah$OFFSET, fieldValue);
            }

            private static final OfInt remote_qpn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("remote_qpn"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint32_t remote_qpn
             * }
             */
            public static final OfInt remote_qpn$layout() {
                return remote_qpn$LAYOUT;
            }

            private static final long remote_qpn$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint32_t remote_qpn
             * }
             */
            public static final long remote_qpn$offset() {
                return remote_qpn$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint32_t remote_qpn
             * }
             */
            public static int remote_qpn(MemorySegment struct) {
                return struct.get(remote_qpn$LAYOUT, remote_qpn$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint32_t remote_qpn
             * }
             */
            public static void remote_qpn(MemorySegment struct, int fieldValue) {
                struct.set(remote_qpn$LAYOUT, remote_qpn$OFFSET, fieldValue);
            }

            private static final OfInt remote_qkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("remote_qkey"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint32_t remote_qkey
             * }
             */
            public static final OfInt remote_qkey$layout() {
                return remote_qkey$LAYOUT;
            }

            private static final long remote_qkey$OFFSET = 12;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint32_t remote_qkey
             * }
             */
            public static final long remote_qkey$offset() {
                return remote_qkey$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint32_t remote_qkey
             * }
             */
            public static int remote_qkey(MemorySegment struct) {
                return struct.get(remote_qkey$LAYOUT, remote_qkey$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint32_t remote_qkey
             * }
             */
            public static void remote_qkey(MemorySegment struct, int fieldValue) {
                struct.set(remote_qkey$LAYOUT, remote_qkey$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout ud$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ud"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     struct ibv_ah *ah;
         *     uint32_t remote_qpn;
         *     uint32_t remote_qkey;
         * } ud
         * }
         */
        public static final GroupLayout ud$layout() {
            return ud$LAYOUT;
        }

        private static final long ud$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     struct ibv_ah *ah;
         *     uint32_t remote_qpn;
         *     uint32_t remote_qkey;
         * } ud
         * }
         */
        public static final long ud$offset() {
            return ud$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     struct ibv_ah *ah;
         *     uint32_t remote_qpn;
         *     uint32_t remote_qkey;
         * } ud
         * }
         */
        public static MemorySegment ud(MemorySegment union) {
            return union.asSlice(ud$OFFSET, ud$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     struct ibv_ah *ah;
         *     uint32_t remote_qpn;
         *     uint32_t remote_qkey;
         * } ud
         * }
         */
        public static void ud(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, ud$OFFSET, ud$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout wr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint64_t remote_addr;
     *         uint32_t rkey;
     *     } rdma;
     *     struct {
     *         uint64_t remote_addr;
     *         uint64_t compare_add;
     *         uint64_t swap;
     *         uint32_t rkey;
     *     } atomic;
     *     struct {
     *         struct ibv_ah *ah;
     *         uint32_t remote_qpn;
     *         uint32_t remote_qkey;
     *     } ud;
     * } wr
     * }
     */
    public static final GroupLayout wr$layout() {
        return wr$LAYOUT;
    }

    private static final long wr$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint64_t remote_addr;
     *         uint32_t rkey;
     *     } rdma;
     *     struct {
     *         uint64_t remote_addr;
     *         uint64_t compare_add;
     *         uint64_t swap;
     *         uint32_t rkey;
     *     } atomic;
     *     struct {
     *         struct ibv_ah *ah;
     *         uint32_t remote_qpn;
     *         uint32_t remote_qkey;
     *     } ud;
     * } wr
     * }
     */
    public static final long wr$offset() {
        return wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint64_t remote_addr;
     *         uint32_t rkey;
     *     } rdma;
     *     struct {
     *         uint64_t remote_addr;
     *         uint64_t compare_add;
     *         uint64_t swap;
     *         uint32_t rkey;
     *     } atomic;
     *     struct {
     *         struct ibv_ah *ah;
     *         uint32_t remote_qpn;
     *         uint32_t remote_qkey;
     *     } ud;
     * } wr
     * }
     */
    public static MemorySegment wr(MemorySegment struct) {
        return struct.asSlice(wr$OFFSET, wr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint64_t remote_addr;
     *         uint32_t rkey;
     *     } rdma;
     *     struct {
     *         uint64_t remote_addr;
     *         uint64_t compare_add;
     *         uint64_t swap;
     *         uint32_t rkey;
     *     } atomic;
     *     struct {
     *         struct ibv_ah *ah;
     *         uint32_t remote_qpn;
     *         uint32_t remote_qkey;
     *     } ud;
     * } wr
     * }
     */
    public static void wr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, wr$OFFSET, wr$LAYOUT.byteSize());
    }

    /**
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint32_t remote_srqn;
     *     } xrc;
     * }
     * }
     */
    public static class qp_type {

        qp_type() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            ibv_send_wr.qp_type.xrc.layout().withName("xrc")
        ).withName("$anon$1151:2");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     uint32_t remote_srqn;
         * }
         * }
         */
        public static class xrc {

            xrc() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                Ibverbs.C_INT.withName("remote_srqn")
            ).withName("$anon$1152:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final OfInt remote_srqn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("remote_srqn"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint32_t remote_srqn
             * }
             */
            public static final OfInt remote_srqn$layout() {
                return remote_srqn$LAYOUT;
            }

            private static final long remote_srqn$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint32_t remote_srqn
             * }
             */
            public static final long remote_srqn$offset() {
                return remote_srqn$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint32_t remote_srqn
             * }
             */
            public static int remote_srqn(MemorySegment struct) {
                return struct.get(remote_srqn$LAYOUT, remote_srqn$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint32_t remote_srqn
             * }
             */
            public static void remote_srqn(MemorySegment struct, int fieldValue) {
                struct.set(remote_srqn$LAYOUT, remote_srqn$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout xrc$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("xrc"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     uint32_t remote_srqn;
         * } xrc
         * }
         */
        public static final GroupLayout xrc$layout() {
            return xrc$LAYOUT;
        }

        private static final long xrc$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     uint32_t remote_srqn;
         * } xrc
         * }
         */
        public static final long xrc$offset() {
            return xrc$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     uint32_t remote_srqn;
         * } xrc
         * }
         */
        public static MemorySegment xrc(MemorySegment union) {
            return union.asSlice(xrc$OFFSET, xrc$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     uint32_t remote_srqn;
         * } xrc
         * }
         */
        public static void xrc(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, xrc$OFFSET, xrc$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout qp_type$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint32_t remote_srqn;
     *     } xrc;
     * } qp_type
     * }
     */
    public static final GroupLayout qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint32_t remote_srqn;
     *     } xrc;
     * } qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint32_t remote_srqn;
     *     } xrc;
     * } qp_type
     * }
     */
    public static MemorySegment qp_type(MemorySegment struct) {
        return struct.asSlice(qp_type$OFFSET, qp_type$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     struct {
     *         uint32_t remote_srqn;
     *     } xrc;
     * } qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, qp_type$OFFSET, qp_type$LAYOUT.byteSize());
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     struct ibv_mw *mw;
     *     uint32_t rkey;
     *     struct ibv_mw_bind_info bind_info;
     * }
     * }
     */
    public static class bind_mw {

        bind_mw() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            Ibverbs.C_POINTER.withName("mw"),
            Ibverbs.C_INT.withName("rkey"),
            MemoryLayout.paddingLayout(4),
            ibv_mw_bind_info.layout().withName("bind_info")
        ).withName("$anon$1157:3");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final AddressLayout mw$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("mw"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct ibv_mw *mw
         * }
         */
        public static final AddressLayout mw$layout() {
            return mw$LAYOUT;
        }

        private static final long mw$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct ibv_mw *mw
         * }
         */
        public static final long mw$offset() {
            return mw$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct ibv_mw *mw
         * }
         */
        public static MemorySegment mw(MemorySegment struct) {
            return struct.get(mw$LAYOUT, mw$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct ibv_mw *mw
         * }
         */
        public static void mw(MemorySegment struct, MemorySegment fieldValue) {
            struct.set(mw$LAYOUT, mw$OFFSET, fieldValue);
        }

        private static final OfInt rkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rkey"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t rkey
         * }
         */
        public static final OfInt rkey$layout() {
            return rkey$LAYOUT;
        }

        private static final long rkey$OFFSET = 8;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t rkey
         * }
         */
        public static final long rkey$offset() {
            return rkey$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t rkey
         * }
         */
        public static int rkey(MemorySegment struct) {
            return struct.get(rkey$LAYOUT, rkey$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t rkey
         * }
         */
        public static void rkey(MemorySegment struct, int fieldValue) {
            struct.set(rkey$LAYOUT, rkey$OFFSET, fieldValue);
        }

        private static final GroupLayout bind_info$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("bind_info"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct ibv_mw_bind_info bind_info
         * }
         */
        public static final GroupLayout bind_info$layout() {
            return bind_info$LAYOUT;
        }

        private static final long bind_info$OFFSET = 16;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct ibv_mw_bind_info bind_info
         * }
         */
        public static final long bind_info$offset() {
            return bind_info$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct ibv_mw_bind_info bind_info
         * }
         */
        public static MemorySegment bind_info(MemorySegment struct) {
            return struct.asSlice(bind_info$OFFSET, bind_info$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct ibv_mw_bind_info bind_info
         * }
         */
        public static void bind_info(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, bind_info$OFFSET, bind_info$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout bind_mw$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1156:2"), groupElement("bind_mw"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     struct ibv_mw *mw;
     *     uint32_t rkey;
     *     struct ibv_mw_bind_info bind_info;
     * } bind_mw
     * }
     */
    public static final GroupLayout bind_mw$layout() {
        return bind_mw$LAYOUT;
    }

    private static final long bind_mw$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     struct ibv_mw *mw;
     *     uint32_t rkey;
     *     struct ibv_mw_bind_info bind_info;
     * } bind_mw
     * }
     */
    public static final long bind_mw$offset() {
        return bind_mw$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     struct ibv_mw *mw;
     *     uint32_t rkey;
     *     struct ibv_mw_bind_info bind_info;
     * } bind_mw
     * }
     */
    public static MemorySegment bind_mw(MemorySegment struct) {
        return struct.asSlice(bind_mw$OFFSET, bind_mw$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     struct ibv_mw *mw;
     *     uint32_t rkey;
     *     struct ibv_mw_bind_info bind_info;
     * } bind_mw
     * }
     */
    public static void bind_mw(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, bind_mw$OFFSET, bind_mw$LAYOUT.byteSize());
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     void *hdr;
     *     uint16_t hdr_sz;
     *     uint16_t mss;
     * }
     * }
     */
    public static class tso {

        tso() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            Ibverbs.C_POINTER.withName("hdr"),
            Ibverbs.C_SHORT.withName("hdr_sz"),
            Ibverbs.C_SHORT.withName("mss"),
            MemoryLayout.paddingLayout(4)
        ).withName("$anon$1162:3");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final AddressLayout hdr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("hdr"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * void *hdr
         * }
         */
        public static final AddressLayout hdr$layout() {
            return hdr$LAYOUT;
        }

        private static final long hdr$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * void *hdr
         * }
         */
        public static final long hdr$offset() {
            return hdr$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * void *hdr
         * }
         */
        public static MemorySegment hdr(MemorySegment struct) {
            return struct.get(hdr$LAYOUT, hdr$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * void *hdr
         * }
         */
        public static void hdr(MemorySegment struct, MemorySegment fieldValue) {
            struct.set(hdr$LAYOUT, hdr$OFFSET, fieldValue);
        }

        private static final OfShort hdr_sz$LAYOUT = (OfShort)$LAYOUT.select(groupElement("hdr_sz"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint16_t hdr_sz
         * }
         */
        public static final OfShort hdr_sz$layout() {
            return hdr_sz$LAYOUT;
        }

        private static final long hdr_sz$OFFSET = 8;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint16_t hdr_sz
         * }
         */
        public static final long hdr_sz$offset() {
            return hdr_sz$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint16_t hdr_sz
         * }
         */
        public static short hdr_sz(MemorySegment struct) {
            return struct.get(hdr_sz$LAYOUT, hdr_sz$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint16_t hdr_sz
         * }
         */
        public static void hdr_sz(MemorySegment struct, short fieldValue) {
            struct.set(hdr_sz$LAYOUT, hdr_sz$OFFSET, fieldValue);
        }

        private static final OfShort mss$LAYOUT = (OfShort)$LAYOUT.select(groupElement("mss"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint16_t mss
         * }
         */
        public static final OfShort mss$layout() {
            return mss$LAYOUT;
        }

        private static final long mss$OFFSET = 10;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint16_t mss
         * }
         */
        public static final long mss$offset() {
            return mss$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint16_t mss
         * }
         */
        public static short mss(MemorySegment struct) {
            return struct.get(mss$LAYOUT, mss$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint16_t mss
         * }
         */
        public static void mss(MemorySegment struct, short fieldValue) {
            struct.set(mss$LAYOUT, mss$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout tso$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("$anon$1156:2"), groupElement("tso"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     void *hdr;
     *     uint16_t hdr_sz;
     *     uint16_t mss;
     * } tso
     * }
     */
    public static final GroupLayout tso$layout() {
        return tso$LAYOUT;
    }

    private static final long tso$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     void *hdr;
     *     uint16_t hdr_sz;
     *     uint16_t mss;
     * } tso
     * }
     */
    public static final long tso$offset() {
        return tso$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     void *hdr;
     *     uint16_t hdr_sz;
     *     uint16_t mss;
     * } tso
     * }
     */
    public static MemorySegment tso(MemorySegment struct) {
        return struct.asSlice(tso$OFFSET, tso$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     void *hdr;
     *     uint16_t hdr_sz;
     *     uint16_t mss;
     * } tso
     * }
     */
    public static void tso(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tso$OFFSET, tso$LAYOUT.byteSize());
    }

    /**
