// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_rx_hash_conf {
 *     uint8_t rx_hash_function;
 *     uint8_t rx_hash_key_len;
 *     uint8_t *rx_hash_key;
 *     uint64_t rx_hash_fields_mask;
 * }
 * }
 */
public class ibv_rx_hash_conf {

    ibv_rx_hash_conf() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_CHAR.withName("rx_hash_function"),
        Ibverbs.C_CHAR.withName("rx_hash_key_len"),
        MemoryLayout.paddingLayout(6),
        Ibverbs.C_POINTER.withName("rx_hash_key"),
        Ibverbs.C_LONG.withName("rx_hash_fields_mask")
    ).withName("ibv_rx_hash_conf");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfByte rx_hash_function$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rx_hash_function"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static final OfByte rx_hash_function$layout() {
        return rx_hash_function$LAYOUT;
    }

    private static final long rx_hash_function$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static final long rx_hash_function$offset() {
        return rx_hash_function$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static byte rx_hash_function(MemorySegment struct) {
        return struct.get(rx_hash_function$LAYOUT, rx_hash_function$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static void rx_hash_function(MemorySegment struct, byte fieldValue) {
        struct.set(rx_hash_function$LAYOUT, rx_hash_function$OFFSET, fieldValue);
    }

    private static final OfByte rx_hash_key_len$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rx_hash_key_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_key_len
     * }
     */
    public static final OfByte rx_hash_key_len$layout() {
        return rx_hash_key_len$LAYOUT;
    }

    private static final long rx_hash_key_len$OFFSET = 1;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_key_len
     * }
     */
    public static final long rx_hash_key_len$offset() {
        return rx_hash_key_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_key_len
     * }
     */
    public static byte rx_hash_key_len(MemorySegment struct) {
        return struct.get(rx_hash_key_len$LAYOUT, rx_hash_key_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_key_len
     * }
     */
    public static void rx_hash_key_len(MemorySegment struct, byte fieldValue) {
        struct.set(rx_hash_key_len$LAYOUT, rx_hash_key_len$OFFSET, fieldValue);
    }

    private static final AddressLayout rx_hash_key$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rx_hash_key"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t *rx_hash_key
     * }
     */
    public static final AddressLayout rx_hash_key$layout() {
        return rx_hash_key$LAYOUT;
    }

    private static final long rx_hash_key$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t *rx_hash_key
     * }
     */
    public static final long rx_hash_key$offset() {
        return rx_hash_key$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t *rx_hash_key
     * }
     */
    public static MemorySegment rx_hash_key(MemorySegment struct) {
        return struct.get(rx_hash_key$LAYOUT, rx_hash_key$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t *rx_hash_key
     * }
     */
    public static void rx_hash_key(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rx_hash_key$LAYOUT, rx_hash_key$OFFSET, fieldValue);
    }

    private static final OfLong rx_hash_fields_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("rx_hash_fields_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static final OfLong rx_hash_fields_mask$layout() {
        return rx_hash_fields_mask$LAYOUT;
    }

    private static final long rx_hash_fields_mask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static final long rx_hash_fields_mask$offset() {
        return rx_hash_fields_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static long rx_hash_fields_mask(MemorySegment struct) {
        return struct.get(rx_hash_fields_mask$LAYOUT, rx_hash_fields_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static void rx_hash_fields_mask(MemorySegment struct, long fieldValue) {
        struct.set(rx_hash_fields_mask$LAYOUT, rx_hash_fields_mask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

