// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_grh {
 *     __be32 version_tclass_flow;
 *     __be16 paylen;
 *     uint8_t next_hdr;
 *     uint8_t hop_limit;
 *     union ibv_gid sgid;
 *     union ibv_gid dgid;
 * }
 * }
 */
public class ibv_grh {

    ibv_grh() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("version_tclass_flow"),
        Ibverbs.C_SHORT.withName("paylen"),
        Ibverbs.C_CHAR.withName("next_hdr"),
        Ibverbs.C_CHAR.withName("hop_limit"),
        ibv_gid.layout().withName("sgid"),
        ibv_gid.layout().withName("dgid")
    ).withName("ibv_grh");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt version_tclass_flow$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version_tclass_flow"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be32 version_tclass_flow
     * }
     */
    public static final OfInt version_tclass_flow$layout() {
        return version_tclass_flow$LAYOUT;
    }

    private static final long version_tclass_flow$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be32 version_tclass_flow
     * }
     */
    public static final long version_tclass_flow$offset() {
        return version_tclass_flow$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be32 version_tclass_flow
     * }
     */
    public static int version_tclass_flow(MemorySegment struct) {
        return struct.get(version_tclass_flow$LAYOUT, version_tclass_flow$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be32 version_tclass_flow
     * }
     */
    public static void version_tclass_flow(MemorySegment struct, int fieldValue) {
        struct.set(version_tclass_flow$LAYOUT, version_tclass_flow$OFFSET, fieldValue);
    }

    private static final OfShort paylen$LAYOUT = (OfShort)$LAYOUT.select(groupElement("paylen"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be16 paylen
     * }
     */
    public static final OfShort paylen$layout() {
        return paylen$LAYOUT;
    }

    private static final long paylen$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be16 paylen
     * }
     */
    public static final long paylen$offset() {
        return paylen$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be16 paylen
     * }
     */
    public static short paylen(MemorySegment struct) {
        return struct.get(paylen$LAYOUT, paylen$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be16 paylen
     * }
     */
    public static void paylen(MemorySegment struct, short fieldValue) {
        struct.set(paylen$LAYOUT, paylen$OFFSET, fieldValue);
    }

    private static final OfByte next_hdr$LAYOUT = (OfByte)$LAYOUT.select(groupElement("next_hdr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t next_hdr
     * }
     */
    public static final OfByte next_hdr$layout() {
        return next_hdr$LAYOUT;
    }

    private static final long next_hdr$OFFSET = 6;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t next_hdr
     * }
     */
    public static final long next_hdr$offset() {
        return next_hdr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t next_hdr
     * }
     */
    public static byte next_hdr(MemorySegment struct) {
        return struct.get(next_hdr$LAYOUT, next_hdr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t next_hdr
     * }
     */
    public static void next_hdr(MemorySegment struct, byte fieldValue) {
        struct.set(next_hdr$LAYOUT, next_hdr$OFFSET, fieldValue);
    }

    private static final OfByte hop_limit$LAYOUT = (OfByte)$LAYOUT.select(groupElement("hop_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final OfByte hop_limit$layout() {
        return hop_limit$LAYOUT;
    }

    private static final long hop_limit$OFFSET = 7;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static final long hop_limit$offset() {
        return hop_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static byte hop_limit(MemorySegment struct) {
        return struct.get(hop_limit$LAYOUT, hop_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t hop_limit
     * }
     */
    public static void hop_limit(MemorySegment struct, byte fieldValue) {
        struct.set(hop_limit$LAYOUT, hop_limit$OFFSET, fieldValue);
    }

    private static final GroupLayout sgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("sgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static final GroupLayout sgid$layout() {
        return sgid$LAYOUT;
    }

    private static final long sgid$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static final long sgid$offset() {
        return sgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static MemorySegment sgid(MemorySegment struct) {
        return struct.asSlice(sgid$OFFSET, sgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid sgid
     * }
     */
    public static void sgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, sgid$OFFSET, sgid$LAYOUT.byteSize());
    }

    private static final GroupLayout dgid$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("dgid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final GroupLayout dgid$layout() {
        return dgid$LAYOUT;
    }

    private static final long dgid$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static final long dgid$offset() {
        return dgid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static MemorySegment dgid(MemorySegment struct) {
        return struct.asSlice(dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ibv_gid dgid
     * }
     */
    public static void dgid(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dgid$OFFSET, dgid$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

