// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_srq_init_attr_ex {
 *     void *srq_context;
 *     struct ibv_srq_attr attr;
 *     uint32_t comp_mask;
 *     enum ibv_srq_type srq_type;
 *     struct ibv_pd *pd;
 *     struct ibv_xrcd *xrcd;
 *     struct ibv_cq *cq;
 *     struct ibv_tm_cap tm_cap;
 * }
 * }
 */
public class ibv_srq_init_attr_ex {

    ibv_srq_init_attr_ex() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_POINTER.withName("srq_context"),
        ibv_srq_attr.layout().withName("attr"),
        Ibverbs.C_INT.withName("comp_mask"),
        Ibverbs.C_INT.withName("srq_type"),
        MemoryLayout.paddingLayout(4),
        Ibverbs.C_POINTER.withName("pd"),
        Ibverbs.C_POINTER.withName("xrcd"),
        Ibverbs.C_POINTER.withName("cq"),
        ibv_tm_cap.layout().withName("tm_cap")
    ).withName("ibv_srq_init_attr_ex");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout srq_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static final AddressLayout srq_context$layout() {
        return srq_context$LAYOUT;
    }

    private static final long srq_context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static final long srq_context$offset() {
        return srq_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static MemorySegment srq_context(MemorySegment struct) {
        return struct.get(srq_context$LAYOUT, srq_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *srq_context
     * }
     */
    public static void srq_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srq_context$LAYOUT, srq_context$OFFSET, fieldValue);
    }

    private static final GroupLayout attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_srq_attr attr
     * }
     */
    public static final GroupLayout attr$layout() {
        return attr$LAYOUT;
    }

    private static final long attr$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_srq_attr attr
     * }
     */
    public static final long attr$offset() {
        return attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_srq_attr attr
     * }
     */
    public static MemorySegment attr(MemorySegment struct) {
        return struct.asSlice(attr$OFFSET, attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_srq_attr attr
     * }
     */
    public static void attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, attr$OFFSET, attr$LAYOUT.byteSize());
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt srq_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("srq_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_srq_type srq_type
     * }
     */
    public static final OfInt srq_type$layout() {
        return srq_type$LAYOUT;
    }

    private static final long srq_type$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_srq_type srq_type
     * }
     */
    public static final long srq_type$offset() {
        return srq_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_srq_type srq_type
     * }
     */
    public static int srq_type(MemorySegment struct) {
        return struct.get(srq_type$LAYOUT, srq_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_srq_type srq_type
     * }
     */
    public static void srq_type(MemorySegment struct, int fieldValue) {
        struct.set(srq_type$LAYOUT, srq_type$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final AddressLayout xrcd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("xrcd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static final AddressLayout xrcd$layout() {
        return xrcd$LAYOUT;
    }

    private static final long xrcd$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static final long xrcd$offset() {
        return xrcd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static MemorySegment xrcd(MemorySegment struct) {
        return struct.get(xrcd$LAYOUT, xrcd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static void xrcd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(xrcd$LAYOUT, xrcd$OFFSET, fieldValue);
    }

    private static final AddressLayout cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static final AddressLayout cq$layout() {
        return cq$LAYOUT;
    }

    private static final long cq$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static final long cq$offset() {
        return cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static MemorySegment cq(MemorySegment struct) {
        return struct.get(cq$LAYOUT, cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *cq
     * }
     */
    public static void cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cq$LAYOUT, cq$OFFSET, fieldValue);
    }

    private static final GroupLayout tm_cap$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("tm_cap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_tm_cap tm_cap
     * }
     */
    public static final GroupLayout tm_cap$layout() {
        return tm_cap$LAYOUT;
    }

    private static final long tm_cap$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_tm_cap tm_cap
     * }
     */
    public static final long tm_cap$offset() {
        return tm_cap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_tm_cap tm_cap
     * }
     */
    public static MemorySegment tm_cap(MemorySegment struct) {
        return struct.asSlice(tm_cap$OFFSET, tm_cap$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_tm_cap tm_cap
     * }
     */
    public static void tm_cap(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tm_cap$OFFSET, tm_cap$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

