// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_device_attr {
 *     char fw_ver[64];
 *     __be64 node_guid;
 *     __be64 sys_image_guid;
 *     uint64_t max_mr_size;
 *     uint64_t page_size_cap;
 *     uint32_t vendor_id;
 *     uint32_t vendor_part_id;
 *     uint32_t hw_ver;
 *     int max_qp;
 *     int max_qp_wr;
 *     unsigned int device_cap_flags;
 *     int max_sge;
 *     int max_sge_rd;
 *     int max_cq;
 *     int max_cqe;
 *     int max_mr;
 *     int max_pd;
 *     int max_qp_rd_atom;
 *     int max_ee_rd_atom;
 *     int max_res_rd_atom;
 *     int max_qp_init_rd_atom;
 *     int max_ee_init_rd_atom;
 *     enum ibv_atomic_cap atomic_cap;
 *     int max_ee;
 *     int max_rdd;
 *     int max_mw;
 *     int max_raw_ipv6_qp;
 *     int max_raw_ethy_qp;
 *     int max_mcast_grp;
 *     int max_mcast_qp_attach;
 *     int max_total_mcast_qp_attach;
 *     int max_ah;
 *     int max_fmr;
 *     int max_map_per_fmr;
 *     int max_srq;
 *     int max_srq_wr;
 *     int max_srq_sge;
 *     uint16_t max_pkeys;
 *     uint8_t local_ca_ack_delay;
 *     uint8_t phys_port_cnt;
 * }
 * }
 */
public class ibv_device_attr {

    ibv_device_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(64, Ibverbs.C_CHAR).withName("fw_ver"),
        Ibverbs.C_LONG_LONG.withName("node_guid"),
        Ibverbs.C_LONG_LONG.withName("sys_image_guid"),
        Ibverbs.C_LONG.withName("max_mr_size"),
        Ibverbs.C_LONG.withName("page_size_cap"),
        Ibverbs.C_INT.withName("vendor_id"),
        Ibverbs.C_INT.withName("vendor_part_id"),
        Ibverbs.C_INT.withName("hw_ver"),
        Ibverbs.C_INT.withName("max_qp"),
        Ibverbs.C_INT.withName("max_qp_wr"),
        Ibverbs.C_INT.withName("device_cap_flags"),
        Ibverbs.C_INT.withName("max_sge"),
        Ibverbs.C_INT.withName("max_sge_rd"),
        Ibverbs.C_INT.withName("max_cq"),
        Ibverbs.C_INT.withName("max_cqe"),
        Ibverbs.C_INT.withName("max_mr"),
        Ibverbs.C_INT.withName("max_pd"),
        Ibverbs.C_INT.withName("max_qp_rd_atom"),
        Ibverbs.C_INT.withName("max_ee_rd_atom"),
        Ibverbs.C_INT.withName("max_res_rd_atom"),
        Ibverbs.C_INT.withName("max_qp_init_rd_atom"),
        Ibverbs.C_INT.withName("max_ee_init_rd_atom"),
        Ibverbs.C_INT.withName("atomic_cap"),
        Ibverbs.C_INT.withName("max_ee"),
        Ibverbs.C_INT.withName("max_rdd"),
        Ibverbs.C_INT.withName("max_mw"),
        Ibverbs.C_INT.withName("max_raw_ipv6_qp"),
        Ibverbs.C_INT.withName("max_raw_ethy_qp"),
        Ibverbs.C_INT.withName("max_mcast_grp"),
        Ibverbs.C_INT.withName("max_mcast_qp_attach"),
        Ibverbs.C_INT.withName("max_total_mcast_qp_attach"),
        Ibverbs.C_INT.withName("max_ah"),
        Ibverbs.C_INT.withName("max_fmr"),
        Ibverbs.C_INT.withName("max_map_per_fmr"),
        Ibverbs.C_INT.withName("max_srq"),
        Ibverbs.C_INT.withName("max_srq_wr"),
        Ibverbs.C_INT.withName("max_srq_sge"),
        Ibverbs.C_SHORT.withName("max_pkeys"),
        Ibverbs.C_CHAR.withName("local_ca_ack_delay"),
        Ibverbs.C_CHAR.withName("phys_port_cnt"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_device_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout fw_ver$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("fw_ver"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static final SequenceLayout fw_ver$layout() {
        return fw_ver$LAYOUT;
    }

    private static final long fw_ver$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static final long fw_ver$offset() {
        return fw_ver$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static MemorySegment fw_ver(MemorySegment struct) {
        return struct.asSlice(fw_ver$OFFSET, fw_ver$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static void fw_ver(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, fw_ver$OFFSET, fw_ver$LAYOUT.byteSize());
    }

    private static long[] fw_ver$DIMS = { 64 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static long[] fw_ver$dimensions() {
        return fw_ver$DIMS;
    }
    private static final VarHandle fw_ver$ELEM_HANDLE = fw_ver$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static byte fw_ver(MemorySegment struct, long index0) {
        return (byte)fw_ver$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char fw_ver[64]
     * }
     */
    public static void fw_ver(MemorySegment struct, long index0, byte fieldValue) {
        fw_ver$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfLong node_guid$LAYOUT = (OfLong)$LAYOUT.select(groupElement("node_guid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be64 node_guid
     * }
     */
    public static final OfLong node_guid$layout() {
        return node_guid$LAYOUT;
    }

    private static final long node_guid$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be64 node_guid
     * }
     */
    public static final long node_guid$offset() {
        return node_guid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be64 node_guid
     * }
     */
    public static long node_guid(MemorySegment struct) {
        return struct.get(node_guid$LAYOUT, node_guid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be64 node_guid
     * }
     */
    public static void node_guid(MemorySegment struct, long fieldValue) {
        struct.set(node_guid$LAYOUT, node_guid$OFFSET, fieldValue);
    }

    private static final OfLong sys_image_guid$LAYOUT = (OfLong)$LAYOUT.select(groupElement("sys_image_guid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be64 sys_image_guid
     * }
     */
    public static final OfLong sys_image_guid$layout() {
        return sys_image_guid$LAYOUT;
    }

    private static final long sys_image_guid$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be64 sys_image_guid
     * }
     */
    public static final long sys_image_guid$offset() {
        return sys_image_guid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be64 sys_image_guid
     * }
     */
    public static long sys_image_guid(MemorySegment struct) {
        return struct.get(sys_image_guid$LAYOUT, sys_image_guid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be64 sys_image_guid
     * }
     */
    public static void sys_image_guid(MemorySegment struct, long fieldValue) {
        struct.set(sys_image_guid$LAYOUT, sys_image_guid$OFFSET, fieldValue);
    }

    private static final OfLong max_mr_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("max_mr_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t max_mr_size
     * }
     */
    public static final OfLong max_mr_size$layout() {
        return max_mr_size$LAYOUT;
    }

    private static final long max_mr_size$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t max_mr_size
     * }
     */
    public static final long max_mr_size$offset() {
        return max_mr_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t max_mr_size
     * }
     */
    public static long max_mr_size(MemorySegment struct) {
        return struct.get(max_mr_size$LAYOUT, max_mr_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t max_mr_size
     * }
     */
    public static void max_mr_size(MemorySegment struct, long fieldValue) {
        struct.set(max_mr_size$LAYOUT, max_mr_size$OFFSET, fieldValue);
    }

    private static final OfLong page_size_cap$LAYOUT = (OfLong)$LAYOUT.select(groupElement("page_size_cap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t page_size_cap
     * }
     */
    public static final OfLong page_size_cap$layout() {
        return page_size_cap$LAYOUT;
    }

    private static final long page_size_cap$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t page_size_cap
     * }
     */
    public static final long page_size_cap$offset() {
        return page_size_cap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t page_size_cap
     * }
     */
    public static long page_size_cap(MemorySegment struct) {
        return struct.get(page_size_cap$LAYOUT, page_size_cap$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t page_size_cap
     * }
     */
    public static void page_size_cap(MemorySegment struct, long fieldValue) {
        struct.set(page_size_cap$LAYOUT, page_size_cap$OFFSET, fieldValue);
    }

    private static final OfInt vendor_id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vendor_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vendor_id
     * }
     */
    public static final OfInt vendor_id$layout() {
        return vendor_id$LAYOUT;
    }

    private static final long vendor_id$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vendor_id
     * }
     */
    public static final long vendor_id$offset() {
        return vendor_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vendor_id
     * }
     */
    public static int vendor_id(MemorySegment struct) {
        return struct.get(vendor_id$LAYOUT, vendor_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vendor_id
     * }
     */
    public static void vendor_id(MemorySegment struct, int fieldValue) {
        struct.set(vendor_id$LAYOUT, vendor_id$OFFSET, fieldValue);
    }

    private static final OfInt vendor_part_id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vendor_part_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vendor_part_id
     * }
     */
    public static final OfInt vendor_part_id$layout() {
        return vendor_part_id$LAYOUT;
    }

    private static final long vendor_part_id$OFFSET = 100;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vendor_part_id
     * }
     */
    public static final long vendor_part_id$offset() {
        return vendor_part_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vendor_part_id
     * }
     */
    public static int vendor_part_id(MemorySegment struct) {
        return struct.get(vendor_part_id$LAYOUT, vendor_part_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vendor_part_id
     * }
     */
    public static void vendor_part_id(MemorySegment struct, int fieldValue) {
        struct.set(vendor_part_id$LAYOUT, vendor_part_id$OFFSET, fieldValue);
    }

    private static final OfInt hw_ver$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hw_ver"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t hw_ver
     * }
     */
    public static final OfInt hw_ver$layout() {
        return hw_ver$LAYOUT;
    }

    private static final long hw_ver$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t hw_ver
     * }
     */
    public static final long hw_ver$offset() {
        return hw_ver$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t hw_ver
     * }
     */
    public static int hw_ver(MemorySegment struct) {
        return struct.get(hw_ver$LAYOUT, hw_ver$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t hw_ver
     * }
     */
    public static void hw_ver(MemorySegment struct, int fieldValue) {
        struct.set(hw_ver$LAYOUT, hw_ver$OFFSET, fieldValue);
    }

    private static final OfInt max_qp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_qp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_qp
     * }
     */
    public static final OfInt max_qp$layout() {
        return max_qp$LAYOUT;
    }

    private static final long max_qp$OFFSET = 108;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_qp
     * }
     */
    public static final long max_qp$offset() {
        return max_qp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_qp
     * }
     */
    public static int max_qp(MemorySegment struct) {
        return struct.get(max_qp$LAYOUT, max_qp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_qp
     * }
     */
    public static void max_qp(MemorySegment struct, int fieldValue) {
        struct.set(max_qp$LAYOUT, max_qp$OFFSET, fieldValue);
    }

    private static final OfInt max_qp_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_qp_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_qp_wr
     * }
     */
    public static final OfInt max_qp_wr$layout() {
        return max_qp_wr$LAYOUT;
    }

    private static final long max_qp_wr$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_qp_wr
     * }
     */
    public static final long max_qp_wr$offset() {
        return max_qp_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_qp_wr
     * }
     */
    public static int max_qp_wr(MemorySegment struct) {
        return struct.get(max_qp_wr$LAYOUT, max_qp_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_qp_wr
     * }
     */
    public static void max_qp_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_qp_wr$LAYOUT, max_qp_wr$OFFSET, fieldValue);
    }

    private static final OfInt device_cap_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("device_cap_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int device_cap_flags
     * }
     */
    public static final OfInt device_cap_flags$layout() {
        return device_cap_flags$LAYOUT;
    }

    private static final long device_cap_flags$OFFSET = 116;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int device_cap_flags
     * }
     */
    public static final long device_cap_flags$offset() {
        return device_cap_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int device_cap_flags
     * }
     */
    public static int device_cap_flags(MemorySegment struct) {
        return struct.get(device_cap_flags$LAYOUT, device_cap_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int device_cap_flags
     * }
     */
    public static void device_cap_flags(MemorySegment struct, int fieldValue) {
        struct.set(device_cap_flags$LAYOUT, device_cap_flags$OFFSET, fieldValue);
    }

    private static final OfInt max_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_sge
     * }
     */
    public static final OfInt max_sge$layout() {
        return max_sge$LAYOUT;
    }

    private static final long max_sge$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_sge
     * }
     */
    public static final long max_sge$offset() {
        return max_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_sge
     * }
     */
    public static int max_sge(MemorySegment struct) {
        return struct.get(max_sge$LAYOUT, max_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_sge
     * }
     */
    public static void max_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_sge$LAYOUT, max_sge$OFFSET, fieldValue);
    }

    private static final OfInt max_sge_rd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge_rd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_sge_rd
     * }
     */
    public static final OfInt max_sge_rd$layout() {
        return max_sge_rd$LAYOUT;
    }

    private static final long max_sge_rd$OFFSET = 124;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_sge_rd
     * }
     */
    public static final long max_sge_rd$offset() {
        return max_sge_rd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_sge_rd
     * }
     */
    public static int max_sge_rd(MemorySegment struct) {
        return struct.get(max_sge_rd$LAYOUT, max_sge_rd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_sge_rd
     * }
     */
    public static void max_sge_rd(MemorySegment struct, int fieldValue) {
        struct.set(max_sge_rd$LAYOUT, max_sge_rd$OFFSET, fieldValue);
    }

    private static final OfInt max_cq$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_cq
     * }
     */
    public static final OfInt max_cq$layout() {
        return max_cq$LAYOUT;
    }

    private static final long max_cq$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_cq
     * }
     */
    public static final long max_cq$offset() {
        return max_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_cq
     * }
     */
    public static int max_cq(MemorySegment struct) {
        return struct.get(max_cq$LAYOUT, max_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_cq
     * }
     */
    public static void max_cq(MemorySegment struct, int fieldValue) {
        struct.set(max_cq$LAYOUT, max_cq$OFFSET, fieldValue);
    }

    private static final OfInt max_cqe$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_cqe"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_cqe
     * }
     */
    public static final OfInt max_cqe$layout() {
        return max_cqe$LAYOUT;
    }

    private static final long max_cqe$OFFSET = 132;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_cqe
     * }
     */
    public static final long max_cqe$offset() {
        return max_cqe$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_cqe
     * }
     */
    public static int max_cqe(MemorySegment struct) {
        return struct.get(max_cqe$LAYOUT, max_cqe$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_cqe
     * }
     */
    public static void max_cqe(MemorySegment struct, int fieldValue) {
        struct.set(max_cqe$LAYOUT, max_cqe$OFFSET, fieldValue);
    }

    private static final OfInt max_mr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_mr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_mr
     * }
     */
    public static final OfInt max_mr$layout() {
        return max_mr$LAYOUT;
    }

    private static final long max_mr$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_mr
     * }
     */
    public static final long max_mr$offset() {
        return max_mr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_mr
     * }
     */
    public static int max_mr(MemorySegment struct) {
        return struct.get(max_mr$LAYOUT, max_mr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_mr
     * }
     */
    public static void max_mr(MemorySegment struct, int fieldValue) {
        struct.set(max_mr$LAYOUT, max_mr$OFFSET, fieldValue);
    }

    private static final OfInt max_pd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_pd
     * }
     */
    public static final OfInt max_pd$layout() {
        return max_pd$LAYOUT;
    }

    private static final long max_pd$OFFSET = 140;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_pd
     * }
     */
    public static final long max_pd$offset() {
        return max_pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_pd
     * }
     */
    public static int max_pd(MemorySegment struct) {
        return struct.get(max_pd$LAYOUT, max_pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_pd
     * }
     */
    public static void max_pd(MemorySegment struct, int fieldValue) {
        struct.set(max_pd$LAYOUT, max_pd$OFFSET, fieldValue);
    }

    private static final OfInt max_qp_rd_atom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_qp_rd_atom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_qp_rd_atom
     * }
     */
    public static final OfInt max_qp_rd_atom$layout() {
        return max_qp_rd_atom$LAYOUT;
    }

    private static final long max_qp_rd_atom$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_qp_rd_atom
     * }
     */
    public static final long max_qp_rd_atom$offset() {
        return max_qp_rd_atom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_qp_rd_atom
     * }
     */
    public static int max_qp_rd_atom(MemorySegment struct) {
        return struct.get(max_qp_rd_atom$LAYOUT, max_qp_rd_atom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_qp_rd_atom
     * }
     */
    public static void max_qp_rd_atom(MemorySegment struct, int fieldValue) {
        struct.set(max_qp_rd_atom$LAYOUT, max_qp_rd_atom$OFFSET, fieldValue);
    }

    private static final OfInt max_ee_rd_atom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_ee_rd_atom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_ee_rd_atom
     * }
     */
    public static final OfInt max_ee_rd_atom$layout() {
        return max_ee_rd_atom$LAYOUT;
    }

    private static final long max_ee_rd_atom$OFFSET = 148;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_ee_rd_atom
     * }
     */
    public static final long max_ee_rd_atom$offset() {
        return max_ee_rd_atom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_ee_rd_atom
     * }
     */
    public static int max_ee_rd_atom(MemorySegment struct) {
        return struct.get(max_ee_rd_atom$LAYOUT, max_ee_rd_atom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_ee_rd_atom
     * }
     */
    public static void max_ee_rd_atom(MemorySegment struct, int fieldValue) {
        struct.set(max_ee_rd_atom$LAYOUT, max_ee_rd_atom$OFFSET, fieldValue);
    }

    private static final OfInt max_res_rd_atom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_res_rd_atom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_res_rd_atom
     * }
     */
    public static final OfInt max_res_rd_atom$layout() {
        return max_res_rd_atom$LAYOUT;
    }

    private static final long max_res_rd_atom$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_res_rd_atom
     * }
     */
    public static final long max_res_rd_atom$offset() {
        return max_res_rd_atom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_res_rd_atom
     * }
     */
    public static int max_res_rd_atom(MemorySegment struct) {
        return struct.get(max_res_rd_atom$LAYOUT, max_res_rd_atom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_res_rd_atom
     * }
     */
    public static void max_res_rd_atom(MemorySegment struct, int fieldValue) {
        struct.set(max_res_rd_atom$LAYOUT, max_res_rd_atom$OFFSET, fieldValue);
    }

    private static final OfInt max_qp_init_rd_atom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_qp_init_rd_atom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_qp_init_rd_atom
     * }
     */
    public static final OfInt max_qp_init_rd_atom$layout() {
        return max_qp_init_rd_atom$LAYOUT;
    }

    private static final long max_qp_init_rd_atom$OFFSET = 156;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_qp_init_rd_atom
     * }
     */
    public static final long max_qp_init_rd_atom$offset() {
        return max_qp_init_rd_atom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_qp_init_rd_atom
     * }
     */
    public static int max_qp_init_rd_atom(MemorySegment struct) {
        return struct.get(max_qp_init_rd_atom$LAYOUT, max_qp_init_rd_atom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_qp_init_rd_atom
     * }
     */
    public static void max_qp_init_rd_atom(MemorySegment struct, int fieldValue) {
        struct.set(max_qp_init_rd_atom$LAYOUT, max_qp_init_rd_atom$OFFSET, fieldValue);
    }

    private static final OfInt max_ee_init_rd_atom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_ee_init_rd_atom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_ee_init_rd_atom
     * }
     */
    public static final OfInt max_ee_init_rd_atom$layout() {
        return max_ee_init_rd_atom$LAYOUT;
    }

    private static final long max_ee_init_rd_atom$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_ee_init_rd_atom
     * }
     */
    public static final long max_ee_init_rd_atom$offset() {
        return max_ee_init_rd_atom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_ee_init_rd_atom
     * }
     */
    public static int max_ee_init_rd_atom(MemorySegment struct) {
        return struct.get(max_ee_init_rd_atom$LAYOUT, max_ee_init_rd_atom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_ee_init_rd_atom
     * }
     */
    public static void max_ee_init_rd_atom(MemorySegment struct, int fieldValue) {
        struct.set(max_ee_init_rd_atom$LAYOUT, max_ee_init_rd_atom$OFFSET, fieldValue);
    }

    private static final OfInt atomic_cap$LAYOUT = (OfInt)$LAYOUT.select(groupElement("atomic_cap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_atomic_cap atomic_cap
     * }
     */
    public static final OfInt atomic_cap$layout() {
        return atomic_cap$LAYOUT;
    }

    private static final long atomic_cap$OFFSET = 164;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_atomic_cap atomic_cap
     * }
     */
    public static final long atomic_cap$offset() {
        return atomic_cap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_atomic_cap atomic_cap
     * }
     */
    public static int atomic_cap(MemorySegment struct) {
        return struct.get(atomic_cap$LAYOUT, atomic_cap$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_atomic_cap atomic_cap
     * }
     */
    public static void atomic_cap(MemorySegment struct, int fieldValue) {
        struct.set(atomic_cap$LAYOUT, atomic_cap$OFFSET, fieldValue);
    }

    private static final OfInt max_ee$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_ee"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_ee
     * }
     */
    public static final OfInt max_ee$layout() {
        return max_ee$LAYOUT;
    }

    private static final long max_ee$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_ee
     * }
     */
    public static final long max_ee$offset() {
        return max_ee$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_ee
     * }
     */
    public static int max_ee(MemorySegment struct) {
        return struct.get(max_ee$LAYOUT, max_ee$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_ee
     * }
     */
    public static void max_ee(MemorySegment struct, int fieldValue) {
        struct.set(max_ee$LAYOUT, max_ee$OFFSET, fieldValue);
    }

    private static final OfInt max_rdd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_rdd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_rdd
     * }
     */
    public static final OfInt max_rdd$layout() {
        return max_rdd$LAYOUT;
    }

    private static final long max_rdd$OFFSET = 172;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_rdd
     * }
     */
    public static final long max_rdd$offset() {
        return max_rdd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_rdd
     * }
     */
    public static int max_rdd(MemorySegment struct) {
        return struct.get(max_rdd$LAYOUT, max_rdd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_rdd
     * }
     */
    public static void max_rdd(MemorySegment struct, int fieldValue) {
        struct.set(max_rdd$LAYOUT, max_rdd$OFFSET, fieldValue);
    }

    private static final OfInt max_mw$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_mw"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_mw
     * }
     */
    public static final OfInt max_mw$layout() {
        return max_mw$LAYOUT;
    }

    private static final long max_mw$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_mw
     * }
     */
    public static final long max_mw$offset() {
        return max_mw$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_mw
     * }
     */
    public static int max_mw(MemorySegment struct) {
        return struct.get(max_mw$LAYOUT, max_mw$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_mw
     * }
     */
    public static void max_mw(MemorySegment struct, int fieldValue) {
        struct.set(max_mw$LAYOUT, max_mw$OFFSET, fieldValue);
    }

    private static final OfInt max_raw_ipv6_qp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_raw_ipv6_qp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_raw_ipv6_qp
     * }
     */
    public static final OfInt max_raw_ipv6_qp$layout() {
        return max_raw_ipv6_qp$LAYOUT;
    }

    private static final long max_raw_ipv6_qp$OFFSET = 180;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_raw_ipv6_qp
     * }
     */
    public static final long max_raw_ipv6_qp$offset() {
        return max_raw_ipv6_qp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_raw_ipv6_qp
     * }
     */
    public static int max_raw_ipv6_qp(MemorySegment struct) {
        return struct.get(max_raw_ipv6_qp$LAYOUT, max_raw_ipv6_qp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_raw_ipv6_qp
     * }
     */
    public static void max_raw_ipv6_qp(MemorySegment struct, int fieldValue) {
        struct.set(max_raw_ipv6_qp$LAYOUT, max_raw_ipv6_qp$OFFSET, fieldValue);
    }

    private static final OfInt max_raw_ethy_qp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_raw_ethy_qp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_raw_ethy_qp
     * }
     */
    public static final OfInt max_raw_ethy_qp$layout() {
        return max_raw_ethy_qp$LAYOUT;
    }

    private static final long max_raw_ethy_qp$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_raw_ethy_qp
     * }
     */
    public static final long max_raw_ethy_qp$offset() {
        return max_raw_ethy_qp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_raw_ethy_qp
     * }
     */
    public static int max_raw_ethy_qp(MemorySegment struct) {
        return struct.get(max_raw_ethy_qp$LAYOUT, max_raw_ethy_qp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_raw_ethy_qp
     * }
     */
    public static void max_raw_ethy_qp(MemorySegment struct, int fieldValue) {
        struct.set(max_raw_ethy_qp$LAYOUT, max_raw_ethy_qp$OFFSET, fieldValue);
    }

    private static final OfInt max_mcast_grp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_mcast_grp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_mcast_grp
     * }
     */
    public static final OfInt max_mcast_grp$layout() {
        return max_mcast_grp$LAYOUT;
    }

    private static final long max_mcast_grp$OFFSET = 188;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_mcast_grp
     * }
     */
    public static final long max_mcast_grp$offset() {
        return max_mcast_grp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_mcast_grp
     * }
     */
    public static int max_mcast_grp(MemorySegment struct) {
        return struct.get(max_mcast_grp$LAYOUT, max_mcast_grp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_mcast_grp
     * }
     */
    public static void max_mcast_grp(MemorySegment struct, int fieldValue) {
        struct.set(max_mcast_grp$LAYOUT, max_mcast_grp$OFFSET, fieldValue);
    }

    private static final OfInt max_mcast_qp_attach$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_mcast_qp_attach"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_mcast_qp_attach
     * }
     */
    public static final OfInt max_mcast_qp_attach$layout() {
        return max_mcast_qp_attach$LAYOUT;
    }

    private static final long max_mcast_qp_attach$OFFSET = 192;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_mcast_qp_attach
     * }
     */
    public static final long max_mcast_qp_attach$offset() {
        return max_mcast_qp_attach$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_mcast_qp_attach
     * }
     */
    public static int max_mcast_qp_attach(MemorySegment struct) {
        return struct.get(max_mcast_qp_attach$LAYOUT, max_mcast_qp_attach$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_mcast_qp_attach
     * }
     */
    public static void max_mcast_qp_attach(MemorySegment struct, int fieldValue) {
        struct.set(max_mcast_qp_attach$LAYOUT, max_mcast_qp_attach$OFFSET, fieldValue);
    }

    private static final OfInt max_total_mcast_qp_attach$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_total_mcast_qp_attach"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_total_mcast_qp_attach
     * }
     */
    public static final OfInt max_total_mcast_qp_attach$layout() {
        return max_total_mcast_qp_attach$LAYOUT;
    }

    private static final long max_total_mcast_qp_attach$OFFSET = 196;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_total_mcast_qp_attach
     * }
     */
    public static final long max_total_mcast_qp_attach$offset() {
        return max_total_mcast_qp_attach$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_total_mcast_qp_attach
     * }
     */
    public static int max_total_mcast_qp_attach(MemorySegment struct) {
        return struct.get(max_total_mcast_qp_attach$LAYOUT, max_total_mcast_qp_attach$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_total_mcast_qp_attach
     * }
     */
    public static void max_total_mcast_qp_attach(MemorySegment struct, int fieldValue) {
        struct.set(max_total_mcast_qp_attach$LAYOUT, max_total_mcast_qp_attach$OFFSET, fieldValue);
    }

    private static final OfInt max_ah$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_ah"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_ah
     * }
     */
    public static final OfInt max_ah$layout() {
        return max_ah$LAYOUT;
    }

    private static final long max_ah$OFFSET = 200;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_ah
     * }
     */
    public static final long max_ah$offset() {
        return max_ah$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_ah
     * }
     */
    public static int max_ah(MemorySegment struct) {
        return struct.get(max_ah$LAYOUT, max_ah$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_ah
     * }
     */
    public static void max_ah(MemorySegment struct, int fieldValue) {
        struct.set(max_ah$LAYOUT, max_ah$OFFSET, fieldValue);
    }

    private static final OfInt max_fmr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_fmr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_fmr
     * }
     */
    public static final OfInt max_fmr$layout() {
        return max_fmr$LAYOUT;
    }

    private static final long max_fmr$OFFSET = 204;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_fmr
     * }
     */
    public static final long max_fmr$offset() {
        return max_fmr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_fmr
     * }
     */
    public static int max_fmr(MemorySegment struct) {
        return struct.get(max_fmr$LAYOUT, max_fmr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_fmr
     * }
     */
    public static void max_fmr(MemorySegment struct, int fieldValue) {
        struct.set(max_fmr$LAYOUT, max_fmr$OFFSET, fieldValue);
    }

    private static final OfInt max_map_per_fmr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_map_per_fmr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_map_per_fmr
     * }
     */
    public static final OfInt max_map_per_fmr$layout() {
        return max_map_per_fmr$LAYOUT;
    }

    private static final long max_map_per_fmr$OFFSET = 208;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_map_per_fmr
     * }
     */
    public static final long max_map_per_fmr$offset() {
        return max_map_per_fmr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_map_per_fmr
     * }
     */
    public static int max_map_per_fmr(MemorySegment struct) {
        return struct.get(max_map_per_fmr$LAYOUT, max_map_per_fmr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_map_per_fmr
     * }
     */
    public static void max_map_per_fmr(MemorySegment struct, int fieldValue) {
        struct.set(max_map_per_fmr$LAYOUT, max_map_per_fmr$OFFSET, fieldValue);
    }

    private static final OfInt max_srq$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_srq
     * }
     */
    public static final OfInt max_srq$layout() {
        return max_srq$LAYOUT;
    }

    private static final long max_srq$OFFSET = 212;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_srq
     * }
     */
    public static final long max_srq$offset() {
        return max_srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_srq
     * }
     */
    public static int max_srq(MemorySegment struct) {
        return struct.get(max_srq$LAYOUT, max_srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_srq
     * }
     */
    public static void max_srq(MemorySegment struct, int fieldValue) {
        struct.set(max_srq$LAYOUT, max_srq$OFFSET, fieldValue);
    }

    private static final OfInt max_srq_wr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_srq_wr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_srq_wr
     * }
     */
    public static final OfInt max_srq_wr$layout() {
        return max_srq_wr$LAYOUT;
    }

    private static final long max_srq_wr$OFFSET = 216;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_srq_wr
     * }
     */
    public static final long max_srq_wr$offset() {
        return max_srq_wr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_srq_wr
     * }
     */
    public static int max_srq_wr(MemorySegment struct) {
        return struct.get(max_srq_wr$LAYOUT, max_srq_wr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_srq_wr
     * }
     */
    public static void max_srq_wr(MemorySegment struct, int fieldValue) {
        struct.set(max_srq_wr$LAYOUT, max_srq_wr$OFFSET, fieldValue);
    }

    private static final OfInt max_srq_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_srq_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max_srq_sge
     * }
     */
    public static final OfInt max_srq_sge$layout() {
        return max_srq_sge$LAYOUT;
    }

    private static final long max_srq_sge$OFFSET = 220;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max_srq_sge
     * }
     */
    public static final long max_srq_sge$offset() {
        return max_srq_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max_srq_sge
     * }
     */
    public static int max_srq_sge(MemorySegment struct) {
        return struct.get(max_srq_sge$LAYOUT, max_srq_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max_srq_sge
     * }
     */
    public static void max_srq_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_srq_sge$LAYOUT, max_srq_sge$OFFSET, fieldValue);
    }

    private static final OfShort max_pkeys$LAYOUT = (OfShort)$LAYOUT.select(groupElement("max_pkeys"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t max_pkeys
     * }
     */
    public static final OfShort max_pkeys$layout() {
        return max_pkeys$LAYOUT;
    }

    private static final long max_pkeys$OFFSET = 224;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t max_pkeys
     * }
     */
    public static final long max_pkeys$offset() {
        return max_pkeys$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t max_pkeys
     * }
     */
    public static short max_pkeys(MemorySegment struct) {
        return struct.get(max_pkeys$LAYOUT, max_pkeys$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t max_pkeys
     * }
     */
    public static void max_pkeys(MemorySegment struct, short fieldValue) {
        struct.set(max_pkeys$LAYOUT, max_pkeys$OFFSET, fieldValue);
    }

    private static final OfByte local_ca_ack_delay$LAYOUT = (OfByte)$LAYOUT.select(groupElement("local_ca_ack_delay"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t local_ca_ack_delay
     * }
     */
    public static final OfByte local_ca_ack_delay$layout() {
        return local_ca_ack_delay$LAYOUT;
    }

    private static final long local_ca_ack_delay$OFFSET = 226;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t local_ca_ack_delay
     * }
     */
    public static final long local_ca_ack_delay$offset() {
        return local_ca_ack_delay$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t local_ca_ack_delay
     * }
     */
    public static byte local_ca_ack_delay(MemorySegment struct) {
        return struct.get(local_ca_ack_delay$LAYOUT, local_ca_ack_delay$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t local_ca_ack_delay
     * }
     */
    public static void local_ca_ack_delay(MemorySegment struct, byte fieldValue) {
        struct.set(local_ca_ack_delay$LAYOUT, local_ca_ack_delay$OFFSET, fieldValue);
    }

    private static final OfByte phys_port_cnt$LAYOUT = (OfByte)$LAYOUT.select(groupElement("phys_port_cnt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t phys_port_cnt
     * }
     */
    public static final OfByte phys_port_cnt$layout() {
        return phys_port_cnt$LAYOUT;
    }

    private static final long phys_port_cnt$OFFSET = 227;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t phys_port_cnt
     * }
     */
    public static final long phys_port_cnt$offset() {
        return phys_port_cnt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t phys_port_cnt
     * }
     */
    public static byte phys_port_cnt(MemorySegment struct) {
        return struct.get(phys_port_cnt$LAYOUT, phys_port_cnt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t phys_port_cnt
     * }
     */
    public static void phys_port_cnt(MemorySegment struct, byte fieldValue) {
        struct.set(phys_port_cnt$LAYOUT, phys_port_cnt$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
