// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_qp_attr {
 *     enum ibv_qp_state qp_state;
 *     enum ibv_qp_state cur_qp_state;
 *     enum ibv_mtu path_mtu;
 *     enum ibv_mig_state path_mig_state;
 *     uint32_t qkey;
 *     uint32_t rq_psn;
 *     uint32_t sq_psn;
 *     uint32_t dest_qp_num;
 *     unsigned int qp_access_flags;
 *     struct ibv_qp_cap cap;
 *     struct ibv_ah_attr ah_attr;
 *     struct ibv_ah_attr alt_ah_attr;
 *     uint16_t pkey_index;
 *     uint16_t alt_pkey_index;
 *     uint8_t en_sqd_async_notify;
 *     uint8_t sq_draining;
 *     uint8_t max_rd_atomic;
 *     uint8_t max_dest_rd_atomic;
 *     uint8_t min_rnr_timer;
 *     uint8_t port_num;
 *     uint8_t timeout;
 *     uint8_t retry_cnt;
 *     uint8_t rnr_retry;
 *     uint8_t alt_port_num;
 *     uint8_t alt_timeout;
 *     uint32_t rate_limit;
 * }
 * }
 */
public class ibv_qp_attr {

    ibv_qp_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("qp_state"),
        Ibverbs.C_INT.withName("cur_qp_state"),
        Ibverbs.C_INT.withName("path_mtu"),
        Ibverbs.C_INT.withName("path_mig_state"),
        Ibverbs.C_INT.withName("qkey"),
        Ibverbs.C_INT.withName("rq_psn"),
        Ibverbs.C_INT.withName("sq_psn"),
        Ibverbs.C_INT.withName("dest_qp_num"),
        Ibverbs.C_INT.withName("qp_access_flags"),
        ibv_qp_cap.layout().withName("cap"),
        ibv_ah_attr.layout().withName("ah_attr"),
        ibv_ah_attr.layout().withName("alt_ah_attr"),
        Ibverbs.C_SHORT.withName("pkey_index"),
        Ibverbs.C_SHORT.withName("alt_pkey_index"),
        Ibverbs.C_CHAR.withName("en_sqd_async_notify"),
        Ibverbs.C_CHAR.withName("sq_draining"),
        Ibverbs.C_CHAR.withName("max_rd_atomic"),
        Ibverbs.C_CHAR.withName("max_dest_rd_atomic"),
        Ibverbs.C_CHAR.withName("min_rnr_timer"),
        Ibverbs.C_CHAR.withName("port_num"),
        Ibverbs.C_CHAR.withName("timeout"),
        Ibverbs.C_CHAR.withName("retry_cnt"),
        Ibverbs.C_CHAR.withName("rnr_retry"),
        Ibverbs.C_CHAR.withName("alt_port_num"),
        Ibverbs.C_CHAR.withName("alt_timeout"),
        MemoryLayout.paddingLayout(1),
        Ibverbs.C_INT.withName("rate_limit"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_qp_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt qp_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_state qp_state
     * }
     */
    public static final OfInt qp_state$layout() {
        return qp_state$LAYOUT;
    }

    private static final long qp_state$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_state qp_state
     * }
     */
    public static final long qp_state$offset() {
        return qp_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_state qp_state
     * }
     */
    public static int qp_state(MemorySegment struct) {
        return struct.get(qp_state$LAYOUT, qp_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_state qp_state
     * }
     */
    public static void qp_state(MemorySegment struct, int fieldValue) {
        struct.set(qp_state$LAYOUT, qp_state$OFFSET, fieldValue);
    }

    private static final OfInt cur_qp_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cur_qp_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_state cur_qp_state
     * }
     */
    public static final OfInt cur_qp_state$layout() {
        return cur_qp_state$LAYOUT;
    }

    private static final long cur_qp_state$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_state cur_qp_state
     * }
     */
    public static final long cur_qp_state$offset() {
        return cur_qp_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_state cur_qp_state
     * }
     */
    public static int cur_qp_state(MemorySegment struct) {
        return struct.get(cur_qp_state$LAYOUT, cur_qp_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_state cur_qp_state
     * }
     */
    public static void cur_qp_state(MemorySegment struct, int fieldValue) {
        struct.set(cur_qp_state$LAYOUT, cur_qp_state$OFFSET, fieldValue);
    }

    private static final OfInt path_mtu$LAYOUT = (OfInt)$LAYOUT.select(groupElement("path_mtu"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_mtu path_mtu
     * }
     */
    public static final OfInt path_mtu$layout() {
        return path_mtu$LAYOUT;
    }

    private static final long path_mtu$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_mtu path_mtu
     * }
     */
    public static final long path_mtu$offset() {
        return path_mtu$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_mtu path_mtu
     * }
     */
    public static int path_mtu(MemorySegment struct) {
        return struct.get(path_mtu$LAYOUT, path_mtu$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_mtu path_mtu
     * }
     */
    public static void path_mtu(MemorySegment struct, int fieldValue) {
        struct.set(path_mtu$LAYOUT, path_mtu$OFFSET, fieldValue);
    }

    private static final OfInt path_mig_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("path_mig_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_mig_state path_mig_state
     * }
     */
    public static final OfInt path_mig_state$layout() {
        return path_mig_state$LAYOUT;
    }

    private static final long path_mig_state$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_mig_state path_mig_state
     * }
     */
    public static final long path_mig_state$offset() {
        return path_mig_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_mig_state path_mig_state
     * }
     */
    public static int path_mig_state(MemorySegment struct) {
        return struct.get(path_mig_state$LAYOUT, path_mig_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_mig_state path_mig_state
     * }
     */
    public static void path_mig_state(MemorySegment struct, int fieldValue) {
        struct.set(path_mig_state$LAYOUT, path_mig_state$OFFSET, fieldValue);
    }

    private static final OfInt qkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static final OfInt qkey$layout() {
        return qkey$LAYOUT;
    }

    private static final long qkey$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static final long qkey$offset() {
        return qkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static int qkey(MemorySegment struct) {
        return struct.get(qkey$LAYOUT, qkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qkey
     * }
     */
    public static void qkey(MemorySegment struct, int fieldValue) {
        struct.set(qkey$LAYOUT, qkey$OFFSET, fieldValue);
    }

    private static final OfInt rq_psn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rq_psn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t rq_psn
     * }
     */
    public static final OfInt rq_psn$layout() {
        return rq_psn$LAYOUT;
    }

    private static final long rq_psn$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t rq_psn
     * }
     */
    public static final long rq_psn$offset() {
        return rq_psn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t rq_psn
     * }
     */
    public static int rq_psn(MemorySegment struct) {
        return struct.get(rq_psn$LAYOUT, rq_psn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t rq_psn
     * }
     */
    public static void rq_psn(MemorySegment struct, int fieldValue) {
        struct.set(rq_psn$LAYOUT, rq_psn$OFFSET, fieldValue);
    }

    private static final OfInt sq_psn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sq_psn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t sq_psn
     * }
     */
    public static final OfInt sq_psn$layout() {
        return sq_psn$LAYOUT;
    }

    private static final long sq_psn$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t sq_psn
     * }
     */
    public static final long sq_psn$offset() {
        return sq_psn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t sq_psn
     * }
     */
    public static int sq_psn(MemorySegment struct) {
        return struct.get(sq_psn$LAYOUT, sq_psn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t sq_psn
     * }
     */
    public static void sq_psn(MemorySegment struct, int fieldValue) {
        struct.set(sq_psn$LAYOUT, sq_psn$OFFSET, fieldValue);
    }

    private static final OfInt dest_qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dest_qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t dest_qp_num
     * }
     */
    public static final OfInt dest_qp_num$layout() {
        return dest_qp_num$LAYOUT;
    }

    private static final long dest_qp_num$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t dest_qp_num
     * }
     */
    public static final long dest_qp_num$offset() {
        return dest_qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t dest_qp_num
     * }
     */
    public static int dest_qp_num(MemorySegment struct) {
        return struct.get(dest_qp_num$LAYOUT, dest_qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t dest_qp_num
     * }
     */
    public static void dest_qp_num(MemorySegment struct, int fieldValue) {
        struct.set(dest_qp_num$LAYOUT, dest_qp_num$OFFSET, fieldValue);
    }

    private static final OfInt qp_access_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_access_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int qp_access_flags
     * }
     */
    public static final OfInt qp_access_flags$layout() {
        return qp_access_flags$LAYOUT;
    }

    private static final long qp_access_flags$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int qp_access_flags
     * }
     */
    public static final long qp_access_flags$offset() {
        return qp_access_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int qp_access_flags
     * }
     */
    public static int qp_access_flags(MemorySegment struct) {
        return struct.get(qp_access_flags$LAYOUT, qp_access_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int qp_access_flags
     * }
     */
    public static void qp_access_flags(MemorySegment struct, int fieldValue) {
        struct.set(qp_access_flags$LAYOUT, qp_access_flags$OFFSET, fieldValue);
    }

    private static final GroupLayout cap$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static final GroupLayout cap$layout() {
        return cap$LAYOUT;
    }

    private static final long cap$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static final long cap$offset() {
        return cap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static MemorySegment cap(MemorySegment struct) {
        return struct.asSlice(cap$OFFSET, cap$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_qp_cap cap
     * }
     */
    public static void cap(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cap$OFFSET, cap$LAYOUT.byteSize());
    }

    private static final GroupLayout ah_attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ah_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static final GroupLayout ah_attr$layout() {
        return ah_attr$LAYOUT;
    }

    private static final long ah_attr$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static final long ah_attr$offset() {
        return ah_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static MemorySegment ah_attr(MemorySegment struct) {
        return struct.asSlice(ah_attr$OFFSET, ah_attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr ah_attr
     * }
     */
    public static void ah_attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ah_attr$OFFSET, ah_attr$LAYOUT.byteSize());
    }

    private static final GroupLayout alt_ah_attr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("alt_ah_attr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr alt_ah_attr
     * }
     */
    public static final GroupLayout alt_ah_attr$layout() {
        return alt_ah_attr$LAYOUT;
    }

    private static final long alt_ah_attr$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr alt_ah_attr
     * }
     */
    public static final long alt_ah_attr$offset() {
        return alt_ah_attr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr alt_ah_attr
     * }
     */
    public static MemorySegment alt_ah_attr(MemorySegment struct) {
        return struct.asSlice(alt_ah_attr$OFFSET, alt_ah_attr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_ah_attr alt_ah_attr
     * }
     */
    public static void alt_ah_attr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, alt_ah_attr$OFFSET, alt_ah_attr$LAYOUT.byteSize());
    }

    private static final OfShort pkey_index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static final OfShort pkey_index$layout() {
        return pkey_index$LAYOUT;
    }

    private static final long pkey_index$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static final long pkey_index$offset() {
        return pkey_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static short pkey_index(MemorySegment struct) {
        return struct.get(pkey_index$LAYOUT, pkey_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static void pkey_index(MemorySegment struct, short fieldValue) {
        struct.set(pkey_index$LAYOUT, pkey_index$OFFSET, fieldValue);
    }

    private static final OfShort alt_pkey_index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("alt_pkey_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t alt_pkey_index
     * }
     */
    public static final OfShort alt_pkey_index$layout() {
        return alt_pkey_index$LAYOUT;
    }

    private static final long alt_pkey_index$OFFSET = 122;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t alt_pkey_index
     * }
     */
    public static final long alt_pkey_index$offset() {
        return alt_pkey_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t alt_pkey_index
     * }
     */
    public static short alt_pkey_index(MemorySegment struct) {
        return struct.get(alt_pkey_index$LAYOUT, alt_pkey_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t alt_pkey_index
     * }
     */
    public static void alt_pkey_index(MemorySegment struct, short fieldValue) {
        struct.set(alt_pkey_index$LAYOUT, alt_pkey_index$OFFSET, fieldValue);
    }

    private static final OfByte en_sqd_async_notify$LAYOUT = (OfByte)$LAYOUT.select(groupElement("en_sqd_async_notify"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t en_sqd_async_notify
     * }
     */
    public static final OfByte en_sqd_async_notify$layout() {
        return en_sqd_async_notify$LAYOUT;
    }

    private static final long en_sqd_async_notify$OFFSET = 124;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t en_sqd_async_notify
     * }
     */
    public static final long en_sqd_async_notify$offset() {
        return en_sqd_async_notify$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t en_sqd_async_notify
     * }
     */
    public static byte en_sqd_async_notify(MemorySegment struct) {
        return struct.get(en_sqd_async_notify$LAYOUT, en_sqd_async_notify$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t en_sqd_async_notify
     * }
     */
    public static void en_sqd_async_notify(MemorySegment struct, byte fieldValue) {
        struct.set(en_sqd_async_notify$LAYOUT, en_sqd_async_notify$OFFSET, fieldValue);
    }

    private static final OfByte sq_draining$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sq_draining"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t sq_draining
     * }
     */
    public static final OfByte sq_draining$layout() {
        return sq_draining$LAYOUT;
    }

    private static final long sq_draining$OFFSET = 125;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t sq_draining
     * }
     */
    public static final long sq_draining$offset() {
        return sq_draining$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t sq_draining
     * }
     */
    public static byte sq_draining(MemorySegment struct) {
        return struct.get(sq_draining$LAYOUT, sq_draining$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t sq_draining
     * }
     */
    public static void sq_draining(MemorySegment struct, byte fieldValue) {
        struct.set(sq_draining$LAYOUT, sq_draining$OFFSET, fieldValue);
    }

    private static final OfByte max_rd_atomic$LAYOUT = (OfByte)$LAYOUT.select(groupElement("max_rd_atomic"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t max_rd_atomic
     * }
     */
    public static final OfByte max_rd_atomic$layout() {
        return max_rd_atomic$LAYOUT;
    }

    private static final long max_rd_atomic$OFFSET = 126;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t max_rd_atomic
     * }
     */
    public static final long max_rd_atomic$offset() {
        return max_rd_atomic$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t max_rd_atomic
     * }
     */
    public static byte max_rd_atomic(MemorySegment struct) {
        return struct.get(max_rd_atomic$LAYOUT, max_rd_atomic$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t max_rd_atomic
     * }
     */
    public static void max_rd_atomic(MemorySegment struct, byte fieldValue) {
        struct.set(max_rd_atomic$LAYOUT, max_rd_atomic$OFFSET, fieldValue);
    }

    private static final OfByte max_dest_rd_atomic$LAYOUT = (OfByte)$LAYOUT.select(groupElement("max_dest_rd_atomic"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t max_dest_rd_atomic
     * }
     */
    public static final OfByte max_dest_rd_atomic$layout() {
        return max_dest_rd_atomic$LAYOUT;
    }

    private static final long max_dest_rd_atomic$OFFSET = 127;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t max_dest_rd_atomic
     * }
     */
    public static final long max_dest_rd_atomic$offset() {
        return max_dest_rd_atomic$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t max_dest_rd_atomic
     * }
     */
    public static byte max_dest_rd_atomic(MemorySegment struct) {
        return struct.get(max_dest_rd_atomic$LAYOUT, max_dest_rd_atomic$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t max_dest_rd_atomic
     * }
     */
    public static void max_dest_rd_atomic(MemorySegment struct, byte fieldValue) {
        struct.set(max_dest_rd_atomic$LAYOUT, max_dest_rd_atomic$OFFSET, fieldValue);
    }

    private static final OfByte min_rnr_timer$LAYOUT = (OfByte)$LAYOUT.select(groupElement("min_rnr_timer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t min_rnr_timer
     * }
     */
    public static final OfByte min_rnr_timer$layout() {
        return min_rnr_timer$LAYOUT;
    }

    private static final long min_rnr_timer$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t min_rnr_timer
     * }
     */
    public static final long min_rnr_timer$offset() {
        return min_rnr_timer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t min_rnr_timer
     * }
     */
    public static byte min_rnr_timer(MemorySegment struct) {
        return struct.get(min_rnr_timer$LAYOUT, min_rnr_timer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t min_rnr_timer
     * }
     */
    public static void min_rnr_timer(MemorySegment struct, byte fieldValue) {
        struct.set(min_rnr_timer$LAYOUT, min_rnr_timer$OFFSET, fieldValue);
    }

    private static final OfByte port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static final OfByte port_num$layout() {
        return port_num$LAYOUT;
    }

    private static final long port_num$OFFSET = 129;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static final long port_num$offset() {
        return port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static byte port_num(MemorySegment struct) {
        return struct.get(port_num$LAYOUT, port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t port_num
     * }
     */
    public static void port_num(MemorySegment struct, byte fieldValue) {
        struct.set(port_num$LAYOUT, port_num$OFFSET, fieldValue);
    }

    private static final OfByte timeout$LAYOUT = (OfByte)$LAYOUT.select(groupElement("timeout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t timeout
     * }
     */
    public static final OfByte timeout$layout() {
        return timeout$LAYOUT;
    }

    private static final long timeout$OFFSET = 130;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t timeout
     * }
     */
    public static final long timeout$offset() {
        return timeout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t timeout
     * }
     */
    public static byte timeout(MemorySegment struct) {
        return struct.get(timeout$LAYOUT, timeout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t timeout
     * }
     */
    public static void timeout(MemorySegment struct, byte fieldValue) {
        struct.set(timeout$LAYOUT, timeout$OFFSET, fieldValue);
    }

    private static final OfByte retry_cnt$LAYOUT = (OfByte)$LAYOUT.select(groupElement("retry_cnt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t retry_cnt
     * }
     */
    public static final OfByte retry_cnt$layout() {
        return retry_cnt$LAYOUT;
    }

    private static final long retry_cnt$OFFSET = 131;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t retry_cnt
     * }
     */
    public static final long retry_cnt$offset() {
        return retry_cnt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t retry_cnt
     * }
     */
    public static byte retry_cnt(MemorySegment struct) {
        return struct.get(retry_cnt$LAYOUT, retry_cnt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t retry_cnt
     * }
     */
    public static void retry_cnt(MemorySegment struct, byte fieldValue) {
        struct.set(retry_cnt$LAYOUT, retry_cnt$OFFSET, fieldValue);
    }

    private static final OfByte rnr_retry$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rnr_retry"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry
     * }
     */
    public static final OfByte rnr_retry$layout() {
        return rnr_retry$LAYOUT;
    }

    private static final long rnr_retry$OFFSET = 132;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry
     * }
     */
    public static final long rnr_retry$offset() {
        return rnr_retry$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry
     * }
     */
    public static byte rnr_retry(MemorySegment struct) {
        return struct.get(rnr_retry$LAYOUT, rnr_retry$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rnr_retry
     * }
     */
    public static void rnr_retry(MemorySegment struct, byte fieldValue) {
        struct.set(rnr_retry$LAYOUT, rnr_retry$OFFSET, fieldValue);
    }

    private static final OfByte alt_port_num$LAYOUT = (OfByte)$LAYOUT.select(groupElement("alt_port_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t alt_port_num
     * }
     */
    public static final OfByte alt_port_num$layout() {
        return alt_port_num$LAYOUT;
    }

    private static final long alt_port_num$OFFSET = 133;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t alt_port_num
     * }
     */
    public static final long alt_port_num$offset() {
        return alt_port_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t alt_port_num
     * }
     */
    public static byte alt_port_num(MemorySegment struct) {
        return struct.get(alt_port_num$LAYOUT, alt_port_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t alt_port_num
     * }
     */
    public static void alt_port_num(MemorySegment struct, byte fieldValue) {
        struct.set(alt_port_num$LAYOUT, alt_port_num$OFFSET, fieldValue);
    }

    private static final OfByte alt_timeout$LAYOUT = (OfByte)$LAYOUT.select(groupElement("alt_timeout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t alt_timeout
     * }
     */
    public static final OfByte alt_timeout$layout() {
        return alt_timeout$LAYOUT;
    }

    private static final long alt_timeout$OFFSET = 134;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t alt_timeout
     * }
     */
    public static final long alt_timeout$offset() {
        return alt_timeout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t alt_timeout
     * }
     */
    public static byte alt_timeout(MemorySegment struct) {
        return struct.get(alt_timeout$LAYOUT, alt_timeout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t alt_timeout
     * }
     */
    public static void alt_timeout(MemorySegment struct, byte fieldValue) {
        struct.set(alt_timeout$LAYOUT, alt_timeout$OFFSET, fieldValue);
    }

    private static final OfInt rate_limit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rate_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static final OfInt rate_limit$layout() {
        return rate_limit$LAYOUT;
    }

    private static final long rate_limit$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static final long rate_limit$offset() {
        return rate_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static int rate_limit(MemorySegment struct) {
        return struct.get(rate_limit$LAYOUT, rate_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static void rate_limit(MemorySegment struct, int fieldValue) {
        struct.set(rate_limit$LAYOUT, rate_limit$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
