// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_ops_wr {
 *     uint64_t wr_id;
 *     struct ibv_ops_wr *next;
 *     enum ibv_ops_wr_opcode opcode;
 *     int flags;
 *     struct {
 *         uint32_t unexpected_cnt;
 *         uint32_t handle;
 *         struct {
 *             uint64_t recv_wr_id;
 *             struct ibv_sge *sg_list;
 *             int num_sge;
 *             uint64_t tag;
 *             uint64_t mask;
 *         } add;
 *     } tm;
 * }
 * }
 */
public class ibv_ops_wr {

    ibv_ops_wr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG.withName("wr_id"),
        Ibverbs.C_POINTER.withName("next"),
        Ibverbs.C_INT.withName("opcode"),
        Ibverbs.C_INT.withName("flags"),
        ibv_ops_wr.tm.layout().withName("tm")
    ).withName("ibv_ops_wr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong wr_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("wr_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static final OfLong wr_id$layout() {
        return wr_id$LAYOUT;
    }

    private static final long wr_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static final long wr_id$offset() {
        return wr_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static long wr_id(MemorySegment struct) {
        return struct.get(wr_id$LAYOUT, wr_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static void wr_id(MemorySegment struct, long fieldValue) {
        struct.set(wr_id$LAYOUT, wr_id$OFFSET, fieldValue);
    }

    private static final AddressLayout next$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("next"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_ops_wr *next
     * }
     */
    public static final AddressLayout next$layout() {
        return next$LAYOUT;
    }

    private static final long next$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_ops_wr *next
     * }
     */
    public static final long next$offset() {
        return next$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_ops_wr *next
     * }
     */
    public static MemorySegment next(MemorySegment struct) {
        return struct.get(next$LAYOUT, next$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_ops_wr *next
     * }
     */
    public static void next(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(next$LAYOUT, next$OFFSET, fieldValue);
    }

    private static final OfInt opcode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("opcode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_ops_wr_opcode opcode
     * }
     */
    public static final OfInt opcode$layout() {
        return opcode$LAYOUT;
    }

    private static final long opcode$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_ops_wr_opcode opcode
     * }
     */
    public static final long opcode$offset() {
        return opcode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_ops_wr_opcode opcode
     * }
     */
    public static int opcode(MemorySegment struct) {
        return struct.get(opcode$LAYOUT, opcode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_ops_wr_opcode opcode
     * }
     */
    public static void opcode(MemorySegment struct, int fieldValue) {
        struct.set(opcode$LAYOUT, opcode$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     uint32_t unexpected_cnt;
     *     uint32_t handle;
     *     struct {
     *         uint64_t recv_wr_id;
     *         struct ibv_sge *sg_list;
     *         int num_sge;
     *         uint64_t tag;
     *         uint64_t mask;
     *     } add;
     * }
     * }
     */
    public static class tm {

        tm() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            Ibverbs.C_INT.withName("unexpected_cnt"),
            Ibverbs.C_INT.withName("handle"),
            ibv_ops_wr.tm.add.layout().withName("add")
        ).withName("$anon$1193:2");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt unexpected_cnt$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unexpected_cnt"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t unexpected_cnt
         * }
         */
        public static final OfInt unexpected_cnt$layout() {
            return unexpected_cnt$LAYOUT;
        }

        private static final long unexpected_cnt$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t unexpected_cnt
         * }
         */
        public static final long unexpected_cnt$offset() {
            return unexpected_cnt$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t unexpected_cnt
         * }
         */
        public static int unexpected_cnt(MemorySegment struct) {
            return struct.get(unexpected_cnt$LAYOUT, unexpected_cnt$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t unexpected_cnt
         * }
         */
        public static void unexpected_cnt(MemorySegment struct, int fieldValue) {
            struct.set(unexpected_cnt$LAYOUT, unexpected_cnt$OFFSET, fieldValue);
        }

        private static final OfInt handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("handle"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t handle
         * }
         */
        public static final OfInt handle$layout() {
            return handle$LAYOUT;
        }

        private static final long handle$OFFSET = 4;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t handle
         * }
         */
        public static final long handle$offset() {
            return handle$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t handle
         * }
         */
        public static int handle(MemorySegment struct) {
            return struct.get(handle$LAYOUT, handle$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t handle
         * }
         */
        public static void handle(MemorySegment struct, int fieldValue) {
            struct.set(handle$LAYOUT, handle$OFFSET, fieldValue);
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     uint64_t recv_wr_id;
         *     struct ibv_sge *sg_list;
         *     int num_sge;
         *     uint64_t tag;
         *     uint64_t mask;
         * }
         * }
         */
        public static class add {

            add() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                Ibverbs.C_LONG.withName("recv_wr_id"),
                Ibverbs.C_POINTER.withName("sg_list"),
                Ibverbs.C_INT.withName("num_sge"),
                MemoryLayout.paddingLayout(4),
                Ibverbs.C_LONG.withName("tag"),
                Ibverbs.C_LONG.withName("mask")
            ).withName("$anon$1196:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final OfLong recv_wr_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("recv_wr_id"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t recv_wr_id
             * }
             */
            public static final OfLong recv_wr_id$layout() {
                return recv_wr_id$LAYOUT;
            }

            private static final long recv_wr_id$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t recv_wr_id
             * }
             */
            public static final long recv_wr_id$offset() {
                return recv_wr_id$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t recv_wr_id
             * }
             */
            public static long recv_wr_id(MemorySegment struct) {
                return struct.get(recv_wr_id$LAYOUT, recv_wr_id$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t recv_wr_id
             * }
             */
            public static void recv_wr_id(MemorySegment struct, long fieldValue) {
                struct.set(recv_wr_id$LAYOUT, recv_wr_id$OFFSET, fieldValue);
            }

            private static final AddressLayout sg_list$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sg_list"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * struct ibv_sge *sg_list
             * }
             */
            public static final AddressLayout sg_list$layout() {
                return sg_list$LAYOUT;
            }

            private static final long sg_list$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * struct ibv_sge *sg_list
             * }
             */
            public static final long sg_list$offset() {
                return sg_list$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * struct ibv_sge *sg_list
             * }
             */
            public static MemorySegment sg_list(MemorySegment struct) {
                return struct.get(sg_list$LAYOUT, sg_list$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * struct ibv_sge *sg_list
             * }
             */
            public static void sg_list(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(sg_list$LAYOUT, sg_list$OFFSET, fieldValue);
            }

            private static final OfInt num_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("num_sge"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int num_sge
             * }
             */
            public static final OfInt num_sge$layout() {
                return num_sge$LAYOUT;
            }

            private static final long num_sge$OFFSET = 16;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int num_sge
             * }
             */
            public static final long num_sge$offset() {
                return num_sge$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int num_sge
             * }
             */
            public static int num_sge(MemorySegment struct) {
                return struct.get(num_sge$LAYOUT, num_sge$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int num_sge
             * }
             */
            public static void num_sge(MemorySegment struct, int fieldValue) {
                struct.set(num_sge$LAYOUT, num_sge$OFFSET, fieldValue);
            }

            private static final OfLong tag$LAYOUT = (OfLong)$LAYOUT.select(groupElement("tag"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t tag
             * }
             */
            public static final OfLong tag$layout() {
                return tag$LAYOUT;
            }

            private static final long tag$OFFSET = 24;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t tag
             * }
             */
            public static final long tag$offset() {
                return tag$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t tag
             * }
             */
            public static long tag(MemorySegment struct) {
                return struct.get(tag$LAYOUT, tag$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t tag
             * }
             */
            public static void tag(MemorySegment struct, long fieldValue) {
                struct.set(tag$LAYOUT, tag$OFFSET, fieldValue);
            }

            private static final OfLong mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("mask"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * uint64_t mask
             * }
             */
            public static final OfLong mask$layout() {
                return mask$LAYOUT;
            }

            private static final long mask$OFFSET = 32;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * uint64_t mask
             * }
             */
            public static final long mask$offset() {
                return mask$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * uint64_t mask
             * }
             */
            public static long mask(MemorySegment struct) {
                return struct.get(mask$LAYOUT, mask$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * uint64_t mask
             * }
             */
            public static void mask(MemorySegment struct, long fieldValue) {
                struct.set(mask$LAYOUT, mask$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout add$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("add"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t recv_wr_id;
         *     struct ibv_sge *sg_list;
         *     int num_sge;
         *     uint64_t tag;
         *     uint64_t mask;
         * } add
         * }
         */
        public static final GroupLayout add$layout() {
            return add$LAYOUT;
        }

        private static final long add$OFFSET = 8;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t recv_wr_id;
         *     struct ibv_sge *sg_list;
         *     int num_sge;
         *     uint64_t tag;
         *     uint64_t mask;
         * } add
         * }
         */
        public static final long add$offset() {
            return add$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t recv_wr_id;
         *     struct ibv_sge *sg_list;
         *     int num_sge;
         *     uint64_t tag;
         *     uint64_t mask;
         * } add
         * }
         */
        public static MemorySegment add(MemorySegment struct) {
            return struct.asSlice(add$OFFSET, add$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     uint64_t recv_wr_id;
         *     struct ibv_sge *sg_list;
         *     int num_sge;
         *     uint64_t tag;
         *     uint64_t mask;
         * } add
         * }
         */
        public static void add(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, add$OFFSET, add$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout tm$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("tm"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t unexpected_cnt;
     *     uint32_t handle;
     *     struct {
     *         uint64_t recv_wr_id;
     *         struct ibv_sge *sg_list;
     *         int num_sge;
     *         uint64_t tag;
     *         uint64_t mask;
     *     } add;
     * } tm
     * }
     */
    public static final GroupLayout tm$layout() {
        return tm$LAYOUT;
    }

    private static final long tm$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t unexpected_cnt;
     *     uint32_t handle;
     *     struct {
     *         uint64_t recv_wr_id;
     *         struct ibv_sge *sg_list;
     *         int num_sge;
     *         uint64_t tag;
     *         uint64_t mask;
     *     } add;
     * } tm
     * }
     */
    public static final long tm$offset() {
        return tm$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t unexpected_cnt;
     *     uint32_t handle;
     *     struct {
     *         uint64_t recv_wr_id;
     *         struct ibv_sge *sg_list;
     *         int num_sge;
     *         uint64_t tag;
     *         uint64_t mask;
     *     } add;
     * } tm
     * }
     */
    public static MemorySegment tm(MemorySegment struct) {
        return struct.asSlice(tm$OFFSET, tm$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t unexpected_cnt;
     *     uint32_t handle;
     *     struct {
     *         uint64_t recv_wr_id;
     *         struct ibv_sge *sg_list;
     *         int num_sge;
     *         uint64_t tag;
     *         uint64_t mask;
     *     } add;
     * } tm
     * }
     */
    public static void tm(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tm$OFFSET, tm$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

