// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_rss_caps {
 *     uint32_t supported_qpts;
 *     uint32_t max_rwq_indirection_tables;
 *     uint32_t max_rwq_indirection_table_size;
 *     uint64_t rx_hash_fields_mask;
 *     uint8_t rx_hash_function;
 * }
 * }
 */
public class ibv_rss_caps {

    ibv_rss_caps() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("supported_qpts"),
        Ibverbs.C_INT.withName("max_rwq_indirection_tables"),
        Ibverbs.C_INT.withName("max_rwq_indirection_table_size"),
        MemoryLayout.paddingLayout(4),
        Ibverbs.C_LONG.withName("rx_hash_fields_mask"),
        Ibverbs.C_CHAR.withName("rx_hash_function"),
        MemoryLayout.paddingLayout(7)
    ).withName("ibv_rss_caps");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt supported_qpts$LAYOUT = (OfInt)$LAYOUT.select(groupElement("supported_qpts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t supported_qpts
     * }
     */
    public static final OfInt supported_qpts$layout() {
        return supported_qpts$LAYOUT;
    }

    private static final long supported_qpts$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t supported_qpts
     * }
     */
    public static final long supported_qpts$offset() {
        return supported_qpts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t supported_qpts
     * }
     */
    public static int supported_qpts(MemorySegment struct) {
        return struct.get(supported_qpts$LAYOUT, supported_qpts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t supported_qpts
     * }
     */
    public static void supported_qpts(MemorySegment struct, int fieldValue) {
        struct.set(supported_qpts$LAYOUT, supported_qpts$OFFSET, fieldValue);
    }

    private static final OfInt max_rwq_indirection_tables$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_rwq_indirection_tables"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_tables
     * }
     */
    public static final OfInt max_rwq_indirection_tables$layout() {
        return max_rwq_indirection_tables$LAYOUT;
    }

    private static final long max_rwq_indirection_tables$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_tables
     * }
     */
    public static final long max_rwq_indirection_tables$offset() {
        return max_rwq_indirection_tables$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_tables
     * }
     */
    public static int max_rwq_indirection_tables(MemorySegment struct) {
        return struct.get(max_rwq_indirection_tables$LAYOUT, max_rwq_indirection_tables$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_tables
     * }
     */
    public static void max_rwq_indirection_tables(MemorySegment struct, int fieldValue) {
        struct.set(max_rwq_indirection_tables$LAYOUT, max_rwq_indirection_tables$OFFSET, fieldValue);
    }

    private static final OfInt max_rwq_indirection_table_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_rwq_indirection_table_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_table_size
     * }
     */
    public static final OfInt max_rwq_indirection_table_size$layout() {
        return max_rwq_indirection_table_size$LAYOUT;
    }

    private static final long max_rwq_indirection_table_size$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_table_size
     * }
     */
    public static final long max_rwq_indirection_table_size$offset() {
        return max_rwq_indirection_table_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_table_size
     * }
     */
    public static int max_rwq_indirection_table_size(MemorySegment struct) {
        return struct.get(max_rwq_indirection_table_size$LAYOUT, max_rwq_indirection_table_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_rwq_indirection_table_size
     * }
     */
    public static void max_rwq_indirection_table_size(MemorySegment struct, int fieldValue) {
        struct.set(max_rwq_indirection_table_size$LAYOUT, max_rwq_indirection_table_size$OFFSET, fieldValue);
    }

    private static final OfLong rx_hash_fields_mask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("rx_hash_fields_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static final OfLong rx_hash_fields_mask$layout() {
        return rx_hash_fields_mask$LAYOUT;
    }

    private static final long rx_hash_fields_mask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static final long rx_hash_fields_mask$offset() {
        return rx_hash_fields_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static long rx_hash_fields_mask(MemorySegment struct) {
        return struct.get(rx_hash_fields_mask$LAYOUT, rx_hash_fields_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t rx_hash_fields_mask
     * }
     */
    public static void rx_hash_fields_mask(MemorySegment struct, long fieldValue) {
        struct.set(rx_hash_fields_mask$LAYOUT, rx_hash_fields_mask$OFFSET, fieldValue);
    }

    private static final OfByte rx_hash_function$LAYOUT = (OfByte)$LAYOUT.select(groupElement("rx_hash_function"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static final OfByte rx_hash_function$layout() {
        return rx_hash_function$LAYOUT;
    }

    private static final long rx_hash_function$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static final long rx_hash_function$offset() {
        return rx_hash_function$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static byte rx_hash_function(MemorySegment struct) {
        return struct.get(rx_hash_function$LAYOUT, rx_hash_function$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t rx_hash_function
     * }
     */
    public static void rx_hash_function(MemorySegment struct, byte fieldValue) {
        struct.set(rx_hash_function$LAYOUT, rx_hash_function$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

