// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_flow_attr {
 *     uint32_t comp_mask;
 *     enum ibv_flow_attr_type type;
 *     uint16_t size;
 *     uint16_t priority;
 *     uint8_t num_of_specs;
 *     uint8_t port;
 *     uint32_t flags;
 * }
 * }
 */
public class ibv_flow_attr {

    ibv_flow_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("comp_mask"),
        Ibverbs.C_INT.withName("type"),
        Ibverbs.C_SHORT.withName("size"),
        Ibverbs.C_SHORT.withName("priority"),
        Ibverbs.C_CHAR.withName("num_of_specs"),
        Ibverbs.C_CHAR.withName("port"),
        MemoryLayout.paddingLayout(2),
        Ibverbs.C_INT.withName("flags")
    ).withName("ibv_flow_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_flow_attr_type type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_flow_attr_type type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_flow_attr_type type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_flow_attr_type type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfShort size$LAYOUT = (OfShort)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t size
     * }
     */
    public static final OfShort size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t size
     * }
     */
    public static short size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t size
     * }
     */
    public static void size(MemorySegment struct, short fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final OfShort priority$LAYOUT = (OfShort)$LAYOUT.select(groupElement("priority"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t priority
     * }
     */
    public static final OfShort priority$layout() {
        return priority$LAYOUT;
    }

    private static final long priority$OFFSET = 10;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t priority
     * }
     */
    public static final long priority$offset() {
        return priority$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t priority
     * }
     */
    public static short priority(MemorySegment struct) {
        return struct.get(priority$LAYOUT, priority$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t priority
     * }
     */
    public static void priority(MemorySegment struct, short fieldValue) {
        struct.set(priority$LAYOUT, priority$OFFSET, fieldValue);
    }

    private static final OfByte num_of_specs$LAYOUT = (OfByte)$LAYOUT.select(groupElement("num_of_specs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t num_of_specs
     * }
     */
    public static final OfByte num_of_specs$layout() {
        return num_of_specs$LAYOUT;
    }

    private static final long num_of_specs$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t num_of_specs
     * }
     */
    public static final long num_of_specs$offset() {
        return num_of_specs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t num_of_specs
     * }
     */
    public static byte num_of_specs(MemorySegment struct) {
        return struct.get(num_of_specs$LAYOUT, num_of_specs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t num_of_specs
     * }
     */
    public static void num_of_specs(MemorySegment struct, byte fieldValue) {
        struct.set(num_of_specs$LAYOUT, num_of_specs$OFFSET, fieldValue);
    }

    private static final OfByte port$LAYOUT = (OfByte)$LAYOUT.select(groupElement("port"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t port
     * }
     */
    public static final OfByte port$layout() {
        return port$LAYOUT;
    }

    private static final long port$OFFSET = 13;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t port
     * }
     */
    public static final long port$offset() {
        return port$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t port
     * }
     */
    public static byte port(MemorySegment struct) {
        return struct.get(port$LAYOUT, port$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t port
     * }
     */
    public static void port(MemorySegment struct, byte fieldValue) {
        struct.set(port$LAYOUT, port$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

