// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_qp {
 *     struct ibv_context *context;
 *     void *qp_context;
 *     struct ibv_pd *pd;
 *     struct ibv_cq *send_cq;
 *     struct ibv_cq *recv_cq;
 *     struct ibv_srq *srq;
 *     uint32_t handle;
 *     uint32_t qp_num;
 *     enum ibv_qp_state state;
 *     enum ibv_qp_type qp_type;
 *     pthread_mutex_t mutex;
 *     pthread_cond_t cond;
 *     uint32_t events_completed;
 * }
 * }
 */
public class ibv_qp {

    ibv_qp() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_POINTER.withName("context"),
        Ibverbs.C_POINTER.withName("qp_context"),
        Ibverbs.C_POINTER.withName("pd"),
        Ibverbs.C_POINTER.withName("send_cq"),
        Ibverbs.C_POINTER.withName("recv_cq"),
        Ibverbs.C_POINTER.withName("srq"),
        Ibverbs.C_INT.withName("handle"),
        Ibverbs.C_INT.withName("qp_num"),
        Ibverbs.C_INT.withName("state"),
        Ibverbs.C_INT.withName("qp_type"),
        pthread_mutex_t.layout().withName("mutex"),
        pthread_cond_t.layout().withName("cond"),
        Ibverbs.C_INT.withName("events_completed"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_qp");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final AddressLayout context$layout() {
        return context$LAYOUT;
    }

    private static final long context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final long context$offset() {
        return context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static MemorySegment context(MemorySegment struct) {
        return struct.get(context$LAYOUT, context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static void context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(context$LAYOUT, context$OFFSET, fieldValue);
    }

    private static final AddressLayout qp_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("qp_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final AddressLayout qp_context$layout() {
        return qp_context$LAYOUT;
    }

    private static final long qp_context$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final long qp_context$offset() {
        return qp_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static MemorySegment qp_context(MemorySegment struct) {
        return struct.get(qp_context$LAYOUT, qp_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static void qp_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(qp_context$LAYOUT, qp_context$OFFSET, fieldValue);
    }

    private static final AddressLayout pd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final AddressLayout pd$layout() {
        return pd$LAYOUT;
    }

    private static final long pd$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static final long pd$offset() {
        return pd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static MemorySegment pd(MemorySegment struct) {
        return struct.get(pd$LAYOUT, pd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_pd *pd
     * }
     */
    public static void pd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pd$LAYOUT, pd$OFFSET, fieldValue);
    }

    private static final AddressLayout send_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("send_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final AddressLayout send_cq$layout() {
        return send_cq$LAYOUT;
    }

    private static final long send_cq$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static final long send_cq$offset() {
        return send_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static MemorySegment send_cq(MemorySegment struct) {
        return struct.get(send_cq$LAYOUT, send_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *send_cq
     * }
     */
    public static void send_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(send_cq$LAYOUT, send_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout recv_cq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("recv_cq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final AddressLayout recv_cq$layout() {
        return recv_cq$LAYOUT;
    }

    private static final long recv_cq$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static final long recv_cq$offset() {
        return recv_cq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static MemorySegment recv_cq(MemorySegment struct) {
        return struct.get(recv_cq$LAYOUT, recv_cq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_cq *recv_cq
     * }
     */
    public static void recv_cq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(recv_cq$LAYOUT, recv_cq$OFFSET, fieldValue);
    }

    private static final AddressLayout srq$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final AddressLayout srq$layout() {
        return srq$LAYOUT;
    }

    private static final long srq$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static final long srq$offset() {
        return srq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static MemorySegment srq(MemorySegment struct) {
        return struct.get(srq$LAYOUT, srq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_srq *srq
     * }
     */
    public static void srq(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srq$LAYOUT, srq$OFFSET, fieldValue);
    }

    private static final OfInt handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final OfInt handle$layout() {
        return handle$LAYOUT;
    }

    private static final long handle$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final long handle$offset() {
        return handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static int handle(MemorySegment struct) {
        return struct.get(handle$LAYOUT, handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static void handle(MemorySegment struct, int fieldValue) {
        struct.set(handle$LAYOUT, handle$OFFSET, fieldValue);
    }

    private static final OfInt qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final OfInt qp_num$layout() {
        return qp_num$LAYOUT;
    }

    private static final long qp_num$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final long qp_num$offset() {
        return qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static int qp_num(MemorySegment struct) {
        return struct.get(qp_num$LAYOUT, qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static void qp_num(MemorySegment struct, int fieldValue) {
        struct.set(qp_num$LAYOUT, qp_num$OFFSET, fieldValue);
    }

    private static final OfInt state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_state state
     * }
     */
    public static final OfInt state$layout() {
        return state$LAYOUT;
    }

    private static final long state$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_state state
     * }
     */
    public static final long state$offset() {
        return state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_state state
     * }
     */
    public static int state(MemorySegment struct) {
        return struct.get(state$LAYOUT, state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_state state
     * }
     */
    public static void state(MemorySegment struct, int fieldValue) {
        struct.set(state$LAYOUT, state$OFFSET, fieldValue);
    }

    private static final OfInt qp_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final OfInt qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static int qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, int fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    private static final GroupLayout mutex$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mutex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final GroupLayout mutex$layout() {
        return mutex$LAYOUT;
    }

    private static final long mutex$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final long mutex$offset() {
        return mutex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static MemorySegment mutex(MemorySegment struct) {
        return struct.asSlice(mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static void mutex(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    private static final GroupLayout cond$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cond"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final GroupLayout cond$layout() {
        return cond$LAYOUT;
    }

    private static final long cond$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final long cond$offset() {
        return cond$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static MemorySegment cond(MemorySegment struct) {
        return struct.asSlice(cond$OFFSET, cond$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static void cond(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cond$OFFSET, cond$LAYOUT.byteSize());
    }

    private static final OfInt events_completed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("events_completed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static final OfInt events_completed$layout() {
        return events_completed$LAYOUT;
    }

    private static final long events_completed$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static final long events_completed$offset() {
        return events_completed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static int events_completed(MemorySegment struct) {
        return struct.get(events_completed$LAYOUT, events_completed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t events_completed
     * }
     */
    public static void events_completed(MemorySegment struct, int fieldValue) {
        struct.set(events_completed$LAYOUT, events_completed$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

