// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_cq {
 *     struct ibv_context *context;
 *     struct ibv_comp_channel *channel;
 *     void *cq_context;
 *     uint32_t handle;
 *     int cqe;
 *     pthread_mutex_t mutex;
 *     pthread_cond_t cond;
 *     uint32_t comp_events_completed;
 *     uint32_t async_events_completed;
 * }
 * }
 */
public class ibv_cq {

    ibv_cq() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_POINTER.withName("context"),
        Ibverbs.C_POINTER.withName("channel"),
        Ibverbs.C_POINTER.withName("cq_context"),
        Ibverbs.C_INT.withName("handle"),
        Ibverbs.C_INT.withName("cqe"),
        pthread_mutex_t.layout().withName("mutex"),
        pthread_cond_t.layout().withName("cond"),
        Ibverbs.C_INT.withName("comp_events_completed"),
        Ibverbs.C_INT.withName("async_events_completed")
    ).withName("ibv_cq");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final AddressLayout context$layout() {
        return context$LAYOUT;
    }

    private static final long context$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static final long context$offset() {
        return context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static MemorySegment context(MemorySegment struct) {
        return struct.get(context$LAYOUT, context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context *context
     * }
     */
    public static void context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(context$LAYOUT, context$OFFSET, fieldValue);
    }

    private static final AddressLayout channel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("channel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static final AddressLayout channel$layout() {
        return channel$LAYOUT;
    }

    private static final long channel$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static final long channel$offset() {
        return channel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static MemorySegment channel(MemorySegment struct) {
        return struct.get(channel$LAYOUT, channel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_comp_channel *channel
     * }
     */
    public static void channel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(channel$LAYOUT, channel$OFFSET, fieldValue);
    }

    private static final AddressLayout cq_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cq_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static final AddressLayout cq_context$layout() {
        return cq_context$LAYOUT;
    }

    private static final long cq_context$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static final long cq_context$offset() {
        return cq_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static MemorySegment cq_context(MemorySegment struct) {
        return struct.get(cq_context$LAYOUT, cq_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *cq_context
     * }
     */
    public static void cq_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cq_context$LAYOUT, cq_context$OFFSET, fieldValue);
    }

    private static final OfInt handle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("handle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final OfInt handle$layout() {
        return handle$LAYOUT;
    }

    private static final long handle$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static final long handle$offset() {
        return handle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static int handle(MemorySegment struct) {
        return struct.get(handle$LAYOUT, handle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t handle
     * }
     */
    public static void handle(MemorySegment struct, int fieldValue) {
        struct.set(handle$LAYOUT, handle$OFFSET, fieldValue);
    }

    private static final OfInt cqe$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cqe"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int cqe
     * }
     */
    public static final OfInt cqe$layout() {
        return cqe$LAYOUT;
    }

    private static final long cqe$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int cqe
     * }
     */
    public static final long cqe$offset() {
        return cqe$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int cqe
     * }
     */
    public static int cqe(MemorySegment struct) {
        return struct.get(cqe$LAYOUT, cqe$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int cqe
     * }
     */
    public static void cqe(MemorySegment struct, int fieldValue) {
        struct.set(cqe$LAYOUT, cqe$OFFSET, fieldValue);
    }

    private static final GroupLayout mutex$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mutex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final GroupLayout mutex$layout() {
        return mutex$LAYOUT;
    }

    private static final long mutex$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final long mutex$offset() {
        return mutex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static MemorySegment mutex(MemorySegment struct) {
        return struct.asSlice(mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static void mutex(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    private static final GroupLayout cond$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cond"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final GroupLayout cond$layout() {
        return cond$LAYOUT;
    }

    private static final long cond$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static final long cond$offset() {
        return cond$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static MemorySegment cond(MemorySegment struct) {
        return struct.asSlice(cond$OFFSET, cond$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_cond_t cond
     * }
     */
    public static void cond(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cond$OFFSET, cond$LAYOUT.byteSize());
    }

    private static final OfInt comp_events_completed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_events_completed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_events_completed
     * }
     */
    public static final OfInt comp_events_completed$layout() {
        return comp_events_completed$LAYOUT;
    }

    private static final long comp_events_completed$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_events_completed
     * }
     */
    public static final long comp_events_completed$offset() {
        return comp_events_completed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_events_completed
     * }
     */
    public static int comp_events_completed(MemorySegment struct) {
        return struct.get(comp_events_completed$LAYOUT, comp_events_completed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_events_completed
     * }
     */
    public static void comp_events_completed(MemorySegment struct, int fieldValue) {
        struct.set(comp_events_completed$LAYOUT, comp_events_completed$OFFSET, fieldValue);
    }

    private static final OfInt async_events_completed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("async_events_completed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t async_events_completed
     * }
     */
    public static final OfInt async_events_completed$layout() {
        return async_events_completed$LAYOUT;
    }

    private static final long async_events_completed$OFFSET = 124;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t async_events_completed
     * }
     */
    public static final long async_events_completed$offset() {
        return async_events_completed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t async_events_completed
     * }
     */
    public static int async_events_completed(MemorySegment struct) {
        return struct.get(async_events_completed$LAYOUT, async_events_completed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t async_events_completed
     * }
     */
    public static void async_events_completed(MemorySegment struct, int fieldValue) {
        struct.set(async_events_completed$LAYOUT, async_events_completed$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

