// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_odp_caps {
 *     uint64_t general_caps;
 *     struct {
 *         uint32_t rc_odp_caps;
 *         uint32_t uc_odp_caps;
 *         uint32_t ud_odp_caps;
 *     } per_transport_caps;
 * }
 * }
 */
public class ibv_odp_caps {

    ibv_odp_caps() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG.withName("general_caps"),
        ibv_odp_caps.per_transport_caps.layout().withName("per_transport_caps"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_odp_caps");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong general_caps$LAYOUT = (OfLong)$LAYOUT.select(groupElement("general_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t general_caps
     * }
     */
    public static final OfLong general_caps$layout() {
        return general_caps$LAYOUT;
    }

    private static final long general_caps$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t general_caps
     * }
     */
    public static final long general_caps$offset() {
        return general_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t general_caps
     * }
     */
    public static long general_caps(MemorySegment struct) {
        return struct.get(general_caps$LAYOUT, general_caps$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t general_caps
     * }
     */
    public static void general_caps(MemorySegment struct, long fieldValue) {
        struct.set(general_caps$LAYOUT, general_caps$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     uint32_t rc_odp_caps;
     *     uint32_t uc_odp_caps;
     *     uint32_t ud_odp_caps;
     * }
     * }
     */
    public static class per_transport_caps {

        per_transport_caps() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            Ibverbs.C_INT.withName("rc_odp_caps"),
            Ibverbs.C_INT.withName("uc_odp_caps"),
            Ibverbs.C_INT.withName("ud_odp_caps")
        ).withName("$anon$242:2");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt rc_odp_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rc_odp_caps"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t rc_odp_caps
         * }
         */
        public static final OfInt rc_odp_caps$layout() {
            return rc_odp_caps$LAYOUT;
        }

        private static final long rc_odp_caps$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t rc_odp_caps
         * }
         */
        public static final long rc_odp_caps$offset() {
            return rc_odp_caps$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t rc_odp_caps
         * }
         */
        public static int rc_odp_caps(MemorySegment struct) {
            return struct.get(rc_odp_caps$LAYOUT, rc_odp_caps$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t rc_odp_caps
         * }
         */
        public static void rc_odp_caps(MemorySegment struct, int fieldValue) {
            struct.set(rc_odp_caps$LAYOUT, rc_odp_caps$OFFSET, fieldValue);
        }

        private static final OfInt uc_odp_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("uc_odp_caps"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t uc_odp_caps
         * }
         */
        public static final OfInt uc_odp_caps$layout() {
            return uc_odp_caps$LAYOUT;
        }

        private static final long uc_odp_caps$OFFSET = 4;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t uc_odp_caps
         * }
         */
        public static final long uc_odp_caps$offset() {
            return uc_odp_caps$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t uc_odp_caps
         * }
         */
        public static int uc_odp_caps(MemorySegment struct) {
            return struct.get(uc_odp_caps$LAYOUT, uc_odp_caps$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t uc_odp_caps
         * }
         */
        public static void uc_odp_caps(MemorySegment struct, int fieldValue) {
            struct.set(uc_odp_caps$LAYOUT, uc_odp_caps$OFFSET, fieldValue);
        }

        private static final OfInt ud_odp_caps$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ud_odp_caps"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t ud_odp_caps
         * }
         */
        public static final OfInt ud_odp_caps$layout() {
            return ud_odp_caps$LAYOUT;
        }

        private static final long ud_odp_caps$OFFSET = 8;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t ud_odp_caps
         * }
         */
        public static final long ud_odp_caps$offset() {
            return ud_odp_caps$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t ud_odp_caps
         * }
         */
        public static int ud_odp_caps(MemorySegment struct) {
            return struct.get(ud_odp_caps$LAYOUT, ud_odp_caps$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t ud_odp_caps
         * }
         */
        public static void ud_odp_caps(MemorySegment struct, int fieldValue) {
            struct.set(ud_odp_caps$LAYOUT, ud_odp_caps$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout per_transport_caps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("per_transport_caps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t rc_odp_caps;
     *     uint32_t uc_odp_caps;
     *     uint32_t ud_odp_caps;
     * } per_transport_caps
     * }
     */
    public static final GroupLayout per_transport_caps$layout() {
        return per_transport_caps$LAYOUT;
    }

    private static final long per_transport_caps$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t rc_odp_caps;
     *     uint32_t uc_odp_caps;
     *     uint32_t ud_odp_caps;
     * } per_transport_caps
     * }
     */
    public static final long per_transport_caps$offset() {
        return per_transport_caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t rc_odp_caps;
     *     uint32_t uc_odp_caps;
     *     uint32_t ud_odp_caps;
     * } per_transport_caps
     * }
     */
    public static MemorySegment per_transport_caps(MemorySegment struct) {
        return struct.asSlice(per_transport_caps$OFFSET, per_transport_caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t rc_odp_caps;
     *     uint32_t uc_odp_caps;
     *     uint32_t ud_odp_caps;
     * } per_transport_caps
     * }
     */
    public static void per_transport_caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, per_transport_caps$OFFSET, per_transport_caps$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

