// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_mw_bind_info {
 *     struct ibv_mr *mr;
 *     uint64_t addr;
 *     uint64_t length;
 *     unsigned int mw_access_flags;
 * }
 * }
 */
public class ibv_mw_bind_info {

    ibv_mw_bind_info() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_POINTER.withName("mr"),
        Ibverbs.C_LONG.withName("addr"),
        Ibverbs.C_LONG.withName("length"),
        Ibverbs.C_INT.withName("mw_access_flags"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_mw_bind_info");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout mr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("mr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_mr *mr
     * }
     */
    public static final AddressLayout mr$layout() {
        return mr$LAYOUT;
    }

    private static final long mr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_mr *mr
     * }
     */
    public static final long mr$offset() {
        return mr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_mr *mr
     * }
     */
    public static MemorySegment mr(MemorySegment struct) {
        return struct.get(mr$LAYOUT, mr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_mr *mr
     * }
     */
    public static void mr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(mr$LAYOUT, mr$OFFSET, fieldValue);
    }

    private static final OfLong addr$LAYOUT = (OfLong)$LAYOUT.select(groupElement("addr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t addr
     * }
     */
    public static final OfLong addr$layout() {
        return addr$LAYOUT;
    }

    private static final long addr$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t addr
     * }
     */
    public static final long addr$offset() {
        return addr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t addr
     * }
     */
    public static long addr(MemorySegment struct) {
        return struct.get(addr$LAYOUT, addr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t addr
     * }
     */
    public static void addr(MemorySegment struct, long fieldValue) {
        struct.set(addr$LAYOUT, addr$OFFSET, fieldValue);
    }

    private static final OfLong length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t length
     * }
     */
    public static final OfLong length$layout() {
        return length$LAYOUT;
    }

    private static final long length$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t length
     * }
     */
    public static final long length$offset() {
        return length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t length
     * }
     */
    public static long length(MemorySegment struct) {
        return struct.get(length$LAYOUT, length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t length
     * }
     */
    public static void length(MemorySegment struct, long fieldValue) {
        struct.set(length$LAYOUT, length$OFFSET, fieldValue);
    }

    private static final OfInt mw_access_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("mw_access_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int mw_access_flags
     * }
     */
    public static final OfInt mw_access_flags$layout() {
        return mw_access_flags$LAYOUT;
    }

    private static final long mw_access_flags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int mw_access_flags
     * }
     */
    public static final long mw_access_flags$offset() {
        return mw_access_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int mw_access_flags
     * }
     */
    public static int mw_access_flags(MemorySegment struct) {
        return struct.get(mw_access_flags$LAYOUT, mw_access_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int mw_access_flags
     * }
     */
    public static void mw_access_flags(MemorySegment struct, int fieldValue) {
        struct.set(mw_access_flags$LAYOUT, mw_access_flags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

