// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_qp_open_attr {
 *     uint32_t comp_mask;
 *     uint32_t qp_num;
 *     struct ibv_xrcd *xrcd;
 *     void *qp_context;
 *     enum ibv_qp_type qp_type;
 * }
 * }
 */
public class ibv_qp_open_attr {

    ibv_qp_open_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("comp_mask"),
        Ibverbs.C_INT.withName("qp_num"),
        Ibverbs.C_POINTER.withName("xrcd"),
        Ibverbs.C_POINTER.withName("qp_context"),
        Ibverbs.C_INT.withName("qp_type"),
        MemoryLayout.paddingLayout(4)
    ).withName("ibv_qp_open_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    private static final OfInt qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final OfInt qp_num$layout() {
        return qp_num$LAYOUT;
    }

    private static final long qp_num$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final long qp_num$offset() {
        return qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static int qp_num(MemorySegment struct) {
        return struct.get(qp_num$LAYOUT, qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static void qp_num(MemorySegment struct, int fieldValue) {
        struct.set(qp_num$LAYOUT, qp_num$OFFSET, fieldValue);
    }

    private static final AddressLayout xrcd$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("xrcd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static final AddressLayout xrcd$layout() {
        return xrcd$LAYOUT;
    }

    private static final long xrcd$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static final long xrcd$offset() {
        return xrcd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static MemorySegment xrcd(MemorySegment struct) {
        return struct.get(xrcd$LAYOUT, xrcd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_xrcd *xrcd
     * }
     */
    public static void xrcd(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(xrcd$LAYOUT, xrcd$OFFSET, fieldValue);
    }

    private static final AddressLayout qp_context$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("qp_context"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final AddressLayout qp_context$layout() {
        return qp_context$LAYOUT;
    }

    private static final long qp_context$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static final long qp_context$offset() {
        return qp_context$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static MemorySegment qp_context(MemorySegment struct) {
        return struct.get(qp_context$LAYOUT, qp_context$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *qp_context
     * }
     */
    public static void qp_context(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(qp_context$LAYOUT, qp_context$OFFSET, fieldValue);
    }

    private static final OfInt qp_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final OfInt qp_type$layout() {
        return qp_type$LAYOUT;
    }

    private static final long qp_type$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static final long qp_type$offset() {
        return qp_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static int qp_type(MemorySegment struct) {
        return struct.get(qp_type$LAYOUT, qp_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_qp_type qp_type
     * }
     */
    public static void qp_type(MemorySegment struct, int fieldValue) {
        struct.set(qp_type$LAYOUT, qp_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

