// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_context {
 *     struct ibv_device *device;
 *     struct ibv_context_ops ops;
 *     int cmd_fd;
 *     int async_fd;
 *     int num_comp_vectors;
 *     pthread_mutex_t mutex;
 *     void *abi_compat;
 * }
 * }
 */
public class ibv_context {

    ibv_context() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_POINTER.withName("device"),
        ibv_context_ops.layout().withName("ops"),
        Ibverbs.C_INT.withName("cmd_fd"),
        Ibverbs.C_INT.withName("async_fd"),
        Ibverbs.C_INT.withName("num_comp_vectors"),
        MemoryLayout.paddingLayout(4),
        pthread_mutex_t.layout().withName("mutex"),
        Ibverbs.C_POINTER.withName("abi_compat")
    ).withName("ibv_context");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout device$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("device"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_device *device
     * }
     */
    public static final AddressLayout device$layout() {
        return device$LAYOUT;
    }

    private static final long device$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_device *device
     * }
     */
    public static final long device$offset() {
        return device$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_device *device
     * }
     */
    public static MemorySegment device(MemorySegment struct) {
        return struct.get(device$LAYOUT, device$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_device *device
     * }
     */
    public static void device(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(device$LAYOUT, device$OFFSET, fieldValue);
    }

    private static final GroupLayout ops$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ops"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ibv_context_ops ops
     * }
     */
    public static final GroupLayout ops$layout() {
        return ops$LAYOUT;
    }

    private static final long ops$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ibv_context_ops ops
     * }
     */
    public static final long ops$offset() {
        return ops$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ibv_context_ops ops
     * }
     */
    public static MemorySegment ops(MemorySegment struct) {
        return struct.asSlice(ops$OFFSET, ops$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ibv_context_ops ops
     * }
     */
    public static void ops(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ops$OFFSET, ops$LAYOUT.byteSize());
    }

    private static final OfInt cmd_fd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cmd_fd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int cmd_fd
     * }
     */
    public static final OfInt cmd_fd$layout() {
        return cmd_fd$LAYOUT;
    }

    private static final long cmd_fd$OFFSET = 264;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int cmd_fd
     * }
     */
    public static final long cmd_fd$offset() {
        return cmd_fd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int cmd_fd
     * }
     */
    public static int cmd_fd(MemorySegment struct) {
        return struct.get(cmd_fd$LAYOUT, cmd_fd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int cmd_fd
     * }
     */
    public static void cmd_fd(MemorySegment struct, int fieldValue) {
        struct.set(cmd_fd$LAYOUT, cmd_fd$OFFSET, fieldValue);
    }

    private static final OfInt async_fd$LAYOUT = (OfInt)$LAYOUT.select(groupElement("async_fd"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int async_fd
     * }
     */
    public static final OfInt async_fd$layout() {
        return async_fd$LAYOUT;
    }

    private static final long async_fd$OFFSET = 268;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int async_fd
     * }
     */
    public static final long async_fd$offset() {
        return async_fd$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int async_fd
     * }
     */
    public static int async_fd(MemorySegment struct) {
        return struct.get(async_fd$LAYOUT, async_fd$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int async_fd
     * }
     */
    public static void async_fd(MemorySegment struct, int fieldValue) {
        struct.set(async_fd$LAYOUT, async_fd$OFFSET, fieldValue);
    }

    private static final OfInt num_comp_vectors$LAYOUT = (OfInt)$LAYOUT.select(groupElement("num_comp_vectors"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int num_comp_vectors
     * }
     */
    public static final OfInt num_comp_vectors$layout() {
        return num_comp_vectors$LAYOUT;
    }

    private static final long num_comp_vectors$OFFSET = 272;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int num_comp_vectors
     * }
     */
    public static final long num_comp_vectors$offset() {
        return num_comp_vectors$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int num_comp_vectors
     * }
     */
    public static int num_comp_vectors(MemorySegment struct) {
        return struct.get(num_comp_vectors$LAYOUT, num_comp_vectors$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int num_comp_vectors
     * }
     */
    public static void num_comp_vectors(MemorySegment struct, int fieldValue) {
        struct.set(num_comp_vectors$LAYOUT, num_comp_vectors$OFFSET, fieldValue);
    }

    private static final GroupLayout mutex$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("mutex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final GroupLayout mutex$layout() {
        return mutex$LAYOUT;
    }

    private static final long mutex$OFFSET = 280;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static final long mutex$offset() {
        return mutex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static MemorySegment mutex(MemorySegment struct) {
        return struct.asSlice(mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pthread_mutex_t mutex
     * }
     */
    public static void mutex(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, mutex$OFFSET, mutex$LAYOUT.byteSize());
    }

    private static final AddressLayout abi_compat$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("abi_compat"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *abi_compat
     * }
     */
    public static final AddressLayout abi_compat$layout() {
        return abi_compat$LAYOUT;
    }

    private static final long abi_compat$OFFSET = 320;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *abi_compat
     * }
     */
    public static final long abi_compat$offset() {
        return abi_compat$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *abi_compat
     * }
     */
    public static MemorySegment abi_compat(MemorySegment struct) {
        return struct.get(abi_compat$LAYOUT, abi_compat$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *abi_compat
     * }
     */
    public static void abi_compat(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(abi_compat$LAYOUT, abi_compat$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

