// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_qp_rate_limit_attr {
 *     uint32_t rate_limit;
 *     uint32_t max_burst_sz;
 *     uint16_t typical_pkt_sz;
 *     uint32_t comp_mask;
 * }
 * }
 */
public class ibv_qp_rate_limit_attr {

    ibv_qp_rate_limit_attr() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("rate_limit"),
        Ibverbs.C_INT.withName("max_burst_sz"),
        Ibverbs.C_SHORT.withName("typical_pkt_sz"),
        MemoryLayout.paddingLayout(2),
        Ibverbs.C_INT.withName("comp_mask")
    ).withName("ibv_qp_rate_limit_attr");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt rate_limit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rate_limit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static final OfInt rate_limit$layout() {
        return rate_limit$LAYOUT;
    }

    private static final long rate_limit$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static final long rate_limit$offset() {
        return rate_limit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static int rate_limit(MemorySegment struct) {
        return struct.get(rate_limit$LAYOUT, rate_limit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t rate_limit
     * }
     */
    public static void rate_limit(MemorySegment struct, int fieldValue) {
        struct.set(rate_limit$LAYOUT, rate_limit$OFFSET, fieldValue);
    }

    private static final OfInt max_burst_sz$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_burst_sz"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_burst_sz
     * }
     */
    public static final OfInt max_burst_sz$layout() {
        return max_burst_sz$LAYOUT;
    }

    private static final long max_burst_sz$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_burst_sz
     * }
     */
    public static final long max_burst_sz$offset() {
        return max_burst_sz$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_burst_sz
     * }
     */
    public static int max_burst_sz(MemorySegment struct) {
        return struct.get(max_burst_sz$LAYOUT, max_burst_sz$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_burst_sz
     * }
     */
    public static void max_burst_sz(MemorySegment struct, int fieldValue) {
        struct.set(max_burst_sz$LAYOUT, max_burst_sz$OFFSET, fieldValue);
    }

    private static final OfShort typical_pkt_sz$LAYOUT = (OfShort)$LAYOUT.select(groupElement("typical_pkt_sz"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t typical_pkt_sz
     * }
     */
    public static final OfShort typical_pkt_sz$layout() {
        return typical_pkt_sz$LAYOUT;
    }

    private static final long typical_pkt_sz$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t typical_pkt_sz
     * }
     */
    public static final long typical_pkt_sz$offset() {
        return typical_pkt_sz$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t typical_pkt_sz
     * }
     */
    public static short typical_pkt_sz(MemorySegment struct) {
        return struct.get(typical_pkt_sz$LAYOUT, typical_pkt_sz$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t typical_pkt_sz
     * }
     */
    public static void typical_pkt_sz(MemorySegment struct, short fieldValue) {
        struct.set(typical_pkt_sz$LAYOUT, typical_pkt_sz$OFFSET, fieldValue);
    }

    private static final OfInt comp_mask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("comp_mask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final OfInt comp_mask$layout() {
        return comp_mask$LAYOUT;
    }

    private static final long comp_mask$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static final long comp_mask$offset() {
        return comp_mask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static int comp_mask(MemorySegment struct) {
        return struct.get(comp_mask$LAYOUT, comp_mask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t comp_mask
     * }
     */
    public static void comp_mask(MemorySegment struct, int fieldValue) {
        struct.set(comp_mask$LAYOUT, comp_mask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

