// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_wc {
 *     uint64_t wr_id;
 *     enum ibv_wc_status status;
 *     enum ibv_wc_opcode opcode;
 *     uint32_t vendor_err;
 *     uint32_t byte_len;
 *     union {
 *         __be32 imm_data;
 *         uint32_t invalidated_rkey;
 *     };
 *     uint32_t qp_num;
 *     uint32_t src_qp;
 *     unsigned int wc_flags;
 *     uint16_t pkey_index;
 *     uint16_t slid;
 *     uint8_t sl;
 *     uint8_t dlid_path_bits;
 * }
 * }
 */
public class ibv_wc {

    ibv_wc() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_LONG.withName("wr_id"),
        Ibverbs.C_INT.withName("status"),
        Ibverbs.C_INT.withName("opcode"),
        Ibverbs.C_INT.withName("vendor_err"),
        Ibverbs.C_INT.withName("byte_len"),
        MemoryLayout.unionLayout(
            Ibverbs.C_INT.withName("imm_data"),
            Ibverbs.C_INT.withName("invalidated_rkey")
        ).withName("$anon$594:2"),
        Ibverbs.C_INT.withName("qp_num"),
        Ibverbs.C_INT.withName("src_qp"),
        Ibverbs.C_INT.withName("wc_flags"),
        Ibverbs.C_SHORT.withName("pkey_index"),
        Ibverbs.C_SHORT.withName("slid"),
        Ibverbs.C_CHAR.withName("sl"),
        Ibverbs.C_CHAR.withName("dlid_path_bits"),
        MemoryLayout.paddingLayout(2)
    ).withName("ibv_wc");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong wr_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("wr_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static final OfLong wr_id$layout() {
        return wr_id$LAYOUT;
    }

    private static final long wr_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static final long wr_id$offset() {
        return wr_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static long wr_id(MemorySegment struct) {
        return struct.get(wr_id$LAYOUT, wr_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t wr_id
     * }
     */
    public static void wr_id(MemorySegment struct, long fieldValue) {
        struct.set(wr_id$LAYOUT, wr_id$OFFSET, fieldValue);
    }

    private static final OfInt status$LAYOUT = (OfInt)$LAYOUT.select(groupElement("status"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_wc_status status
     * }
     */
    public static final OfInt status$layout() {
        return status$LAYOUT;
    }

    private static final long status$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_wc_status status
     * }
     */
    public static final long status$offset() {
        return status$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_wc_status status
     * }
     */
    public static int status(MemorySegment struct) {
        return struct.get(status$LAYOUT, status$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_wc_status status
     * }
     */
    public static void status(MemorySegment struct, int fieldValue) {
        struct.set(status$LAYOUT, status$OFFSET, fieldValue);
    }

    private static final OfInt opcode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("opcode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum ibv_wc_opcode opcode
     * }
     */
    public static final OfInt opcode$layout() {
        return opcode$LAYOUT;
    }

    private static final long opcode$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum ibv_wc_opcode opcode
     * }
     */
    public static final long opcode$offset() {
        return opcode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum ibv_wc_opcode opcode
     * }
     */
    public static int opcode(MemorySegment struct) {
        return struct.get(opcode$LAYOUT, opcode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum ibv_wc_opcode opcode
     * }
     */
    public static void opcode(MemorySegment struct, int fieldValue) {
        struct.set(opcode$LAYOUT, opcode$OFFSET, fieldValue);
    }

    private static final OfInt vendor_err$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vendor_err"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vendor_err
     * }
     */
    public static final OfInt vendor_err$layout() {
        return vendor_err$LAYOUT;
    }

    private static final long vendor_err$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vendor_err
     * }
     */
    public static final long vendor_err$offset() {
        return vendor_err$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vendor_err
     * }
     */
    public static int vendor_err(MemorySegment struct) {
        return struct.get(vendor_err$LAYOUT, vendor_err$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vendor_err
     * }
     */
    public static void vendor_err(MemorySegment struct, int fieldValue) {
        struct.set(vendor_err$LAYOUT, vendor_err$OFFSET, fieldValue);
    }

    private static final OfInt byte_len$LAYOUT = (OfInt)$LAYOUT.select(groupElement("byte_len"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t byte_len
     * }
     */
    public static final OfInt byte_len$layout() {
        return byte_len$LAYOUT;
    }

    private static final long byte_len$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t byte_len
     * }
     */
    public static final long byte_len$offset() {
        return byte_len$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t byte_len
     * }
     */
    public static int byte_len(MemorySegment struct) {
        return struct.get(byte_len$LAYOUT, byte_len$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t byte_len
     * }
     */
    public static void byte_len(MemorySegment struct, int fieldValue) {
        struct.set(byte_len$LAYOUT, byte_len$OFFSET, fieldValue);
    }

    private static final OfInt imm_data$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$594:2"), groupElement("imm_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static final OfInt imm_data$layout() {
        return imm_data$LAYOUT;
    }

    private static final long imm_data$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static final long imm_data$offset() {
        return imm_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static int imm_data(MemorySegment struct) {
        return struct.get(imm_data$LAYOUT, imm_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __be32 imm_data
     * }
     */
    public static void imm_data(MemorySegment struct, int fieldValue) {
        struct.set(imm_data$LAYOUT, imm_data$OFFSET, fieldValue);
    }

    private static final OfInt invalidated_rkey$LAYOUT = (OfInt)$LAYOUT.select(groupElement("$anon$594:2"), groupElement("invalidated_rkey"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t invalidated_rkey
     * }
     */
    public static final OfInt invalidated_rkey$layout() {
        return invalidated_rkey$LAYOUT;
    }

    private static final long invalidated_rkey$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t invalidated_rkey
     * }
     */
    public static final long invalidated_rkey$offset() {
        return invalidated_rkey$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t invalidated_rkey
     * }
     */
    public static int invalidated_rkey(MemorySegment struct) {
        return struct.get(invalidated_rkey$LAYOUT, invalidated_rkey$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t invalidated_rkey
     * }
     */
    public static void invalidated_rkey(MemorySegment struct, int fieldValue) {
        struct.set(invalidated_rkey$LAYOUT, invalidated_rkey$OFFSET, fieldValue);
    }

    private static final OfInt qp_num$LAYOUT = (OfInt)$LAYOUT.select(groupElement("qp_num"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final OfInt qp_num$layout() {
        return qp_num$LAYOUT;
    }

    private static final long qp_num$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static final long qp_num$offset() {
        return qp_num$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static int qp_num(MemorySegment struct) {
        return struct.get(qp_num$LAYOUT, qp_num$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t qp_num
     * }
     */
    public static void qp_num(MemorySegment struct, int fieldValue) {
        struct.set(qp_num$LAYOUT, qp_num$OFFSET, fieldValue);
    }

    private static final OfInt src_qp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("src_qp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t src_qp
     * }
     */
    public static final OfInt src_qp$layout() {
        return src_qp$LAYOUT;
    }

    private static final long src_qp$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t src_qp
     * }
     */
    public static final long src_qp$offset() {
        return src_qp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t src_qp
     * }
     */
    public static int src_qp(MemorySegment struct) {
        return struct.get(src_qp$LAYOUT, src_qp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t src_qp
     * }
     */
    public static void src_qp(MemorySegment struct, int fieldValue) {
        struct.set(src_qp$LAYOUT, src_qp$OFFSET, fieldValue);
    }

    private static final OfInt wc_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wc_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int wc_flags
     * }
     */
    public static final OfInt wc_flags$layout() {
        return wc_flags$LAYOUT;
    }

    private static final long wc_flags$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int wc_flags
     * }
     */
    public static final long wc_flags$offset() {
        return wc_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int wc_flags
     * }
     */
    public static int wc_flags(MemorySegment struct) {
        return struct.get(wc_flags$LAYOUT, wc_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int wc_flags
     * }
     */
    public static void wc_flags(MemorySegment struct, int fieldValue) {
        struct.set(wc_flags$LAYOUT, wc_flags$OFFSET, fieldValue);
    }

    private static final OfShort pkey_index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("pkey_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static final OfShort pkey_index$layout() {
        return pkey_index$LAYOUT;
    }

    private static final long pkey_index$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static final long pkey_index$offset() {
        return pkey_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static short pkey_index(MemorySegment struct) {
        return struct.get(pkey_index$LAYOUT, pkey_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t pkey_index
     * }
     */
    public static void pkey_index(MemorySegment struct, short fieldValue) {
        struct.set(pkey_index$LAYOUT, pkey_index$OFFSET, fieldValue);
    }

    private static final OfShort slid$LAYOUT = (OfShort)$LAYOUT.select(groupElement("slid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16_t slid
     * }
     */
    public static final OfShort slid$layout() {
        return slid$LAYOUT;
    }

    private static final long slid$OFFSET = 42;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16_t slid
     * }
     */
    public static final long slid$offset() {
        return slid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16_t slid
     * }
     */
    public static short slid(MemorySegment struct) {
        return struct.get(slid$LAYOUT, slid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16_t slid
     * }
     */
    public static void slid(MemorySegment struct, short fieldValue) {
        struct.set(slid$LAYOUT, slid$OFFSET, fieldValue);
    }

    private static final OfByte sl$LAYOUT = (OfByte)$LAYOUT.select(groupElement("sl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static final OfByte sl$layout() {
        return sl$LAYOUT;
    }

    private static final long sl$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static final long sl$offset() {
        return sl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static byte sl(MemorySegment struct) {
        return struct.get(sl$LAYOUT, sl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t sl
     * }
     */
    public static void sl(MemorySegment struct, byte fieldValue) {
        struct.set(sl$LAYOUT, sl$OFFSET, fieldValue);
    }

    private static final OfByte dlid_path_bits$LAYOUT = (OfByte)$LAYOUT.select(groupElement("dlid_path_bits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t dlid_path_bits
     * }
     */
    public static final OfByte dlid_path_bits$layout() {
        return dlid_path_bits$LAYOUT;
    }

    private static final long dlid_path_bits$OFFSET = 45;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t dlid_path_bits
     * }
     */
    public static final long dlid_path_bits$offset() {
        return dlid_path_bits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t dlid_path_bits
     * }
     */
    public static byte dlid_path_bits(MemorySegment struct) {
        return struct.get(dlid_path_bits$LAYOUT, dlid_path_bits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t dlid_path_bits
     * }
     */
    public static void dlid_path_bits(MemorySegment struct, byte fieldValue) {
        struct.set(dlid_path_bits$LAYOUT, dlid_path_bits$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

