// Generated by jextract

package io.surfworks.warpforge.io.ffi.ibverbs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ibv_tm_caps {
 *     uint32_t max_rndv_hdr_size;
 *     uint32_t max_num_tags;
 *     uint32_t flags;
 *     uint32_t max_ops;
 *     uint32_t max_sge;
 * }
 * }
 */
public class ibv_tm_caps {

    ibv_tm_caps() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Ibverbs.C_INT.withName("max_rndv_hdr_size"),
        Ibverbs.C_INT.withName("max_num_tags"),
        Ibverbs.C_INT.withName("flags"),
        Ibverbs.C_INT.withName("max_ops"),
        Ibverbs.C_INT.withName("max_sge")
    ).withName("ibv_tm_caps");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt max_rndv_hdr_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_rndv_hdr_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_rndv_hdr_size
     * }
     */
    public static final OfInt max_rndv_hdr_size$layout() {
        return max_rndv_hdr_size$LAYOUT;
    }

    private static final long max_rndv_hdr_size$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_rndv_hdr_size
     * }
     */
    public static final long max_rndv_hdr_size$offset() {
        return max_rndv_hdr_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_rndv_hdr_size
     * }
     */
    public static int max_rndv_hdr_size(MemorySegment struct) {
        return struct.get(max_rndv_hdr_size$LAYOUT, max_rndv_hdr_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_rndv_hdr_size
     * }
     */
    public static void max_rndv_hdr_size(MemorySegment struct, int fieldValue) {
        struct.set(max_rndv_hdr_size$LAYOUT, max_rndv_hdr_size$OFFSET, fieldValue);
    }

    private static final OfInt max_num_tags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_num_tags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_num_tags
     * }
     */
    public static final OfInt max_num_tags$layout() {
        return max_num_tags$LAYOUT;
    }

    private static final long max_num_tags$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_num_tags
     * }
     */
    public static final long max_num_tags$offset() {
        return max_num_tags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_num_tags
     * }
     */
    public static int max_num_tags(MemorySegment struct) {
        return struct.get(max_num_tags$LAYOUT, max_num_tags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_num_tags
     * }
     */
    public static void max_num_tags(MemorySegment struct, int fieldValue) {
        struct.set(max_num_tags$LAYOUT, max_num_tags$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt max_ops$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_ops"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_ops
     * }
     */
    public static final OfInt max_ops$layout() {
        return max_ops$LAYOUT;
    }

    private static final long max_ops$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_ops
     * }
     */
    public static final long max_ops$offset() {
        return max_ops$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_ops
     * }
     */
    public static int max_ops(MemorySegment struct) {
        return struct.get(max_ops$LAYOUT, max_ops$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_ops
     * }
     */
    public static void max_ops(MemorySegment struct, int fieldValue) {
        struct.set(max_ops$LAYOUT, max_ops$OFFSET, fieldValue);
    }

    private static final OfInt max_sge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_sge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static final OfInt max_sge$layout() {
        return max_sge$LAYOUT;
    }

    private static final long max_sge$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static final long max_sge$offset() {
        return max_sge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static int max_sge(MemorySegment struct) {
        return struct.get(max_sge$LAYOUT, max_sge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_sge
     * }
     */
    public static void max_sge(MemorySegment struct, int fieldValue) {
        struct.set(max_sge$LAYOUT, max_sge$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

